{
  "url": "https://www.retaildive.com/news/visa-mastercard-holiday-retail-sales-growth/808666/",
  "title": "Visa, Mastercard track roughly 4% US holiday retail sales growth | Retail Dive",
  "snippet": "# Visa, Mastercard track roughly 4% US holiday retail sales growth. * Visa pegged U.S. holiday spending growth at 4.2% compared to last year, while Mastercard’s SpendingPulse report calculated that U.S. spending between Nov. 1 and Dec. 21 grew 3.9% year over year, according to analysis from the resp",
  "domain": "retaildive.com",
  "publishedDateInvalid": true,
  "extractedText": "An article from Dive Brief Visa, Mastercard track roughly 4% US holiday retail sales growth The 2025 holiday season saw consumers shopping across channels to land the best deals and maximize convenience, according to new reports. Published Jan. 6, 2026 By Tatiana Walk-Morris Share Copy link Email LinkedIn X/Twitter Facebook Print License Add us on Google Packages in front of a fireplace. Online spending rose during the 2025 holiday season, according to new reports. Getty Images Listen to the article 3 min This audio is auto-generated. Please let us know if you have feedback. Dive Brief: Visa pegged U.S. holiday spending growth at 4.2% compared to last year, while Mastercard’s SpendingPulse report calculated that U.S. spending between Nov. 1 and Dec. 21 grew 3.9% year over year, according to analysis from the respective payments giants released in December. Though 73% of holiday transactions occurred in physical stores, consumers made 27% of holiday purchases online, with online retail spending rising 7.8% compared to last year, per Visa’s analysis. Similarly, Mastercard tracked a 7.4% jump in holiday e-commerce sales. The two reports reached different conclusions on apparel sales growth. Visa tallied a 5.3% jump in clothing and accessories sales, but Mastercard found a 7.8% increase in apparel sales. Dive Insight: Mastercard and Visa’s results aren’t far off from pre-season holiday forecasts. In September, Bain & Company projected a 4% jump in retail sales in November and December, with a 2.75% bump in in-store sales. Visa and Mastercard’s respective reports offer some insight into the split between online and in-store sales. Visa attributed the rise in e-commerce sales in part to early-season promotions and convenience for shoppers. Still, in-store sales saw a 2.9% bump from a year earlier, which Mastercard attributes to “the convergence of blended shopping experiences,” per its report. “Whether shoppers were upgrading their tech, refreshing their closets, or stocking up at one‑stop shops, retailers delivered seamless shopping experiences both in stores and online,” Wayne Best, chief economist at Visa, said in a press release. “This season also marked a turning point, with artificial intelligence shaping how people discover products, compare prices, and interact with offers. This led to a more informed, more intentional consumer, ensuring they could stretch their discretionary spending.” Other research suggests that shoppers sought to stretch their budgets during the season. An ICSC survey published in October found that 64% of shoppers planned to take more time in their discount search and 67% anticipated more trips to stores to look for deals. Furthermore, almost two-thirds of respondents said they would shop at discount department stores, the survey found. Beyond searching for discounts, shoppers employed other strategies to make the most of their holiday funds, including using buy now, pay later services and shopping earlier. An Adobe Analytics analysis found that BNPL drove $1.03 billion in online spend on Cyber Monday, up 4.2% from a year earlier. “Consumers demonstrated flexibility and confidence this season, shopping early, leveraging promotions, and investing in meaningful experiences and wish-list items,” Michelle Meyer, chief economist at Mastercard Economics Institute, said in a statement. “They also blended online and in-store shopping to find the best deals and maximize convenience.” purchase licensing rights Filed Under: Consumer Trends, Holidays",
  "wordCount": 533,
  "author": "\n        \n        \n            By\n            Tatiana Walk-Morris\n        \n        \n    ",
  "hash": "0d94b758eca0cb33",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:23:34.426Z",
  "sourceType": "discovery"
}