{
  "url": "https://www.elastic.co/blog/machine-learning-puts-the-personal-in-ecommerce-personalization",
  "title": "Here’s how Machine Learning puts the ‘personal’ in ecommerce personalization | Elastic Blog",
  "snippet": "Here's how Machine Learning puts the 'personal' in ecommerce personalization. You can transform your search box into your sales rep—when you",
  "domain": "elastic.co",
  "publishedDate": "1656460800000",
  "extractedText": "Here’s how Machine Learning puts the ‘personal’ in ecommerce personalizationYou can transform your search box into your sales rep—when you have the right tools.ByTrish SammerJune 29, 2022Share on TwitterShare on TwitterShare on LinkedInShare on LinkedInShare on FacebookShare on FacebookShare by EmailShare by EmailPrint this pagePrintAn impactful customer experience that drives purchases and loyalty isn't just about delivering what a customer says they want — it's about predicting and proactively serving up what they need. We might be able to imagine this work in a store with salespeople. But as organizations scale and customer interactions happen across digital and in-person mediums, their data grows. E-commerce must lean on the latest in machine learning and artificial intelligence to deliver a personalized sales experience. That means relying on a powerful search box.Let’s take a look at how Elastic’s machine learning for search capabilities are powering this kind of e-commerce personalization. But first, let’s talk about what’s at stake. What is e-commerce personalization and why is it important?E-commerce personalization is when a seller delivers an online customer experience that provides individualized suggestions based on a customer’s intent, demographics, previous purchases, context (for example, device type and location), and browsing history. It can also include targeting offers based on behaviors and connecting with customers at key moments. This type of shopping experience is not only convenient—customers are also starting to demand it. According to recent research by McKinsey:71% of customers expect a personalized shopping experience and 76% are frustrated when a company fails to deliver it.Companies that prioritize personalization grow 40% faster than those that don’t. 78% of customers say that they’re more likely to recommend a company to a friend and return to that company for repurchase after receiving a personalized shopping experience. How HappyFresh handled the pandemic ecommerce surge with help from Elastic.How a search box enabled by machine learning can power e-commerce personalizationEvery time someone types something into your search box, you have the opportunity to learn something about them. With machine learning, that information can be put to use for the mutual benefit of your company and the customer. The key is ensuring that your data, whether it’s stored on-premise, in the cloud, or across multiple cloud environments, can be accessed and processed quickly and efficiently. Here are some ways Elastic can help create exceptional personalized shopping experiences for your customers. 1. Pivot ‘failed’ searches into a new and helpful customer journey“No results returned.” Groan. Your customers don’t want to see that message and you certainly don’t want to send it. With machine learning, your search box can auto-suggest options based on related terms or past browsing history (similar to typing something into the Google search box and seeing autofill suggestions.) This turns the interaction from a failed transaction into a “tell me more” conversation. Within a few clicks, you can reorient the customer to the item they were originally seeking. In the process, you’re also creating a customer experience that denotes helpfulness and care. 2. Reduce time-to-purchase through image searches People may be motivated to purchase even before they have all the relevant information to do a targeted search. For example, they may just want to find the gorgeous summer dress they saw on Instagram but may not know a brand name or style.With image search, customers can drill down the precise item they’re looking for without having to weed out endless incorrect search results from non-specific search terms. Instead, the customer can quickly find the brand name and style, prompting a faster opportunity to purchase.A search toolkit for the AI eraThe Elasticsearch Relevance Engine (ESRE) gives developers the tools they need to build AI-powered search apps.Build Generative AI Search Engines and Applications3. Help customers make an informed decisionEvery search can be an opportunity to upsell or cross-sell in a way that provides additional value to the customer. Delivering search returns with additional suggestions tagged “Popular Item” or “Highly Rated” allows shoppers to evaluate different items to make an informed purchase based on their priorities. Maybe they want the lowest-priced item. Maybe they want the item with the most added features. Perhaps there are options they weren’t aware of. Additional results tagged “Frequently bought with this item” goes a step further to allow a shopper to fulfill their entire purpose rather than just making a simple purchase. For example, if they’re going to buy an area rug, they might appreciate a suggestion to purchase carpet tape. 4. Create transparency around product availabilityShould customers buy now or wait? Can they get everything they need in one transaction",
  "wordCount": 1048,
  "hash": "19844ea47f8c94b4",
  "topic": "AI_and_Strategy"
}