{
  "url": "https://www.shopify.com/news/ai-commerce-at-scale",
  "title": "Shopify connects any merchant to every AI conversation",
  "snippet": "# The agentic commerce platform: Shopify connects any merchant to every AI conversation. Native shopping on Google surfaces is rolling out soon, which means Shopify merchants can sell directly in AI Mode in Google Search and the Gemini app. The Shopify Catalog is now open to every brand through our ",
  "domain": "shopify.com",
  "publishedDateInvalid": true,
  "extractedText": "[Skip to Content](#main)\n\n[Product](/news/category/product-news)\n\n# The agentic commerce platform: Shopify connects any merchant to every AI conversation\n\nJanuary 11, 2026\n\nby Shopify\n\nShare this story:\n\n* [Twitter](https://twitter.com/intent/tweet?text=The+agentic+commerce+platform:+Shopify+connects+any+merchant+to+every+AI+conversation&url=https%3A%2F%2Fwww.shopify.com%2Fnews%2Fai-commerce-at-scale&via=Shopify)\n* [Facebook](https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.shopify.com%2Fnews%2Fai-commerce-at-scale)\n* [Email](mailto:?subject=The+agentic+commerce+platform:+Shopify+connects+any+merchant+to+every+AI+conversation&body=The+agentic+commerce+platform:+Shopify+connects+any+merchant+to+every+AI+conversation%0Ahttps%3A%2F%2Fwww.shopify.com%2Fnews%2Fai-commerce-at-scale%0A%0AShopify now enables native commerce at scale across all major AI channels and built an open standard, co-developed with Google.)\n\nby Shopify\n\nShopify now enables native commerce at scale across all major AI channels and built an open standard, co-developed with Google.\n\nAI is the next great platform shift in commerce. Every day, millions of people turn to AI chats to discover, browse and buy. Agentic commerce is the future and in 2025 we set a [vision](https://x.com/tobi/status/1952800271257706676) to build its foundation. Today we’re accelerating that vision.\n\nWe're announcing the [Universal Commerce Protocol](http://shopify.com/ucp) (UCP), a new open standard co-developed with Google to bring commerce to agents at scale. Native shopping on Google surfaces is rolling out soon, which means Shopify merchants can sell directly in AI Mode in Google Search and the Gemini app. We are also releasing an update to our Microsoft Copilot integration with a new embedded checkout experience. These new integrations, in addition to ChatGPT, are managed centrally from the Shopify Admin through [Agentic Storefronts](https://www.shopify.com/news/winter-26-edition-agentic-storefronts).\n\nThe Shopify Catalog is now open to every brand through our new [Agentic plan](https://www.shopify.com/agentic-plan), expanding the commerce backbone that connects millions of merchants to buyers worldwide. This means brands on any platform can now use Shopify’s infrastructure to sell on AI channels without needing to have a Shopify online store.\n\nShopify has unmatched insight into how commerce varies and we’re investing in standards and tools that enable it to happen everywhere people spend their time.\n\n### A protocol to cover all commerce\n\nThe [Universal Commerce Protocol](https://shopify.engineering/ucp) (UCP)—co-developed by Shopify and Google, and already endorsed by 20+ retailers and platforms—is an open standard for AI agents to connect and transact with any merchant. It's designed to make integrations fast and flexible to account for every retailer's requirements.\n\n“Shopify has a history of building checkouts for millions of unique retail businesses. We have taken everything we’ve seen over the decades to make UCP a robust commerce standard that can scale,” says Vanessa Lee, VP Shopify. “Agentic commerce has so much potential to redefine shopping and we want to make sure it can scale to every product a customer might want to purchase.”\n\nWith UCP, agents can represent critical checkout flows for a smooth transaction in any AI platform. That means customers will be able to: submit discount codes, input loyalty credentials, select preferred subscription billing cadences, or confirm selling terms like final sale or pre-order timing in chat. The protocol also works with any payment processor, including Shopify Payments.\n\nWhether building fully conversational purchasing experiences, embedded checkouts in apps, or web-based commerce flows, agentic partners using UCP get the flexibility to support any shopping experience. In fact, it’s designed for all types of transactions, not just for retail commerce but also for other verticals in the future.\n\nWith UCP, agents can natively complete checkout on a customer’s behalf with a flexible architecture that adapts to any commerce stack using REST, Model Context Protocol (MCP), Agent Payments Protocol (AP2), or Agent2Agent (A2A) protocols. In the instances where a customer's interaction is required—take a furniture retailer that requires a customer to select a specific delivery date and time—UCP gives a standard way for that furniture retailer to specify to agents what information is needed from customers in the checkout flow.\n\n“The shift to agentic commerce will require a shared language across the ecosystem—and the Universal Commerce Protocol provides that framework,” says Ashish Gupta, VP/GM of Merchant Shopping at Google. “Through our collaboration with partners like Shopify we’re ensuring the protocol is interoperable and ready to meet the evolving demands of retailers and their customers. We’re excited to work together and bring this to life soon starting with a new checkout feature in AI Mode in Google S",
  "wordCount": 1316,
  "hash": "20344bd78b03751d",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:24:09.503Z",
  "sourceType": "platform"
}