{
  "url": "https://www.mckinsey.com/capabilities/strategy-and-corporate-finance/our-insights/the-learning-organization-how-to-accelerate-ai-adoption",
  "title": "The learning organization: How to accelerate AI adoption",
  "snippet": "# The learning organization: How to accelerate AI adoption. Instead of offering bonuses for implementing AI, successful organizations reward employees for demonstrating new competencies, sharing insights with colleagues, and helping others navigate the learning curve. * *Start with clear hypotheses.",
  "domain": "mckinsey.com",
  "publishedDateInvalid": true,
  "extractedText": "How organizations can overcome gen AI adoption challenges | McKinsey\n\n[Skip to main content](#skipToMain)\n\n# The learning organization: How to accelerate AI adoption\n\n| Article\n\nBy [Bob Sternfels](/our-people/bob-sternfels) and [Yuval Atsmon](/our-people/yuval-atsmon)\n\n[Print](#/print)\n\n[Save](#/save)\n\nThe rapid rise of gen AI highlights a workplace reality: Front lines often embrace new tech much faster than managers do. Here’s how to overcome organizational blocks to transformative ideas.\n\n### DOWNLOADS\n\n[Article (6 pages)](#/download/%2F~%2Fmedia%2Fmckinsey%2Fbusiness%20functions%2Fstrategy%20and%20corporate%20finance%2Four%20insights%2Fthe%20learning%20organization%20how%20to%20accelerate%20ai%20adoption%2Fthe-learning-organization-how-to-accelerate-ai-adoption_final2.pdf%3FshouldIndex%3Dfalse)\n\n> The future is already here—it’s just not evenly distributed.\n>\n> William Gibson (*Cyberpunk* documentary, 1990)\n\nThe dizzying speed at which AI technology is evolving makes it nearly impossible to keep up with the many new ways that it could transform how people work. Yet for most organizations, the gap between what’s possible and what’s implemented is steadily widening. A [2024 McKinsey Global Survey](/capabilities/people-and-organizational-performance/our-insights/gen-ais-next-inflection-point-from-employee-experimentation-to-organizational-transformation) found that nine in ten employees used gen AI for their work, and 21 percent of them were heavy users.1Charlotte Relyea, Dana Maor, Sandra Durth, and Jan Bouly, “[Gen AI’s next inflection point: From employee experimentation to organizational transformation](/capabilities/people-and-organizational-performance/our-insights/gen-ais-next-inflection-point-from-employee-experimentation-to-organizational-transformation),” McKinsey, August 7, 2024. But while employee enthusiasm was high, the formal adoption of AI tools across most organizations lagged behind: Only 13 percent of surveyed employees considered their organization to be an early adopter.\n\nThe slow institutional embrace of new tools isn’t a new phenomenon. It happened when digital natives collaborated using cloud-based platforms and connected with customers via social media years before their employers officially approved these technologies. More recently, mobile natives started conducting business through messaging apps and mobile-first workflows while corporate IT departments were still debating smartphone security policies. Now the world is witnessing the emergence of AI natives—typically, younger employees—who are already using gen AI tools to draft emails, write code, and analyze data, while decision-makers and budget holders worry about governance and up-front technology costs.\n\nThe differences this time are the speed and scale of change. The time between gen AI capabilities being a competitive advantage and becoming a competitive necessity is dramatically shorter than it was in earlier technological transitions. Organizations that master the art of fast adoption will determine the new rules of their industries.\n\n> The time between gen AI capabilities being a competitive advantage and becoming a competitive necessity is dramatically shorter than it was in earlier technological transitions.\n\nBut how do leaders accelerate learning across an entire organization without sacrificing quality or creating chaos? How do they ensure that the enterprise gets the most value out of dispersed pockets of innovation? We discuss four mindsets and practices that can help.\n\n## Nurture what’s already growing\n\nIn the book *The Gardener and the Carpenter: What the New Science of Child Development Tells Us About the Relationship Between Parents and Children* (Farrar, Straus and Giroux/Macmillan Publishers, 2016), developmental psychologist Alison Gopnik argues that parents should allow children to develop according to their natural tendencies rather than predetermined constructs. This concept, which she calls a “gardener’s mindset,” is as relevant to organizational leaders as to parents: Nurture the growth that you see. The most successful managers focus on identifying the sprouts—employees, teams, or departments that are experimenting with new technologies and showing promising early results. They ask, “Where is innovation already happening? Who is solving problems in surprisingly effective ways?”\n\nMost organizations, however, favor the “carpenter’s mindset”: meticulously planning every detail of technological transformation from the top down. This approach can’t keep pace with the current rate of change. Leaders who try to specify precisely how AI should be implemented across their organizations often find themselves building yesterday’s solutions for tomorrow’s problems.\n\n> Leaders who try to specify precisely how AI should be implemented across their organizations often find themselves building yesterday’s solutions for tomorrow’s problems.\n\nConsider the experience of an Asian financial-services company that found i",
  "wordCount": 1952,
  "hash": "25d891d96be05e10",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:23:59.053Z",
  "sourceType": "consultancy"
}