{
  "url": "https://nextword.substack.com/",
  "title": "Enterprise AI Trends | John Hwang | Substack",
  "snippet": "![Image 1](https://substackcdn.com/image/fetch/$s_!QeJd!,w_176,h_176,c_fill,f_auto,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc53a207e-83a9-413a-9e81-6c45654c303f_1024x1024.png). [![Image 2: Enterprise AI Trends](https://substackcdn",
  "domain": "nextword.substack.com",
  "publishedDate": "2026-01-16T18:28:37.383Z",
  "extractedText": "Enterprise AI TrendsSubscribeSign inHomePodcastNotesArchiveLeaderboardAboutThe Great Software Repricing: A FrameworkA framework for thinking about the SaaS business model transition19 hrs ago • John Hwang3LatestTopDiscussionsClaude Cowork nukes every startup playbookVibe coding allows slow incumbents to compete with startupsJan 13 • John Hwang91Do software moats still exist? (ft. Claude Code)Software moats need to evolve in the era of agentic codingJan 10 • John Hwang9The Last Mover Advantage in AIIn praise of procrastination (?)Jan 6 • John Hwang133Claude Code Is MS-DOS. Who Builds Windows?The right way to think about Claude Code, and what'd the next evolution of Claude Code will look like.Jan 4 • John Hwang112Meta Buys Manus: Shifting Currents at MetaWhat this deal does for Zuck, Wang, and MetaDec 30, 2025 • John Hwang82333 predictions for 2026 in AI: consumer, enterprise, AI capex, and moreThoughts on what's the bankable trends are in AIDec 27, 2025 • John Hwang811OpenAI's masterplan for ChatGPT, and Concierge Internet Apps SDK is about absorbing context, not providing an app directoryDec 24, 2025 • John Hwang156See allEnterprise AI Trends\"Enterprise AI Trends\" is a publication about mainly three topics: 1) enterprise AI product and industry trends, 2) the challenges of AI adoption in enterprises and among consumers, and 3) the lessons learned selling AI in the field. SubscribeRecommendationsThe NextWord Blogby John HwangEnterprise AI TrendsSubscribeAboutArchiveSitemap© 2026 John Hwang · Privacy ∙ Terms ∙ Collection notice Start your SubstackGet the appSubstack is the home for great culture",
  "wordCount": 235,
  "author": "John Hwang",
  "hash": "270d8754b35e4d95",
  "topic": "AI_and_Strategy"
}