{
  "url": "https://www.ksl.com/article/51431542/google-teams-up-with-walmart-and-other-retailers-to-enable-shopping-within-gemini-ai-chatbot",
  "title": "Google teams up with Walmart and other retailers to enable shopping within Gemini AI chatbot | KSL.comKSL homepageKSL homepageMessages (0)account - logged outSupport",
  "snippet": "Google, OpenAI and Amazon all are racing to create tools that would allow for seamless AI-powered shopping by taking chatbot users from browsing",
  "domain": "ksl.com",
  "extractedText": "NEW YORK — Google said Sunday that it is expanding the shopping features in its AI chatbot by teaming up with Walmart, Shopify, Wayfair and other big retailers to turn the Gemini app into a virtual merchant as well as an assistant.An instant checkout function will allow customers to make purchases from some businesses and through a range of payment providers without leaving the Gemini chat they used to find products, according to Walmart and Google.The news was announced on the first day of the National Retail Federation's annual convention in New York. The role of artificial intelligence in e-commerce and its impact on consumer behavior are expected to dominate the three-day event.\"The transition from traditional web or app search to agent-led commerce represents the next great evolution in retail,\" John Furner, Walmart's incoming president and CEO, said in a joint statement with Google and Alphabet CEO Sundar Pichaei.Google's new AI shopping feature works this way: if a customer asks what gear to get for a winter ski trip, for example, Gemini will return items from a participating retailers' inventory.In the case of Walmart, customers who link their Walmart and Gemini accounts will receive recommendations based on their past purchases, and any products they decide to buy via the chatbot could get combined with their existing Walmart or Sam's Club online shopping carts, according to the statement.OpenAI and Walmart announced a similar deal in October, saying the partnership would allow ChatGPT members to use an instant checkout feature to shop for nearly everything available on Walmart's website except for fresh food.Google, OpenAI and Amazon all are racing to create tools that would allow for seamless AI-powered shopping by taking chatbot users from browsing to buying within the same program instead of having to go to a retailer's website to complete a purchase. The race between OpenAI and Google has heated up in recent months.Before the recent holiday shopping season, OpenAI launched an instant checkout feature within ChatGPT that allows users to buy products from select retailers and Etsy sellers without leaving the app.San Francisco software company Salesforce estimated that AI influenced $272 billion, or 20%, of all global retail sales, in one way or another during the holiday shopping season.Google said the AI-assisted shopping features in Gemini only would be available to U.S. users initially but that it planned to expand internationally in the coming months.×Most recent Business storiesFed's Powell says administration threatened him with criminal indictment over Senate testimonyHoliday spending set records despite consumer pessimismConcerns rise over possible damage to graves during Salt Lake City Cemetery roadworkRelated topicsArtificial IntelligenceBusinessU.S.ScienceAnne D'innocenzioMore stories you may be interested in Concerns rise over possible damage to graves during Salt Lake City Cemetery roadwork Here's what was announced at CES 2026 US says it needs to control Venezuelan oil sales indefinitely to drive change",
  "wordCount": 470,
  "author": "\n                                                                                    By Anne D'innocenzio, Associated Press |\n                                                                                                                            Updated - Jan. 11, 2026 at 2:00 p.m.\n                                            | Posted - Jan. 11, 2026 at 10:10 a.m.\n                                                                            ",
  "hash": "2879236ec96bc33a"
}