{
  "url": "https://blog.google/innovation-and-ai/infrastructure-and-cloud/google-cloud/finding-any-cartier-watch-under-3-seconds/",
  "title": "Finding any Cartier watch in under 3 seconds",
  "snippet": "Working together with Cartier's team, we helped them build a visual product search system using Google Cloud AI Platform services, including",
  "domain": "blog.google",
  "publishedDate": "2021-05-21",
  "extractedText": "Breadcrumb Innovation & AI Infrastructure & Cloud Google Cloud Finding any Cartier watch in under 3 seconds May 21, 2021 · Share x.com Facebook LinkedIn Mail Copy link Alex Erfurt Machine Learning Product Specialist, Google Anant Nawalgaria Senior Machine Learning Specialist Engineer, Google Share x.com Facebook LinkedIn Mail Copy link Cartier is legendary in the world of luxury — a name that is synonymous with iconic jewelry and watches, timeless design, savoir-faire and exceptional customer service. Maison Cartier’s collection dates back to the opening of Louis-François Cartier’s very first Paris workshop in 1847. And with over 174 years of history, the Maison’s catalog is extensive, with over a thousand wristwatches, some with only slight variations between them. Finding specific models, or comparing several models at once, could take some time for a sales associate working at one of Cartier’s 265 boutiques — hardly ideal for a brand with a reputation for high-end client service. In 2020, Cartier turned to Google Cloud to address this challenge. An impressive collection needs an app to match Cartier’s goal was to develop an app to help sales associates find any watch in its immense catalog quickly. The app would use an image to find detailed information about any watch the Maison had ever designed (starting with the past decade) and suggest similar-looking watches with possibly different characteristics, such as price. But creating this app presented some unique challenges for the Cartier team. Visual product search uses artificial intelligence (AI) technology like machine learning algorithms to identify an item (like a Cartier wristwatch) in a picture and return related products. But visual search technology needs to be “trained” with a huge amount of data to recognize a product correctly — in this case, images of the thousands of watches in Cartier’s collections. As a Maison that has always been driven by its exclusive design, Cartier had very few in-store product images available. The photos that did exist weren’t consistent, varying in backgrounds, lighting, quality and styling. This made it very challenging to create an app that could categorize images correctly. On top of that, Cartier has very high standards for its client service. For the stores to successfully adopt the app, the visual product search app would need to identify products accurately 90% of the time and ideally return results within five seconds. Redefining Cartier’s luxury customer experience with AI technologyWorking together with Cartier’s team, we helped them build a visual product search system using Google Cloud AI Platform services, including AutoML Vision and Vision API.The system can recognize a watch’s colors and materials and then use this information to figure out which collection the watch is from. It analyzes an image and comes back with a list of the three watches that look most similar, which sales associates can click on to get more information. The visual product search system identifies watches with 96.5% accuracy and can return results within three seconds.Now, when customers are interested in a specific Cartier watch, the boutique team can take a picture of the desired model (or use any existing photo of it) and use the app to find its equivalent product page online. The app can also locate products that look similar in the catalog, displaying each item with its own image and a detailed description that customers can explore if the boutique team clicks on it. Sales associates can also send feedback about how relevant the recommendations were so that the Cartier team can continually improve the app. For a deeper understanding of the Cloud and AI technology powering this app, check out this blog post. High-quality design and service never go out of styleToday, the visual product search app is used across all of the Maison’s global boutiques, helping sales associates find information about any of Cartier’s creations across its catalog. Instead of several minutes, associates can now answer customer questions in seconds. And over time, the Maison hopes to add other helpful features to the app. The success of this project shows it’s possible to embrace new technology and bring innovation while preserving the quality and services that have established Cartier as a force among luxury brands. With AI technology, the future is looking very bright. POSTED IN: Google Cloud AI Products",
  "wordCount": 708,
  "hash": "2a21f8fac43c3a40"
}