{
  "url": "https://hbr.org/2024/03/how-machine-learning-will-transform-supply-chain-management",
  "title": "How Machine Learning Will Transform Supply Chain ManagementHarvard Business Review LogoHarvard Business Review LogoHarvard Business Review LogoHarvard Business Review Logo",
  "snippet": "Supply chain management|How Machine Learning Will Transform Supply Chain Management. # How Machine Learning Will Transform Supply Chain Management. It does a better job of using data and forecasts to make decisions. The Covid-19 pandemic, the Russia-Ukraine conflict, trade wars, and other events in ",
  "domain": "hbr.org",
  "publishedDate": "2024-03-01T05:00:00.000+00:00",
  "extractedText": "Harvard Business Review LogoSupply chain managementHow Machine Learning Will Transform Supply Chain ManagementIt does a better job of using data and forecasts to make decisions. by Narendra Agrawal, Morris A. Cohen, Rohan Deshpande and Vinayak DeshpandeFrom the Magazine (March–April 2024)Didier EngelsSummary. Leer en españolLer em portuguêsPostPostShareSaveBuy CopiesPrintThe Covid-19 pandemic, the Russia-Ukraine conflict, trade wars, and other events in recent years have disrupted supply chains and highlighted the critical need for businesses to improve planning in order to be more agile and resilient. Yet companies struggle with this challenge. One major cause is flawed forecasting, which results in delivery delays, inventory levels that are woefully out of sync with demand, and disappointing financial performance. Those consequences are hardly surprising. After all, how can inventory and production decisions be made effectively when demand forecasts are widely off?Read more on Supply chain management or related topics AI and machine learning, Data management, Performance indicators, Agile project management and Decision making and problem solvingA version of this article appeared in the March–April 2024 issue of Harvard Business Review.Narendra Agrawal is the Benjamin and Mae Swig Professor of Information Systems and Analytics at Santa Clara University’s Leavey School of Business.Morris A. Cohen is the Panasonic Professor Emeritus of Manufacturing & Logistics at the University of Pennsylvania’s Wharton School. He is also the founder of AD3 Analytics, a start-up that developed the OML methodology for supply chain management.Rohan Deshpande is a machine learning scientist at Cerebras Systems and a former chief technology officer at AD3 Analytics.Vinayak Deshpande is the Mann Family Distinguished Professor of Operations at the University of North Carolina’s Kenan-Flagler Business School.PostPostShareSaveBuy CopiesPrintRead more on Supply chain management or related topics AI and machine learning, Data management, Performance indicators, Agile project management and Decision making and problem solving",
  "wordCount": 294,
  "hash": "3b0d2d5e66cf7527",
  "topic": "AI_and_Strategy"
}