{
  "url": "https://www.retaildive.com/news/google-delivers-new-ai-shopping-tools-in-time-for-the-holidays/805683/",
  "title": "Google delivers new AI shopping tools in time for the holidays | Retail Dive",
  "snippet": "The features include price tracking and the ability for AI to call stores to ask if products are in-stock.",
  "domain": "retaildive.com",
  "extractedText": "An article from Dive Brief Google delivers new AI shopping tools in time for the holidays The features include price tracking and the ability for AI to call stores to ask if products are in-stock. Published Nov. 20, 2025 By Tatiana Walk-Morris Share Copy link Email LinkedIn X/Twitter Facebook Print License Add us on Google Google updated its AI Mode to allow users describe their desired items and receive product recommendations with shoppable product images, pricing and reviews. Courtesy of Google Dive Brief: Google is introducing a batch of AI-driven shopping features in time for the holiday season, the company announced last week. U.S. Gemini app users can now enter search queries to receive shoppable product recommendations, pricing and comparison tables. Google has also updated its AI Mode to let search users describe their desired items and receive product recommendations with shoppable product images, pricing, reviews and other information, the company said in its announcement. Its “Let Google Call” feature calls local stores to verify product availability on a shoppers’ behalf, check prices and inquire about retailers’ promotions. Dive Insight: With Google’s suite of new features, the tech behemoth is delivering on its promise to turn AI into a personal shopping assistant. In May, the company shared its “AI Mode” plans, which allows shoppers to use their photos to virtually try-on items, find the best prices and curate recommendations. Shoppers can use a “track price” button to set up price drop notifications for an item based on their desired size and color, among other options. Google has begun rolling out its agentic AI checkout capabilities for U.S. merchants, the company said in its announcement. Wayfair, Chewy, Quince, and select Shopify merchants are among the first retailers to authorize use of the new tool, but more businesses will soon offer the option. Using Google’s new AI Mode, shoppers can receive a range of intuitive product recommendations based on their conversational search queries rather than precise keywords, the company said. The tool draws on more than 50 billion product listings, with roughly 2 billion updated hourly. Beyond expanding its agentic AI capabilities, Google has integrated AI along consumer shopping journeys. In March, the company announced another set of AI-powered shopping tools. While users can try on pants and skirts with the updated virtual try-on tool, its vision match tool enables mobile users to create AI-generated images of how items may look and receive links to related products. As Google rolls out more AI-powered shopping features, other tech companies and retailers are developing technologies to enable agentic AI purchases. OpenAI recently launched its Instant Checkout feature in ChatGPT, which lets users buy items directly within the platform for U.S. sellers including Etsy and some Shopify merchants. Walmart announced a partnership in October with OpenAI where shoppers can soon make purchases within ChatGPT, as well. As tech titans bridge the process of finding and purchasing new products with AI, the flood of AI tools has begun to reshape the shopping experience for consumers. Nearly two-thirds of consumers have used general-purpose AI technology to guide their online shopping, according to a Bloomreach survey released in March. More than half said their searches had become more conversational. purchase licensing rights Filed Under: Marketing, Technology",
  "wordCount": 538,
  "author": "\n        \n        \n            By\n            Tatiana Walk-Morris\n        \n        \n    ",
  "hash": "3b1bff313a172090"
}