{
  "url": "https://www.nasdaq.com/articles/honeywell-unveils-ai-powered-smart-shopping-platform-google-cloud",
  "title": "Honeywell Unveils AI-Powered Smart Shopping Platform With Google Cloud  | Nasdaq",
  "snippet": "(RTTNews) - Honeywell announced the launch of an AI-enabled retail solution developed in collaboration with Google Cloud and 66degrees.",
  "domain": "nasdaq.com",
  "extractedText": "AAPL TSLA AMZN META AMD NVDA PEP COST ADBE GOOG AMGN HON INTC INTU NFLX ADP SBUX MRNA AAPL TSLA AMZN META AMD NVDA PEP COST ADBE GOOG AMGN HON INTC INTU NFLX ADP SBUX MRNA AAPL TSLA AMZN META AMD NVDA PEP COST ADBE GOOG AMGN HON INTC INTU NFLX ADP SBUX MRNA Markets GOOG Honeywell Unveils AI-Powered Smart Shopping Platform With Google Cloud January 11, 2026 — 12:03 pm EST Written by RTTNews.com for RTTNews-> (RTTNews) - Honeywell announced the launch of an AI-enabled retail solution developed in collaboration with Google Cloud and 66degrees. Leveraging Google's Gemini and Vertex AI platforms, the new Smart Shopping Platform is designed to enhance the in-store shopping experience for retailers worldwide. It helps customers locate products, compare items, and find suitable substitutions when products are unavailable, making shopping more efficient and enjoyable. The Smart Shopping Platform is a cloud-based solution that bridges a retailer's digital data with the physical store environment. Built on Honeywell's Mobility Edge™ hardware and software platform and powered by Google Cloud's AI technologies, it provides personalized guidance, real-time product information, and dynamic recommendations that replicate the convenience of online shopping. When accessed through Honeywell for Android devices such as the CS32 Personal Shopper, customers can link their loyalty accounts to receive tailored recommendations. These suggestions are based on purchase history, preferences, complementary products, and available discounts. The platform also offers step-by-step navigation within stores, guiding shoppers directly to the items they need and suggesting alternatives if products are out of stock. The solution also enhances the role of retail workers by equipping them with tools to deliver expert assistance. Associates using devices like the Honeywell CT70 can provide quick, customized guidance, helping customers with product locations and recommendations. Already in use across major grocery chains, big box stores, specialty retailers, and department stores, these devices enable employees to act as knowledgeable in-store experts. The Smart Shopping Platform will be available to customers beginning in February 2026. The views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc. Tags Markets RTTNews Founded in the late 1990s by Andrew Mariathasan in New York, with the goal of covering Wall Street for a new generation of investors, RTTNews has expanded steadily over the years to become a trusted provider of content for a wide array of subjects across several platforms. RTT's Financial Newswire is relied upon by some of the world's largest financial institutions, including banks, brokerages, trading platforms and financial exchanges. More articles by this source-> Stocks mentioned GOOG GOOGL HON More Related Articles This data feed is not available at this time. Data is currently not available • Sign up for the TradeTalks newsletter to receive your weekly dose of trading news, trends and education. Delivered Wednesdays.",
  "wordCount": 470,
  "hash": "44b642f0d814febc"
}