{
  "url": "https://sloanreview.mit.edu/article/why-ai-will-not-provide-sustainable-competitive-advantage/",
  "title": "Why AI Will Not Provide Sustainable Competitive Advantage",
  "snippet": "Magazine Summer 2025 Issue Frontiers. # Why AI Will Not Provide Sustainable Competitive Advantage. ## AI will transform economies and lift markets as a whole, but lasting differentiation will be built on human creativity and passion. #### Frontiers. Listen to “Why AI Will Not Provide Sustainable Com",
  "domain": "sloanreview.mit.edu",
  "publishedDate": "2025-05-08T07:00:06-04:00",
  "extractedText": "Magazine Summer 2025 Issue Frontiers Why AI Will Not Provide Sustainable Competitive Advantage AI will transform economies and lift markets as a whole, but lasting differentiation will be built on human creativity and passion. David Wingate, Barclay L. Burns, and Jay B. Barney May 08, 2025 Reading Time: 9 min Topics Data, AI, & Machine Learning Strategy AI & Machine Learning Technology Innovation Strategy Frontiers An MIT SMR initiative exploring how technology is reshaping the practice of management. More in this series Subscribe Get Copies Download PDF Share Twitter Facebook Linkedin Boris Séméniako/Ikon Images Summary: Artificial intelligence does not change anything about the fundamental nature of sustained competitive advantage when its use is pervasive. Once AI’s use is ubiquitous, it will transform economies and lift markets as a whole, but it will not uniquely benefit any single company. Businesses seeking to gain an innovation edge over rivals will need to focus their efforts on cultivating creativity among their employees. Listen to “Why AI Will Not Provide Sustainable Competitive Advantage” (13:24) There is no question that artificial intelligence will transform the competitive business landscape. AI will streamline business processes, increase worker productivity, redefine premium skill sets, and unlock the potential of data. There is also no question that AI will make relentless progress and become more capable at a dizzying pace. But AI will also become more ubiquitous. Algorithms and training data are being commoditized; hardware competition is fierce; talent is plentiful; open-source models reliably erode corporate offerings. AI will become increasingly economical to deploy, and competition will demand that companies do so. While it is impossible to predict exactly how AI will transform our economy, one thing is clear: Every company will want it, and there is essentially no reason why they will not be able to get it. It is tempting for a company to believe that it will somehow benefit from AI while others will not, but history teaches a different lesson: Every serious technical advance ultimately becomes equally accessible to every company. Personal computers, the internet, semiconductor fabs, blockchain technology, genetic sequencing — these technologies are no longer competitive advantages for any organization. AI is similar, and its increasing ubiquity should cause us to rethink our assumptions about how it will — and will not — change competitive dynamics. It is easy to paint a picture of a glistening, AI-driven future and the untold riches it harbors, ripe for the taking; it is just as easy to believe that companies that invest heavily in AI technology or move first will reap the lion’s share of potential profits. But all such narratives obscure a critical point: While there will doubtless be transitory competitive advantages in embracing AI, AI does not change the fundamentals of what makes for a sustainable competitive advantage. How can AI be the centerpiece of a sustained competitive advantage when everyone has it? We argue that it simply cannot. The value that AI unlocks will be unlocked for all. The advantages AI confers will be conferred on all. By definition, if everyone has access to the same technology — even if it is new and valuable — it may move the market as a whole but will not uniquely advantage anyone. Far from being a source of differentiation, artificial intelligence will be a source of homogenization. Topics Data, AI, & Machine Learning Strategy AI & Machine Learning Technology Innovation Strategy Frontiers An MIT SMR initiative exploring how technology is reshaping the practice of management. More in this series About the Authors David Wingate is an associate professor of machine learning and AI in the Department of Computer Science at Brigham Young University. Barclay L. Burns is assistant dean for applied AI in the Smith School of Engineering and Technology at Utah Valley University and a fellow at the University of Cambridge Judge Business School. Jay B. Barney is a presidential professor of strategic management and the Pierre Lassonde Chair of Social Entrepreneurship in the Eccles School of Business at the University of Utah. Tags: Artificial Intelligence Competitive Advantage Corporate Strategy Human Capital Narrated Article Technology Platforms Reprint #: 66412 More Like This Add a comment Cancel replyYou must sign in to post a comment.First time here? Sign up for a free account: Comment on articles and get access to many more articles. Comments (2) Daniel Forrester May 31, 2025 AI Is No Moat: \"Humans as the Loop\" Is the Game Bravo to the leaders who wrote this article. So well written and clear. And grounded in history. This is the anti hype article. As I read it, I thought of the moment in June 2023 when, OpenAI’s Sam Altman was asked whether a small team with $10 million could build a large language model to compete with his company. His response was simult",
  "wordCount": 1373,
  "author": "Massachusetts Institute of Technology",
  "hash": "4d19f59cd5c54a5d",
  "topic": "AI_and_Strategy"
}