{
  "url": "https://corporate.visa.com/en/sites/visa-perspectives/trends-insights/2025-spending-shift-report.html.html",
  "title": "AI and digital wallets reshape spending habits | Visa",
  "snippet": "From AI that powers smarter gift giving and prevents fraud to stablecoins gaining traction across emerging markets, Visa’s latest research shows a worldwide move toward more intelligent, secure and seamless holiday payments. Across all markets, AI, digital currencies and digital wallets are becoming",
  "domain": "corporate.visa.com",
  "publishedDateInvalid": true,
  "extractedText": "Trends and insights\n\n# AI and digital currencies drive consumer spending trends\n\nA new report from Visa and Morning Consult unwraps how global consumers are changing their spending this holiday season\n\n## Smarter, faster, more digital: The global shift in holiday spending\n\nFrom AI that powers smarter gift giving and prevents fraud to stablecoins gaining traction across emerging markets, Visa’s latest research shows a worldwide move toward more intelligent, secure and seamless holiday payments.\n\nImagine this holiday future: AI curates the perfect gift at the perfect price for you; facial recognition verifies your purchase in a blink, and unwrapping crypto under the tree? Totally normal. That future isn’t far off as consumers around the world warm up to these new technologies, according to new research conducted by Morning Consult on behalf of Visa.\n\n## A new global spending landscape\n\nAs consumers worldwide prepare for the 2025 holiday season, a new global study shows just how dramatically shopping behaviors are evolving across markets. The findings, drawn from 12 countries, present a clear shift: Consumers around the world are embracing new technologies.\n\nAcross all markets, AI, digital currencies and digital wallets are becoming entrenched in global holiday spending behavior. While convenience and security remain baseline expectations for payments, fraud concerns are still top of mind, heightening the need for continued education and a secure, trustworthy infrastructure. And Gen Z’s preferences are becoming the blueprint for the future of commerce.\n\n## AI shopping goes mainstream\n\nAcross markets, AI is becoming a trusted holiday companion, especially among deal-driven consumers:\n\n* Spain, Singapore, South Africa, the UAE, Brazil and Mexico show the highest rate of AI openness.\n* In the U.S., nearly half of consumers (47 percent) have already used AI for at least one shopping-related task, with gift discovery, price comparison and product research emerging as top holiday use cases across North America. This data signals the beginning of an [agentic AI](/en/products/intelligent-commerce.html) era where shoppers rely on intelligent tools not just to browse, but to make decisions too.\n\n## Crypto and stablecoins step into the holiday spotlight\n\nAcross markets, digital currencies are shifting from niche to normal, especially for younger generations.\n\n* Nearly half (45 percent) of Gen Z in the U.S. would be excited to receive cryptocurrency, nearly double the rate of all Americans, at 28 percent.\n* Stablecoins are gaining traction too: 41 percent of U.S. remittance users say they’re likely to use stablecoins for international money transfers in the future.\n\nGlobally, this openness to digital currencies is far from uniform. Brazil (65 percent), Mexico (62 percent), South Africa (57 percent) and the UAE (66 percent) remittance users show the strongest willingness to adopt stablecoins in the future. UK consumers are warming to stablecoins (36 percent), while Germany remains cautious (23 percent).\n\n## More shoppers are reaching for digital wallets this holiday\n\nDigital wallets are gaining global dominance, especially among younger generations. In the U.S., one in five shoppers already prefer digital wallets, and Gen Z is driving the shift. They are just as likely to use a digital wallet as a physical card (36 percent vs. 34 percent).\n\nWorldwide, digital wallet adoption patterns reveal striking contrasts across regions:\n\n* Singapore and the UAE lead the world, where digital wallets outperform cards and cash on trust, security, speed and convenience.\n* Brazil shows a strong preference for digital wallets, driven by acceptance, speed and perceived fraud protection.\n* Germany remains a cash stronghold, a sharp departure from the UK, which leads other EU markets in digital wallet experience.\n\nEven in markets where cash remains culturally important, consumers expect future decline. Across Europe, many anticipate that cash usage will fall over the next decade, underscoring a broader, steady movement toward digital payments.\n\n## Security and trust shape holiday shopping decisions\n\nSecurity is the single biggest factor influencing payment choice globally, with 79 percent of respondents saying it is extremely important. Consumers want frictionless payments yet they fear that fraud schemes are becoming too sophisticated. U.S. consumers are particularly concerned this season:\n\n* 66 percent worry that friends or family may fall for an online scam\n* 82 percent have taken proactive steps to protect themselves through two-factor authentication, frequent password changes and other measures\n\nFraud exposure differs widely by country. Surveyed countries in CEMEA and Latin America report the highest levels of online payment scams, while surveyed countries in Europe show the lowest.\n\n## Gen Z is redefining how the world shops\n\nIf there is one generational force emerging from the study, it’s Gen Z. Gen Z’s near-parity preference between di",
  "wordCount": 996,
  "hash": "55f688e3ad676eb7",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:23:32.675Z",
  "sourceType": "platform"
}