{
  "url": "https://www.mckinsey.com/capabilities/tech-and-ai/our-insights/the-gen-ai-skills-revolution-rethinking-your-talent-strategy",
  "title": "The gen AI skills revolution: A new talent strategy | McKinsey",
  "snippet": "* *Gen AI technology use.* Like software engineers, PMs will need to develop new skills to work effectively with gen AI technologies. The new skills needed to use gen AI will affect how and what people do in their jobs, raising significant questions about how roles need to adapt and what oversight l",
  "domain": "mckinsey.com",
  "publishedDateInvalid": true,
  "extractedText": "The gen AI skills revolution: A new talent strategy | McKinsey\n\n[Skip to main content](#skipToMain)\n\n[*McKinsey Quarterly*](/quarterly/overview)\n\n# The gen AI skills revolution: Rethinking your talent strategy\n\n| Article\n\n[Print](#/print)\n\n[Save](#/save)\n\nDeveloping the software talent companies need to grow means thinking in terms of skills rather than roles to navigate this period of uncertainty around talent.\n\n### DOWNLOADS\n\n[Article (8 pages)](#/download/%2F~%2Fmedia%2Fmckinsey%2Fbusiness%20functions%2Fmckinsey%20digital%2Four%20insights%2Fthe%20gen%20ai%20skills%20revolution%20rethinking%20your%20talent%20strategy%2Fthe-gen-ai-skills-revolution-rethinking-your-talent-strategy-v3.pdf%3FshouldIndex%3Dfalse)\n\n**If every company** needs to be a software company, do you have a software organization that can deliver? The answer to that question could be decisive for the future of many companies.\n\nSidebar\n\n## About the authors\n\nThis article is a collaborative effort by Alharith Hussin, [Anna Wiesinger](/our-people/anna-wiesinger), [Charlotte Relyea](/our-people/charlotte-relyea), [Martin Harrysson](/our-people/martin-harrysson), and [Suman Thareja](/our-people/suman-thareja), with Prakhar Dixit and Thao Dürschlag, representing views from McKinsey Technology and McKinsey’s Technology, Media & Telecommunications and People & Organizational Performance Practices.\n\nThe [ability to compete](/capabilities/tech-and-ai/our-insights/every-company-is-a-software-company-six-must-dos-to-succeed) depends increasingly on how well organizations can build software products and services. Already, nearly 70 percent of top economic performers, versus just half of their peers, use their own software to differentiate themselves from their competitors. One-third of those top performers directly monetize software.1“[Three new mandates for capturing a digital transformation’s full value](/capabilities/tech-and-ai/our-insights/three-new-mandates-for-capturing-a-digital-transformations-full-value),” McKinsey, June 15, 2022. Generative AI (gen AI) offers a tantalizing opportunity to increase this value opportunity by helping software talent create better code faster.\n\n[Promising experiments that use gen AI](/industries/technology-media-and-telecommunications/our-insights/how-generative-ai-could-accelerate-software-product-time-to-market) to support coding tasks show impressive productivity improvements. Gen AI has improved product manager (PM) productivity by 40 percent, while [halving the time it takes](/capabilities/tech-and-ai/our-insights/unleashing-developer-productivity-with-generative-ai) to document and code. At IBM Software, for example, developers using gen AI saw 30 to 40 percent jumps in productivity.2Shivani Shinde, “IBM Software sees 30-40% productivity gains among developers using GenAI,” *Business Standard*, July 9, 2024.\n\nSidebar\n\n## About McKinsey Technology\n\n**McKinsey Technology** works with organizations across the private, public, and social sectors to create opportunities around cloud, data transformation, tech strategy, risk and remediation, and artificial intelligence. McKinsey Technology comprises more than 2,500 people in every geography—developers, engineers, architects, strategists, and analysts—who bring together technical expertise and deep industry knowledge. We work closely with organizations to deliver the technology transformation they need today and build the capabilities to embrace what comes next.\n\nDespite its promise, gen AI has barely revealed its full potential. While some 65 percent of respondents to the recent [McKinsey Global Survey on the state of AI](/capabilities/quantumblack/our-insights/the-state-of-ai-2024) report that they are regularly using gen AI, only 13 percent are systematically using gen AI in software engineering.3“[The state of AI in early 2024: Gen AI adoption spikes and starts to generate value](/capabilities/quantumblack/our-insights/the-state-of-ai-2024),” McKinsey, May 30, 2024. Our own experience working with companies reveals that gen AI tools currently help with about 10 to 20 percent of the coding activities of a developer.\n\nSidebar\n\n## About QuantumBlack, AI by McKinsey\n\n**QuantumBlack,** McKinsey’s AI arm, helps companies transform using the power of technology, technical expertise, and industry experts. With thousands of practitioners at QuantumBlack (data engineers, data scientists, product managers, designers, and software engineers) and McKinsey (industry and domain experts), we are working to solve the world’s most important AI challenges. QuantumBlack Labs is our center of technology development and client innovation, which has been driving cutting-edge advancements and developments in AI through locations across the globe.\n\nScaling gen AI capabilities requires companies to [rewire how they work](/capabilities/tech-and-ai/our-insights/a-generative-ai-reset-rewiring-to-turn-potential-into-value-in-2024), and a critical focus of rewiring is on developing the nec",
  "wordCount": 3585,
  "hash": "68824f483e934e6b",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:23:57.928Z",
  "sourceType": "consultancy"
}