{
  "url": "https://usa.visa.com/about-visa/newsroom/press-releases.releaseId.21851.html",
  "title": "Visa Survey Finds AI and Crypto Poised to Transform U.S. Holiday ...",
  "snippet": "# Visa Survey Finds AI and Crypto Poised to Transform U.S. Holiday Spending. Half of respondents now use AI tools to shop, while Gen Z embraces digital currency as a holiday gift. (NYSE: V) today released new survey data, revealing AI’s influence in shopping and spending, a generational shift in con",
  "domain": "usa.visa.com",
  "publishedDateInvalid": true,
  "extractedText": "# Visa Survey Finds AI and Crypto Poised to Transform U.S. Holiday Spending\n\n  \n\nHalf of respondents now use AI tools to shop, while Gen Z embraces digital currency as a holiday gift\n\nSAN FRANCISCO--(BUSINESS WIRE)--Dec. 2, 2025-- Visa Inc. (NYSE: V) today released new survey data, revealing AI’s influence in shopping and spending, a generational shift in consumer spending behavior, and emerging payments trends this holiday season.\n\n\"The data tells a fascinating story about the spending shift we're witnessing: shoppers are embracing AI and digital tools at remarkable speed, with nearly half of Americans now using AI to enhance their shopping experience,\" said Bruce Cundiff, vice president, Consumer Insights at Visa. \"From AI-powered gift discovery to cryptocurrency as a legitimate gift option, we're seeing Gen Z and younger millennials lead a fundamental reimagining of commerce.\"\n\n**AI and Crypto Become Mainstream This Year**\n\nThis holiday season marks a turning point in how Americans shop and gift. Consumers are increasingly weaving technologies like AI and digital currencies into their holiday traditions.\n\n* Nearly halfof US shoppers(47 percent) surveyed have used an AI tool for at least one shopping task, with “finding gift ideas” ranking as the top AI-assisted use.\n* When it comes to agentic commerce, price comparison is the most compelling application.\n* More thanone in four shoppers (28 percent) would be excited to receive cryptocurrency as a gift. That number skyrockets to 45 percent for Gen Z.\n* Approximately one in 10 shoppers believe stablecoins will take over by 2030, while 28 percent expect an increase in usage of stablecoins by 2035.\n\n**Gen Z Leads the Charge in Digital-First Consumer Behavior**\n\nGen Z continues to outpace other generations in adopting next-generation payment and shopping methods:\n\n* Gen Z is more likely to use biometric authentication (71 percent), purchase gifts from overseas (60 percent globally), buy from social platforms (55 percent), and make purchases via cryptocurrency (44 percent) than other age groups.\n* Globally, 41 percent say they plan to travel more this holiday season than last year.\n* While one in five shoppers now prefer their digital wallets, Gen Z is closing the gap. These younger consumers are just as likely to prefer digital wallets compared to physical cards, 36 percent to 34 percent, respectively.\n\n**Shoppers Want Smarter Tech – And More Trust**\n\nAs technology becomes central to the shopping journey, consumers are calling for transparency, security, and human connection:\n\n* As shoppers integrate AI into their routines, 61 percent prefer human interaction for customer service, and 60 percent want to better understand how AI-powered shopping tools use their personal data, signaling that transparency and trust will be key to driving broader adoption.\n* 66 percent of those surveyed worry friends or family could fall victim to an online scam this season, and 39 percent have encountered one in the past year.\n\n**Holiday Cheer Arrived Early**\n\nMore than a quarter of consumers surveyed began holiday shopping before November. Visa forecasts [4.6% year-over-year growth in total U.S. holiday spending](https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fcorporate.visa.com%2Fen%2Fsites%2Fvisa-perspectives%2Ftrends-insights%2F2025-holiday-spending-outlook.html&esheet=54366213&newsitemid=20251202478691&lan=en-US&anchor=4.6%25+year-over-year+growth+in+total+U.S.+holiday+spending&index=1&md5=14357189573fda3ca4252253c28d91e6), showing Americans’ determination to celebrate the season.\n\nTo learn more about the global results of this survey, [visit Visa Perspectives](https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fcorporate.visa.com%2Fen%2Fsites%2Fvisa-perspectives%2Ftrends-insights%2F2025-spending-shift-report.html&esheet=54366213&newsitemid=20251202478691&lan=en-US&anchor=visit+Visa+Perspectives&index=2&md5=86c6cc9ab4c6d6533c008349788ff3f9).\n\n**About the 2025 Holiday Spending Shift Survey**\n\nVisa commissioned Morning Consult to survey a sample of 1,000 U.S. adults between October 14 and October 16, 2025. The interviews were conducted online, and the data were weighted based on gender, education attainment, age, and race. Results from the full survey have a margin of error of plus or minus 3 percentage points.\n\n**About Visa**\n\nVisa (NYSE: V) is a world leader in digital payments, facilitating transactions between consumers, sellers, financial institutions and government entities across more than 200 countries and territories. Our mission is to connect the world through the most innovative, convenient, reliable and secure payments network, enabling individuals, businesses and economies to thrive. We believe that economies that include everyone everywhere, uplift everyone everywhere and see access as foundational to the future of money movement. Learn more at [Visa.com](https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2FVisa.com&esh",
  "wordCount": 671,
  "hash": "68e08656645bd1ab",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:23:31.446Z",
  "sourceType": "platform"
}