{
  "url": "https://analyticsindiamag.com/ai-trends/top-7-noteworthy-ai-innovations-in-fashion-in-2023/",
  "title": "Top 7 Noteworthy AI Innovations in Fashion in 2023",
  "snippet": "AI has been catalyst in analysing data for trend-driven collections, and is pivotal in developing eco-friendly materials, optimising production for",
  "domain": "analyticsindiamag.com",
  "publishedDate": "2023-12-11T06:32:41+00:00",
  "extractedText": "Published on December 11, 2023 In AI Trends 7 Noteworthy AI Innovations in Fashion AI is changing how we shop and what we shop for. Image by Nikhil Kumar By Shritama Saha This year, we saw companies around the world grab generative AI with both their hands and integrate it in their daily workflow. But the fashion industry took its own sweet time. However, we have recently witnessed significant developments in this space, particularly over the last six months of 2023. AI has been catalyst in analysing data for trend-driven collections, and is pivotal in developing eco-friendly materials, optimising production for sustainability and more. Now, let’s explore some key developments in the application of AI in the fashion industry this year. Meta Meta and luxury fashion brand EssilorLuxottica have launched the new Ray-Ban Meta smart glasses that offer improved audio with custom-designed speakers, an ultra-wide 12 MP camera for higher quality photos and 1080p videos and are powered by the Qualcomm Snapdragon AR1 Gen1 Platform. Livestreaming to Facebook or Instagram is now possible, and the glasses feature hands-free convenience, water resistance (IPX4), and a sleek charging case for up to 36 hours of use. The glasses come in Wayfarer and Headliner styles, with various frame and lens combinations, and are prescription-lens compatible. Humane AI Introduced at the premier Paris fashion week by supermodel Naomi Campbell, OpenAI-backed startup Humane AI introduced the Ai Pin, shedding light on the future of AI wearables. Humane’s AI Pin is a voice-activated wearable device that uses LLMs for conversational AI interaction. Operating on the Cosmos system, it streamlines user experience by automatically directing queries to relevant tools, eliminating the need for manual app or settings management. Through the AI Mic software, the device connects to AI models, including OpenAI’s ChatGPT, enabling tasks such as making calls, translating conversations, taking photos, and delivering reminders. Google Google has launched two features to improve online shopping of clothes. The virtual try-on for apparel uses generative AI to display clothes on diverse real models, aiding users in making informed decisions about how the garments will look on different body types and skin tones. Currently available for women’s tops from brands like Anthropologie, Everlane, H&M, and LOFT, this feature is expected to expand to include more brands and items, including men’s shirts. The second feature, guided refinements, utilises machine learning and visual matching algorithms to help users narrow down online product searches based on factors like colour, style, and pattern, offering a more tailored shopping experience with options from various retailers. Both features aim to replicate the convenience of trying on clothes in-store and address common challenges faced by online shoppers. Levi Strauss Denim pioneer Levi Strauss announced a partnership with Lalaland.AI, an Amsterdam-based digital fashion studio specialising in AI-generated models. The collaboration aims to test AI-generated models later this year to complement human models, diversifying and expanding the representation of models for Levi’s products. Lalaland.ai employs advanced AI to create hyper-realistic models representing various body types, ages, sizes, and skin tones, contributing to a more inclusive and sustainable shopping experience. While acknowledging the potential of AI technology to enhance consumer experience, the focus remains on leveraging technology to create a more diverse, personal, and engaging customer experience, aligning with Levi’s ongoing efforts to foster diversity in both content creation and consumer representation. Adobe Adobe’s Project Primrose is an interactive dress crafted using wearable and flexible, non-emissive textiles, allowing the entire surface to display content made using Adobe Firefly, Adobe After Effects, Adobe Stock, and Adobe Illustrator. The dress is engineered to animate fabric, undergoing design and style changes quickly. The technology at play involves light-diffusing modules for displays, utilising a non-emissive and flexible system employing reflective-backed polymer-dispersed liquid crystal (PDLC), a material commonly used in smart windows. This energy-efficient material, adaptable to various shapes, dynamically diffuses light. Moreover, the dress integrates sensors that respond to the wearer’s movements. Designers can opt to employ Adobe’s creative AI tools to generate visuals based on textual prompts. Shopify Canadian e-commerce giant Shopify is also embracing generative AI through its Shopify Magic initiative. Under this umbrella, the company unveiled enhanced features that leverage generative AI. Shopify Magic can now deliver tailored responses to customer queries based on their interaction history and store policies. It extends its capabilities to generate content such as blog posts, product descriptions, and marketing emails. T",
  "wordCount": 1395,
  "author": "Shritama Saha",
  "hash": "75027fc3fd6c841f"
}