{
  "url": "https://think.taylorandfrancis.com/special_issues/new-developments-in-luxury-advertising-artificial-intelligence-new-technologies-sustainability-and-influencers/",
  "title": "New Developments in Luxury Advertising:  Artificial Intelligence, New Technologies, Sustainability, and Influencers",
  "snippet": "We invite research that advances theoretical and empirical understanding of how luxury brands can adopt AI without eroding symbolic value or authenticity.",
  "domain": "think.taylorandfrancis.com",
  "publishedDate": "2026-08-31",
  "extractedText": "Submit a Manuscript to the Journal International Journal of Advertising For a Special Issue on New Developments in Luxury Advertising: Artificial Intelligence, New Technologies, Sustainability, and Influencers Manuscript deadline 31 August 2026 Special Issue Editor(s) Eunju Ko, Professor, Yonsei University[email protected] Teresa Sádaba, Dean, ISEM Fashion Business School, Universidad de Navarra[email protected] Carmen Valor, Professor, IIT-Universidad Pontificia Comillas[email protected] Journal information Submit an article to International Journal of AdvertisingView International Journal of Advertising on Taylor & Francis OnlineRead the Instructions for Authors on International Journal of Advertising New Developments in Luxury Advertising: Artificial Intelligence, New Technologies, Sustainability, and Influencers The luxury sector is undergoing a profound transformation, marked by complexity, volatility, and new societal and technological challenges. Traditional growth models show signs of fatigue, while institutional pressures push brands toward more authentic commitments to sustainability, ethics, and inclusion (Larranaga & Valor, 2022; Teona et al., 2020). Simultaneously, luxury brands face a rapidly shifting competitive landscape, with changes in global markets, consumer expectations, and technological innovation. In this context, advertising is central to redefining the identity, desirability, and legitimacy of luxury brands. As Ko (2020) noted in a previous International Journal of Advertising special issue, the study of luxury advertising requires continuous theoretical and methodological renewal. Building on that foundation, this special issue seeks to advance conceptual, empirical, and interdisciplinary insights into how luxury advertising is being reimagined through artificial intelligence (AI), emerging technologies, influencer ecosystems, and sustainability. We especially invite contributions that explore the tensions between tradition and innovation, authenticity and automation, exclusivity and accessibility, and symbolism and data-driven personalization. Artificial Intelligence and New Technologies Artificial intelligence (AI) and related technologies are reshaping luxury advertising by enabling hyper-personalization, predictive analytics, and novel creative outputs (Qi et al., 2025). From generative content to immersive AR and metaverse campaigns, these tools extend luxury’s narrative potential and promise new consumer experiences. Yet research highlights ambivalence in consumer responses: AI-generated advertising can appear inauthentic and misaligned with luxury’s aura of craftsmanship and artistry (To et al., 2025; Xu & Mehta, 2022). Success often depends on trust and perceived humanness, with consumers more receptive when AI is positioned as augmenting rather than replacing human creativity (Jung et al., 2025; Ryoo et al., 2025). This suggests that the integration of AI into luxury advertising not only offers opportunities but also introduces tensions that demand deeper theoretical exploration. We invite research that advances theoretical and empirical understanding of how luxury brands can adopt AI without eroding symbolic value or authenticity. Relevant questions include how AI-generated avatars and chatbots alter perceptions of brand aesthetics, how predictive modeling balances personalization with transparency and privacy concerns, and under what conditions immersive technologies (NFTs, AR filters, metaverse campaigns) enhance rather than commodify the luxury experience (Cho, Ko, & Jung 2024; Cho, Ko, & Taylor, 2024; SanMiguel, Sádaba, & Sayeed, 2024; Wang, Ko, & Milfeld, 2025). Current evidence remains fragmented, highlighting opportunities for deeper investigation of cultural, ethical, and aesthetic implications. Influencers and Evolving Communication Ecosystem Ecosystem Influencers—whether human, virtual, or AI-generated—have become central to luxury advertising, shaping consumer aspirations and brand legitimacy across digital platforms. Their effectiveness, however, is contingent on credibility, authenticity, exclusivity, and cultural context, raising persistent tensions in luxury communication (Huang & Zhou, 2025; Pedroni, 2023). While collaborations with influencers can amplify reach and relatability, over-commercialization risks diminishing attention, trust, and distinctiveness (Chaihanchanchai, 2025; Lu et al., 2025; Xie et al., 2025). At the same time, AI-powered tools increasingly influence this ecosystem—identifying influencers, generating personalized recommendations, and even producing content (Aldous et al., 2024; Ramachandran et al., 2024). These innovations complicate the balance between technological precision and the symbolic codes of luxury, highlighting an urgent need for systematic inquiry. We welcome studies that clarify how different types of influencers—celebrity, micro, or virtual—shape luxury consumers’ perceptions, and how effects vary across platforms, cu",
  "wordCount": 1575,
  "author": "Taylor & Francis",
  "hash": "77fa972e94469213"
}