{
  "url": "https://www.mckinsey.com/~/media/McKinsey/Industries/Automotive%20and%20Assembly/Our%20Insights/How%20advanced%20industrial%20companies%20should%20approach%20artificial%20intelligence%20strategy/How-advanced-industria-companies-approach-artificial-intelligence-strategy.pdf",
  "title": "How-advanced-industria-companies-approach-artificial-intelligence-strategy.pdf",
  "snippet": "by W Baan · 2017 · Cited by 5 — How advanced industrial companies should approach artificial-intelligence strategy. Asking 3 questions can help leaders reach a strategic stance on",
  "domain": "mckinsey.com",
  "publishedDateInvalid": true,
  "extractedText": "1\n\nWouter Baan, Joshua Chang, and \n\nChristopher Thomas HOW ADVANCED INDUSTRIAL COMPANIES SHOULD APPROACH ARTIFICIAL-INTELLIGENCE STRATEGY \n\nNovember 2017 \n\n# Leaders need to determine what AI can do for their company by looking at potential applications and scenarios, and then building their approach around those findings. Artificial intelligence (AI) has reached a commercialization tipping point. As a result of several technology advancements that are now converging, major investments by technology companies and start-ups, and demand from businesses, AI is starting to have a major impact across markets. Advanced industries such as automotive, semiconductors, and industrial manufacturing could harness AI over the next decade to discover entirely new ways to make things better, cheaper, and faster. While popular reporting on the topic often tends to focus only on generating new business ideas, companies can directly apply AI to their current core business processes and operations. However, many companies have yet to think through how they could embed AI in their strategies and businesses. Instead, they take ad hoc approaches that might not scale up, cannot prove the worth of new technologies, and fail to build systematic capabilities. Ultimately, such efforts make little impact. \n\nHype galore, but many businesses are not yet clear on using AI technology \n\nWhile projections vary, forecasters seem to align on an annual AI revenue growth rate of roughly 50 percent. Analysts are bullish about AI, claiming it has the potential to drive significant productivity improvements via the automation of multitudes of manual tasks across nearly every industry. While the hype surrounding AI has reached critical mass, many companies remain unsure what to do with the technology. For example, one big concern: in a McKinsey survey of respondents from Chinese companies, results showed that AI is not a strategic priority for 43 percent of C-level executives. 2McKinsey Center for Future Mobility How advanced industrial companies should approach artificial-intelligence strategy At the same time, the top three barriers to executing AI were the lack of required talent and capabilities, AI technology not being mature, and top management not being clear on the value of AI (Exhibit 1). \n\nOne big challenge is that artificial intelligence is not a strategic priority \n\nWeb 2017 How automotive players should approach AI strategy Exhibit 1 of 2 \n\nIs AI technology a strategic priority for the CEO or C-level executive team? \n\nPercentage of respondents \n\nWhat is the top barrier to artificial-intelligence (AI) application in your company? \n\n1. Talent and knowledge 2. AI technology maturity 3. Top management unclear about AI value 4. Difficult to identify business use cases 5. Regulatory support 6. Data availability 7. Computing infrastructure \n\n43 11 46 Not a strategic priority or on CEO’s agenda Top priority 1 of the strategic priorities \n\n> Source: McKinsey analysis\n\nExhibit 1 How to define an AI strategy \n\nGiven the buzz and confusion that surrounds AI in general, business leaders need to determine what the technology can and cannot do for their company, and build an AI strategy based on those findings. Typical steps include identifying potential applications, playing out scenarios of AI-generated industry disruptions, defining a strategic stance and selecting underlying AI initiatives, and making the AI transformation happen. The first two steps focus on understanding how the external environment could evolve, while the second two cover what the company should do about it. 3McKinsey Center for Future Mobility 3McKinsey Center for Future Mobility \n\nIdentify potential AI applications \n\nFirst, move quickly from big-picture concepts to concrete, specific applications where AI creates business value (either sooner or later). Generate a list of these real-world applications by discussing the topic with everyone, including venture capitalists, research labs, the company’s IT department, and consultants, and by conducting internal brainstorming. It often proves helpful to brainstorm on the applications along three archetypes. For example, operational enhancements could cover research, product development, manufacturing, supply chain management, or marketing and sales. This might include introducing AI-enhanced predictive maintenance in manufacturing or developing R&D applications that could recommend modification areas to drive productivity. Another archetype focuses on product innovations, such as automated driver-assistance system modules, or even new business models. The latter likely builds on the earlier two, for example, using an autonomous-driving system to unlock shared-mobility and in-car services. Once identified, assess the level of potential disruption each AI application could deliver using seven product and value chain questions. Product questions: \n\n Does it provide an efficiency boost or cost reduction? \n\n Can it enable product sub",
  "wordCount": 2418,
  "hash": "925c08a606471f0a",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:23:56.754Z",
  "sourceType": "consultancy"
}