{
  "url": "https://www.aboutamazon.com/news/retail/amazon-agentic-ai-gen-ai-shopping",
  "title": "How Amazon is making it easier to shop by leveraging GenAI and AgenticAIFacebookYoutube",
  "snippet": "Our new AI-powered features are making shopping even more convenient by helping customers discover and evaluate products in whatever way",
  "domain": "aboutamazon.com",
  "publishedDate": "2025-11-18T14:00:08.527Z",
  "extractedText": "Key takeawaysAmazon’s AI-powered innovations help customers find, discover, and evaluate products from our broad selection.We work backwards from the customer to solve online shopping pain points and offer a variety of convenient next-gen conversational, visual, and auditory tools to help customers shop in a way that feels most natural.Amazon has been using AI to improve the customer shopping experience for over 25 years. What began as machine learning algorithms to recommend books has evolved into AI-powered tools that help customers quickly discover and evaluate products in our store.Amazon now offers the broadest selection in retail, carrying hundreds of millions of products, including more than 300 million items available with fast, free delivery for Prime members, across more than 35 categories including home, apparel, beauty, grocery, and household essentials. We offer this vast selection because Amazon customers expect a wide variety of options, but evaluating products and making a choice can take time. Let’s say you’re shopping for a coffee maker in a physical store—you might find five to 10 models on the shelf. In Amazon’s store, there are many more coffee maker options available. For one customer, a red single-serving coffee maker with an easy to clean filter may make the most sense; for another customer, an industrial-sized stainless steel multi-purpose espresso machine may be the perfect choice. Our shopping experience is personalized and designed to help customers find and discover the products that are right for them, using signals including reviews, price, availability, delivery speed, return rates, and browsing and shopping history.Amazon’s next-gen AI assistant for shopping is now even smarter, more capable, and more helpfulRufus can search for products based on activity, event, purpose, and other use cases, and automatically add items to your cart, tell you if you’re getting the best price, find top deals every day of the year, auto-buy items at a set price, and take a handwritten grocery list and add the items to your cart.AI-powered search and discoveryOur traditional search bar has long connected customers to Amazon’s broad selection and low prices, helping them quickly find the right products while sparking exploration and discovery. Over the past couple of years, we have further refined our search capabilities using AI, and our systems now better understand the intent behind a customer’s search. It's not just about matching keywords anymore—it's understanding what customers are actually looking to buy. This AI-powered approach is more effective and more comprehensive, better understanding the full context of what shoppers want.These advancements in our traditional search models have enabled us to rapidly grow and experiment in next-gen search experiences. Our new AI-powered features are making shopping even more convenient by helping customers discover and evaluate products in whatever way feels most natural to them. We take an iterative approach to building and launching these experiences, often rolling them out in beta to test and learn what resonates with customers. If another feature better solves a customer pain point, we evolve and move on quickly.01 / 08Both our feature set and rate of customer adoption continue to grow. For example:More than 250 million customers have used Rufus this year; monthly users are up 140% YoY and interactions are up 210% YoY. Customers that use Rufus during a shopping journey are 60%+ more likely to convert.Review highlights receive hundreds of millions of impressions weekly, and customers who engage with review highlights have increased by 100% year over year.Hear the Highlights—which has expanded from hundreds of products at launch to millions of products currently—has been used by millions of customers who've streamed more than seven million minutes of content, with nearly half of all customers listening to full episodes.Nearly 20% of customers who created Interests added a recommended item to their cart.Photo searches in Amazon Lens have more than doubled since 2023, and the launch of Lens Live has increased engagement in Amazon Lens by 13%.Billions of personalized size recommendations are generated each month for customers.With Alexa+, we’re also seeing customers having deeper, more helpful shopping conversations, and when customers explore items, they are resulting in three times more on-device purchases compared to the classic Alexa.Products available to purchase through our agentic AI experience Buy for Me have increased from 65K at launch to over half a million presently, and we’re seeing positive customer response as we show selection found both on- and off-Amazon.We use AI in many ways to make shopping in our store more convenient for customers—here are some of the ways customers are using AI-powered features to shop:Rufus – The all-in-one AI assistant for shoppingRufus, our AI assistant for shopping, helps you shop smarter by answering an",
  "wordCount": 1829,
  "author": "Written by Amazon Staff",
  "hash": "a359d803b3db26f4"
}