{
  "url": "https://articlegateway.com/index.php/JMDC/article/view/7012",
  "title": "The Role of Generative AI in Shaping Millennials and Gen Z’s Orientation Toward Luxury Products\n\t\t\t\t\t\t\t| Journal of Marketing Development and Competitiveness",
  "snippet": "This study investigates the impact of Artificial Intelligence (AI)-generated promotional content and status motivations on the perception of luxury brands",
  "domain": "articlegateway.com",
  "extractedText": "The Role of Generative AI in Shaping Millennials and Gen Z’s Orientation Toward Luxury Products Authors Emad AbouElgheit Western Connecticut State University DOI: https://doi.org/10.33423/jmdc.v18i2.7012 Keywords: marketing, development, generative AI, luxury products, status consumption, social media, source credibility, consumer behavior, artificial intelligence Abstract This study investigates the impact of Artificial Intelligence (AI)-generated promotional content and status motivations on the perception of luxury brands among Millennials and Generation Z. The author adopts a mixed-method research approach that integrates a quantitative survey and structural equation modeling analysis with qualitative Natural Language Processing (NLP). The findings reveal that generative AI promotional content impacts millennials and Gen Z’s purchase intention due to its perceived entertainment, transparency, and usefulness. Status motivations had a stronger impact on purchase intention, and demographic characteristics were significantly different in their results. The study is the first to examine the human characteristics of perceived expertise, transparency, and entertainment in an AI context in light of status consumption motivation. As AI is expected to have more human-like characteristics and behavior, testing theories centered on human influence in an AI context is crucial for marketing theory and practice. References Baykal, B. (2020). Generational differences in omnichannel experience: Rising new segment: Gen Z. In Managing Customer Experiences in an Omnichannel World: Melody of Online and Offline Environments in the Customer Journey (pp. 117–132). Emerald Publishing Limited. https://doi.org/10.1108/978-1-80043-388-520201011 Bhavaraju, P. (2023). How Generative AI Is Transforming Today’s and Tomorrow’s Software Development Life Cycle. Forbes. Retrieved from https://www.forbes.com/sites/forbestechcouncil/2023/11/17/how-generative-ai-is-transforming-todays-and-tomorrows-software-development-life-cycle/?sh=6ce5fd025246 Bouvier, L., & Cho, E. (2022, December 31). How do virtual social media influencers affect Millennial and Gen Z female consumers’ purchase intentions? A comparison of fast fashion versus luxury fashion brands. Innovate to Elevate. https://doi.org/10.31274/itaa.16012 Cho, E., Kim-Vick, J., & Yu, U.-J. (2021). Unveiling motivation for luxury fashion purchase among Gen Z consumers: Need for uniqueness versus bandwagon effect. In International Journal of Fashion Design, Technology and Education. https://doi.org/10.1080/17543266.2021.1973580 Deng, D.S., Seo, S., Li, Z., & Austin, E.W. (2022). What people TikTok (Douyin) about influencer-endorsed short videos on wine? An exploration of gender and generational differences. Journal of Hospitality and Tourism Technology, 13(4), 683–698. https://doi.org/10.1108/JHTT-05-2021-0143 Eastman, J.K., Iyer, R., Shepherd, C.D., Heugel, A., & Faulk, D. (2018). Do they shop to stand out or fit in? The luxury fashion purchase intentions of young adults. Psychology & Marketing, 35(3), 220–236. https://doi.org/10.1002/mar.21082 Gartner. (2023). Gartner Survey Finds 63% of Marketing Leaders Plan to Invest in Generative AI in the Next 24 Months. Retrieved from https://www.gartner.com/en/newsroom/press-releases/2023-08-23-gartner-survey-finds-63-percent-of-marketing-leaders-plan-to-invest-in-generative-ai-in-the-next-24-months Giovannini, S., Xu, Y., & Thomas, J. (2015). Luxury fashion consumption and Generation Y consumers. Journal of Fashion Marketing and Management, 19(1), 22–40. https://doi.org/10.1108/JFMM-08-2013-0096 Hemantha, Y. (2019). Celebrity endorsement of luxury brands in purchasing pattern among Generation Z customers. SSRN Electronic Journal. https://doi.org/10.2139/ssrn.3500626 Kautish, P., Khare, A., & Sharma, R. (2021). Influence of values, brand consciousness and behavioral intentions in predicting luxury fashion consumption. Journal of Product & Brand Management, 30(4), 513–531. https://doi.org/10.1108/JPBM-08-2019-2535 Kim, J., & Lee, H.-H. (2011). The impact of shopping orientations on U.S. consumer’s retail channel choice behavior toward luxury goods purchases*. Journal of Global Fashion Marketing, 2(4), 188–199. https://doi.org/10.1080/20932685.2011.10593097 KPMG. (2023). KPMG Generative AI Survey. Retrieved from https://info.kpmg.us/news-perspectives/technology-innovation/kpmg-generative-ai-2023.html Lau, M.M., Ng, P.M.L., Chan, E.A.H., & Cheung, C.T.Y. (2023). Examining purchase intention for luxury fashion: Integrating theory of reasoned action, with affect-behavior-cognition (ABC) model, identity and social identity theories. Young Consumers, 24(1), 114–131. https://doi.org/10.1108/YC-07-2022-1557 Liu, V. (2023). Beyond text-to-image: Multimodal prompts to explore generative AI. Extended Abstracts of the 2023 CHI Conference on Human Factors in Computing Systems, pp. 1–6. https://doi.org/10.1145/3544549.3577043 Lou, C., & Yuan, S. (2019). Influence",
  "wordCount": 800,
  "hash": "b523722c748a8562"
}