{
  "url": "https://www.forbes.com/sites/pamdanziger/2024/04/24/lvmh-understands-the-ai-challenge-for-luxury-is-not-technology-but-the-human-element/",
  "title": "LVMH Sees The AI Challenge For Luxury Is Not Technology But The Human Element",
  "snippet": "Luxury brands are widely using basic AI for data analysis to forecast demand, in supply chain management and to support other operational",
  "domain": "forbes.com",
  "publishedDate": "2024-04-24",
  "extractedText": "BusinessRetailLVMH Sees The AI Challenge For Luxury Is Not Technology But The Human ElementByPamela N. Danziger,Senior Contributor.Forbes contributors publish independent expert analyses and insights. Pam Danziger reports on retail, focused on the luxury consumer market.Follow AuthorApr 24, 2024, 07:00am EDTApr 24, 2024, 05:48pm EDTFrench luxury group LVMH Chairman and Chief Executive Officer Bernard Arnault presents the group's annual results for 2018 at the LVMH headquarters in Paris, on January 29, 2019. (Photo by ERIC PIERMONT / AFP) (Photo by ERIC PIERMONT/AFP via Getty Images)AFP via Getty ImagesLuxury brands are widely using basic AI for data analysis to forecast demand, in supply chain management and to support other operational uses, but the emergence of generative AI (GenAI) takes AI to a whole new level, both maximizing the opportunities and the challenges.Basic AI is programmed to analyze data, identify patterns and make predictions. Its scope is limited and its range narrow. GenAI has no such limits. It is programmatically trained to analyze data inputs from multiple sources and create new content and information in a variety of formats, including text, photos, video and audio. GenAI mimics human creativity, though it lacks human cognitive abilities and contextual understanding. It holds the promise to expand human limits and accomplishments, but it has no moral compass or as retail industry analyst Robin Lewis observes, “What it doesn’t deliver is wisdom, insight, and context. It is soulless.”For example, Senator Richard Blumenthal opened a Congressional hearing on the dangers of AI by playing a recorded message of what sounded like his voice saying words he didn’t write. His voice and speech were created by GenAI, but it could have just as easily been a video given GenAI’s power. Luxury brands design products reflecting the highest levels of human creative achievement. The brands prosper in the marketplace on authenticity and person-to-person connections that build trust. Rather than enhancing those qualities, the irresponsible use of GenAI can threaten them. MORE FROM FORBES ADVISORBest High-Yield Savings Accounts Of 2024By Kevin Payne ContributorBest 5% Interest Savings Accounts of 2024By Cassidy Horton ContributorAs the luxury market leader, LVMH has the most to gain from AI if used effectively and the most to lose if AI is deployed improperly. And given its scale, LVMH has unmatched resources to discover AI’s potential. That’s why it’s getting the best minds behind it to explore the uncharted waters of artificial intelligence. It recently hosted a three-day LVMH Data AI Summit in Paris, bringing together students and practitioners to explore innovative AI applications. And it has aligned with Stanford University’s Institute for Human-Centered Artificial Intelligence Institute (Stanford HAI), which is on the forefront of research in the retail sector for AI safety, human-centered design, human-computer interactions and other areas.“Recent generative AI breakthroughs show new opportunities for major innovation and efficiency but also challenges and risks. LVMH will accelerate the efforts to learn and experience how it can help the business,” the company said in a statement. Risks And RewardsHuman creativity is the lifeblood of LVMH’s 75 brands, called Maisons, as well as the luxury market in general. If GenAI can enhance that creativity, then luxury brands will gain the most from investments in its capabilities. A Deloitte survey found 20% of retailers plan to use GenAI to augment the creative process. LVMH recognizes GenAI’s creative potential in the luxury market. “While these technologies offer remarkable creative potential, making it possible to generate bespoke designs and personalized experiences, they also raise questions about authenticity, as well as responsibility,” it stated. At the same time, luxury brands like LVMH have long recognized the essential role of the human element – the person-to-person connection – in the retail environment. That was the main reason why luxury brands were slow to adopt e-commerce. This is where the Stanford HAI partnership comes into play. “Stanford HAI’s mission focuses on how to properly design and build human-centered AI to have positive human impacts,” Stanford HAI’s vice director of research James Landay said in a statement.The statement continued, “The LVMH luxury group will work with faculty and students to better understand current advances in this technology and how to augment employees without replacing them.” Stanford HAI’s managing director for industry programs and partnerships, Panos Madamopoulos-Moraris, explained: “We are poised to guide AI’s evolution in creative and consumer industries, an area relatively underexplored compared to enterprise applications. We look forward to working with LVMH, our first European member, as we aim to augment creative minds, enable the safe development of large models in luxury, and translate artifici",
  "wordCount": 1649,
  "author": "Pamela N. Danziger",
  "hash": "be266646c8769184",
  "topic": "AI_and_Strategy"
}