{
  "url": "https://www.forbes.com/sites/jillstandish/2025/06/04/gen-ai-rewriting-the-rules-of-retail/",
  "title": "Generative AI Rewriting The Rules Of Retail",
  "snippet": "Armed with AI copilots, retail associates can now spend less time on repetitive tasks—inventory checks, scheduling, and so on—and more time",
  "domain": "forbes.com",
  "publishedDate": "2025-06-04",
  "extractedText": "BusinessRetailGenerative AI Rewriting The Rules Of RetailByJill Standish,Contributor.Forbes contributors publish independent expert analyses and insights. I examine how retailers can build resilient, responsible businesses.Follow AuthorJun 04, 2025, 06:16pm EDTJun 06, 2025, 10:47am EDT AI chat bot conversation using artificial intelligence technology to answer user. Chatbot virtual assistant, generative AI, customer support. Person typing prompt on laptop. Chat interface.gettyGenerative AI is quietly rewriting the rules of brand discovery and consideration. Large Language Models now guide shoppers through every step of the journey—surfacing options, comparing features, and even narrowing choices—often without the consumer noticing. While the share of purchases influenced by these AI “concierges” is still small, it’s growing at a remarkable pace. Brands that learn how to show up in this new, AI-curated path-to-purchase will be best positioned to fill (and widen) the top of the funnel.Accenture’s Consumer Pulse Survey 2025 shows nearly one in ten consumers already rank the technology as their most trusted source of what to buy. And over a third of active users—defined as people using gen AI tools at least weekly for personal and/or professional reasons—consider it “a good friend”. It signals a huge shift in consumer attitudes. But it doesn’t end there. As the technology advances, it’s not only able to advise shoppers, but, increasingly, can carry out tasks on their behalf. This is the true promise of agentic AI. Big picture? From the moment a question is asked of a chat-based assistant to the final decision on a product, Gen AI is taking on the role not only of search engine, but a full-service concierge for the modern shopper. Disruption, yes, but also opportunity For retailers and consumer brands, this is both a challenge and an invitation. Do nothing, and risk being misrepresented—or worse, left out of the conversation altogether. It’s why actively engaging with the consumer LLM ecosystem is non-negotiable.MORE FOR YOUIt’s also important to look beyond the short-term disruption and focus on the deeper revenue opportunity. Accenture’s Consumer Pulse Survey reveals consumers are 1.7 times more likely to accept a higher price point from a brand that delivers emotionally or experientially engaging experiences. The implication is clear: when AI curates experiences that feel personal, relevant, and timely, it opens the door to deeper relationships and greater revenue streams. Becoming discoverableThe ecosystem around Gen AI is already forming. It’s not just the foundational models themselves but also the interfaces, data sources such as product catalogs and customer reviews, and partnerships that define how a brand shows up in AI-mediated interactions. For example, when a customer asks, “What’s the best moisturizer for sensitive skin under $50?” AI’s response is not only shaped by historical information from the public internet but increasingly live product data—specifications, ratings, availability, and even brand sentiment. As consumers increasingly think of LLMs as trusted personal shoppers, brands must reimagine their digital strategy. This means allowing the LLM ecosystem to find you in terms of products, inventory, and even prices. Gone are the days of locking down your digital website to not allowing ‘scraping’ if you want to be recommended and served up by these shopping agents.Get it right and your brand becomes not just discoverable but recommended. Not just included but prioritized. Welcome to the Recommendation EraSearch is giving way to suggestion. Retailers now have the opportunity to embed branded, AI-powered advisors directly into their own channels. Instead of forcing shoppers to hunt for SKUs on your website, invite them to ask real questions: “what should I wear to a summer wedding?” or “which after-school snack is the healthiest for my kids?”Gen AI can listen, reason with your product and customer data, and deliver tailored answers in seconds. Curating these conversational experiences today will define how customers discover, trust, and buy from you tomorrow.Gen AI-powered store staffAmid all the excitement around digital commerce, it’s important not to overlook another of gen AI’s profound impacts: the in-store experience. Armed with AI copilots, retail associates can now spend less time on repetitive tasks—inventory checks, scheduling, and so on—and more time engaging customers. In this way, LLM-powered automation isn’t just about driving efficiency. It’s about elevating empathy. And strengthening job satisfaction. When store staff have instant access to product knowledge, customer preferences, and contextual prompts, they become more effective. They can turn their stores into curated, personalized, consultative sales channels; more showroom, less storeroom. It’s a win-win for employees and consumers alike. Gen AI: Commerce’s Next StorefrontGen AI isn’t just another tool—it’s the new nervou",
  "wordCount": 795,
  "author": "Jill Standish",
  "hash": "c10abc8af7af890c",
  "topic": "AI_and_Strategy"
}