{
  "url": "https://www.sciencedirect.com/science/article/pii/S2444569X24000714",
  "title": "AI-enabled business models for competitive advantage - ScienceDirectScienceDirect",
  "snippet": "## Journal of Innovation & Knowledge. # AI-enabled business models for competitive advantage. Some firms have successfully harnessed artificial intelligence (AI) to create unparalleled wealth, while most around them have failed to do so. This managerial challenge has led to recent calls for research",
  "domain": "sciencedirect.com",
  "publishedDateInvalid": true,
  "extractedText": "Journal of Innovation & KnowledgeVolume 9, Issue 3, July–September 2024, 100532AI-enabled business models for competitive advantageAuthor links open overlay panelRicardo Costa Climent a b, Darek M. Haftor a b, Marcin W. Staniewski bShow moreAdd to MendeleyShareCitehttps://doi.org/10.1016/j.jik.2024.100532Get rights and contentUnder a Creative Commons licenseOpen accessAbstractSome firms have successfully harnessed artificial intelligence (AI) to create unparalleled wealth, while most around them have failed to do so. This managerial challenge has led to recent calls for research to answer the question of how firms can use AI to create and appropriate economic value. This paper answers that question. The paper reviews the existing research and discusses its merits. This review highlights the need for subsequent conceptual reconfigurations of business model theory, the theory of data network effects, and the theory of situated AI for competitive advantage. The integration of these three theories leads to a novel theory: AI-enabled business models for competitive advantage. This paper contributes to the broad literature on technology management, and more specifically to literature on technology-enabled business models and the use of AI. Several important managerial implications are outlined to help firms ensure successful AI use.Previous article in issueNext article in issueKeywordsArtificial intelligenceValue creation and appropriationBusiness model themesBusiness model architectureData network effectsSituated use of AIJEL classification032033D83Recommended articlesCited by (0)© 2024 The Author(s). Published by Elsevier España, S.L.U. on behalf of Journal of Innovation & Knowledge.",
  "wordCount": 226,
  "author": "AbstractSome firms have successfully harnessed artificial intelligence (AI) to create unparalleled wealth, while most around them have failed to do so. This managerial challenge has led to recent calls for research to answer the question of how firms can use AI to create and appropriate economic value. This paper answers that question. The paper reviews the existing research and discusses its merits. This review highlights the need for subsequent conceptual reconfigurations of business model theory, the theory of data network effects, and the theory of situated AI for competitive advantage. The integration of these three theories leads to a novel theory: AI-enabled business models for competitive advantage. This paper contributes to the broad literature on technology management, and more specifically to literature on technology-enabled business models and the use of AI. Several important managerial implications are outlined to help firms ensure successful AI use.",
  "hash": "c30c81391b2753c8",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:23:07.835Z",
  "sourceType": "discovery"
}