{
  "url": "https://menlovc.com/perspective/2025-the-state-of-generative-ai-in-the-enterprise/",
  "title": "2025: The State of Generative AI in the Enterprise | Menlo Ventures",
  "snippet": "*   [Focus Areas](https://menlovc.com/perspective/2025-the-state-of-generative-ai-in-the-enterprise/). The surge crowned Nvidia the world’s most valuable company.[1](https://menlovc.com/perspective/2025-the-state-of-generative-ai-in-the-enterprise/#4e03a784-4a54-4f8f-a3a1-cc36827fe026) Foundation mo",
  "domain": "menlovc.com",
  "publishedDate": "2025-12-09T12:30:00+00:00",
  "extractedText": "All Perspectives PerspectivePortfolio 2025: The State of Generative AI in the Enterprise December 09, 2025 Tim Tully, Joff Redfern, Deedy Das, Derek Xiao Facebook Linkedin Twitter Envelope Copy link Copied to clipboard! AI Boom vs. Bubble For all the fears of over-investment, AI is spreading across enterprises at a pace with no precedent in modern software history. For nearly three years, AI enjoyed unwavering confidence and record capital flows. The surge crowned Nvidia the world’s most valuable company.1 Foundation models announced close to $1 trillion in AI infrastructure commitments. Venture funding surged back toward all-time highs, with nearly half of it concentrated in just a handful of frontier AI labs. Then the euphoria peaked. An MIT study2 claiming that 95% of generative AI initiatives fail rattled markets over the summer, exposing how quickly sentiment could shift beneath the weight of AI’s massive capex spend. The whispers of a bubble became a din. The concerns aren’t unfounded given the magnitude of the numbers being thrown around. But the demand side tells a different story: Our latest market data shows broad adoption, real revenue, and productivity gains at scale, signaling a boom versus a bubble. Enterprise AI has surged from $1.7B to $37B since 2023, now capturing 6% of the global SaaS market and growing faster than any software category in history. For Menlo’s third annual State of Generative AI in the Enterprise report, we surveyed ~500 U.S. enterprise decision-makers and combined their insights with a bottoms-up model of the generative AI market spanning model APIs, infrastructure, and applications. Since 2023, our team has tracked AI’s evolution from early experiments to broad enterprise deployment, giving us a multi-year view of the speed and scale of this transformation. Follow the Money: Where Do Enterprise Dollars Flow? Our data indicates companies spent $37 billion on generative AI in 2025,3 up from $11.5 billion4 in 2024, a 3.2x year-over-year increase. The largest share, $19 billion, went to the user-facing products and software that leverage underlying AI models, aka the application layer. This represents more than 6% of the entire software market, all achieved within three years of ChatGPT’s launch. Growth extends far beyond a handful of AI chat apps, touching every domain in the economy. By our count, there are now at least 10 products generating over $1 billion in ARR and 50 products generating over $100 million in ARR, led by the model APIs powering applications (Anthropic*, OpenAI, Google), but increasingly distributed across departmental solutions in coding, sales, customer support, HR, and verticals from healthcare and legal to the creator economy. In 2025, more than half of enterprise AI spend went to AI applications, indicating that modern enterprises are prioritizing immediate productivity gains vs. long-term infrastructure bets. How AI Enters the Enterprise: The Path to Production After three years, enterprise AI’s path to production has taken shape. Early adopters had no playbook. Now, distinct patterns have emerged that break from traditional SaaS. Enterprises prefer buying over building, showing stronger purchase intent, and adopting AI through product-led growth at a scale rarely seen in enterprise software. Enterprises Are Buying More Than Building For a while, the prevailing wisdom was that enterprises would build most AI solutions themselves. Bloomberg trained BloombergGPT for finance in 2022, Walmart built Wallaby for retail in 2024. Teams were confident that, with the right data, domain expertise, and scaffolding, they could handle everything in-house. In 2024, that confidence still showed in the data: 47% of AI solutions were built internally, 53% purchased.5 Today, 76% of AI use cases are purchased rather than built internally. Despite continued strong investments in internal builds, ready-made AI solutions are reaching production more quickly and demonstrating immediate value while enterprise tech stacks continue to mature. Last year, enterprises were split on building vs. buying. Today, enterprises have more ready-made AI solutions in production as their internal builds mature. AI Buyers Convert at Higher Rates Enterprise buyers approach AI with notably high intent. We found that, once an organization commits to exploring an AI solution, deals convert at nearly twice the rate of traditional software: 47% of AI deals go to production, compared to 25% for traditional SaaS. That elevated conversion reflects strong buyer commitment and clear immediate value. Our survey data reveals that most organizations surface a long list of potential AI use cases—often 10 or more—but focus their adoption on near-term productivity gains or cost savings. While enterprises identify slightly more internal-facing use cases (59%) than customer-facing ones (41%), both categories move through the pipeline at nearly identical rates, suggesting that operational AI investments deli",
  "wordCount": 4647,
  "author": "Menlo Ventures",
  "hash": "d2115dba2489b57e",
  "topic": "AI_and_Strategy"
}