{
  "url": "https://www.gia.edu/gems-gemology/fall-2024-artificial-intelligence-in-jewelry-design",
  "title": "Generative Artificial Intelligence as a Tool for Jewelry Design",
  "snippet": "Evaluates the use of generative AI programs in jewelry design and addresses the related ethical, legal, and regulatory challenges.",
  "domain": "gia.edu",
  "extractedText": "Feature Gems & Gemology, Fall 2024, Vol. 60, No. 3 Generative Artificial Intelligence as a Tool for Jewelry Design Michael D. Magee Download PDF Figure 1. Midjourney 5.2 image variations produced from the prompt “a pair of 18 karat yellow gold earrings featuring a fusion of Art Deco and ancient Egyptian styles.” At each stage in this figure, the user selects one of the images (marked here by the colored square boundary) and feeds it back into the AI, which generates four new variations. In this manner, the image is further refined to suit the tastes of the designer or the client. ABSTRACT While the jewelry industry is deeply rooted in traditional tools and techniques, generative artificial intelligence (AI) must be recognized today as a revolutionary tool to assist jewelers. The intersection between AI and the creative arts is especially controversial, and the use of generative AI in jewelry design is no different. This paper examines how generative AI creates designs based on text and image prompts, comparing five of the more common AI programs (Midjourney, DALL.E, Stable Diffusion, Leonardo, and Firefly) with a focus on generating realistic jewelry images. It addresses the ethical, legal, and regulatory questions that have arisen around AI-generated art. Lastly, it explores how this new technology can best be used by jewelry designers to enhance creative expression. The allure of jewelry lies in its intricate design, the craftsmanship behind each piece, and the significance and lore we attach to particular jewels. From the skilled hands of ancient goldsmiths to the precision of modern-day artisans, the creation of jewelry has always been a deeply human endeavor. But as we stand on the brink of a new era, the time-honored traditions of jewelry design are converging with the cutting-edge advancements of artificial intelligence. This convergence has opened up a new frontier in design and creation, with generative AI making its way into the designer’s workshop alongside traditional tools and techniques. For decades, computer-aided design and manufacturing (CAD/CAM) and other digital design tools have been widely used by jewelry designers. However, generative AI reaches into a new realm where computers have become capable of generating unique designs with seemingly little to no direction or human input. In the context of jewelry design, this technology offers the potential to redefine the boundaries of creativity and production. Despite the exciting possibilities, this fusion of AI with the creative arts is not without controversy. Concerns range from the potential displacement of skilled artisans to the ethical implications of AI-generated art. As one U.S.-based digital advertising agency noted, “AI-generated content, while impressive in its ability to analyze trends and produce designs quickly, may lack the nuanced touch and emotional connection that is often conveyed through a human designer’s work. This could lead to a homogenization of design styles, as AI algorithms tend to optimize for efficiency and patterns in data rather than the bespoke artistry that clients seek” (JEMSU, n.d.). “AIDEATION” AND “HALLUCINATION” One of the most powerful opportunities that AI technology presents is the ability to brainstorm design ideas at incredible speed. Sometimes referred to by the play on words “AIdeation,” quickly creating ideas as starting points is becoming the most common use case for AI in design. With an input consisting of only a few words, AI can generate many iterations from a single concept or idea. As an example of a potential “AIdeation” workflow, consider the design of a pair of earrings for a client who is passionate about both ancient Egyptian and Art Deco styles. After a short description, or “prompt,” is entered into Midjourney (docs.midjourney.com/docs/prompts), the program quickly returns four original images blending these styles for the user to choose from (figure 1). These images are simply stepping stones to more variations. The user can choose any of the options to explore and create variations based on that image, making widely varied options at first and then refining the image through minor alterations. In approximately five minutes, Midjourney can generate 16 or more variations to begin designing around. Figure 2. Images from Midjourney 5.2 using the prompt “a pair of white gold earrings displaying a sense of asymmetrical balance.” Figure 3. Images generated by Midjourney 5.2 from the prompt “a rose gold pendant with contrasting round gems.” “Hallucination” is a common term used in reference to the popular ChatGPT or other text-based AI chatbot programs, where the program makes up patently false information in its answers. While this understandably poses a significant problem when attempting to collect and summarize factual information, it is actually a benefit where image generation is concerned. The images created by generative AI are not collages cut and pasted from different images ",
  "wordCount": 7278,
  "hash": "d5f00062a9b27ca2"
}