{
  "url": "https://openai.com/gpt-5/",
  "title": "GPT-5 is here | OpenAI",
  "snippet": "* ChatGPT(opens in a new window). * Sora(opens in a new window). * API Platform(opens in a new window). Try it in ChatGPT(opens in a new window)Read the research. ChatGPT powered by GPT-5. As a coding collaborator, GPT‑5 tackles complex tasks end-to-end and delivers more readily usable code, better ",
  "domain": "openai.com",
  "publishedDateInvalid": true,
  "extractedText": "OpenAIOpenAI Summer UpdateGPT-5 is hereOur smartest, fastest, and most useful model yet, with thinking built in. Available to everyone.Try it in ChatGPT(opens in a new window)Read the researchChatGPTFor developersFor businessChatGPT powered by GPT-5Expert intelligence for everyoneGPT‑5 is smarter across the board, providing more useful responses across math, science, finance, law, and more. It's like having a team of experts on call for whatever you want to know.The best response, every timeChatGPT is now designed to think deeply when you need it to.Great at codingAs a coding collaborator, GPT‑5 tackles complex tasks end-to-end and delivers more readily usable code, better design, and is more effective at debugging.An expressive writing partnerCreate clearer, more compelling messaging for everything from stories to speeches and beyond.More useful health answersOur best model yet for health-related questions, providing more precise and reliable responses while acting as more of a proactive thought partner.Safer and more accurateOur most reliable model yet. It’s less prone to hallucinations and pretending to know things.See how people are using GPT-5More new features in ChatGPTMake it your ownVoice improvementsStudy modeConnect your Gmail and Google CalendarFor more details, see here⁠(opens in a new window)The path to GPT-5Explore the evolution of our models in ChatGPTLearn more(opens in a new window)For developersOur most advanced model for coding and agentic tasksGPT‑5 produces high-quality code, generates front-end UI with minimal prompting, and shows improvements to personality, steerability, and executing long chains of tool calls. GPT‑5 also introduces ‘minimal’ reasoning and a ‘verbosity’ parameter in the API.Start building(opens in a new window)Read the API Platform blogGPT-5Text & vision400K context length | 128K max output tokensInput $1.25 | Output $10.00 per 1M tokensLearn more(opens in a new window)(opens in a new window)GPT-5 miniText & vision400K context length | 128K max output tokensInput $0.25 | Output $2.00 per 1M tokensLearn more(opens in a new window)(opens in a new window)GPT-5 nanoText & vision400K context length | 128K max output tokensInput $0.05 | Output $0.40 per 1M tokensLearn more(opens in a new window)(opens in a new window)See what businesses and developers have to say about GPT-5For businessOur best model for workGPT‑5 is smarter, more reliable, and built for the tasks businesses depend on. Your teams can trust it to handle important work with higher confidence.Try for free(opens in a new window)Contact salesA trusted subject-matter expertGPT‑5 excels at writing, research, analysis, coding, and problem-solving. It delivers more accurate, professional responses and feels like collaborating with a smart, thoughtful colleague.Learn how to make the most of GPT-5(opens in a new window)Everyone can be a power userChatGPT thinks harder on complex tasks and asks relevant follow-up questions to keep work moving. Every employee can get expert-level results without switching models.See how businesses use GPT-5Smarter with your company contextGPT‑5 produces higher-quality responses by using your company’s files and connected apps like Google Drive, SharePoint, and more, while respecting existing permissions.Explore apps(opens in a new window)Get started with GPT‑5Try now(opens in a new window)",
  "wordCount": 485,
  "hash": "e333fc704fadecd7",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:22:10.754Z",
  "sourceType": "discovery"
}