{
  "url": "https://www.paymentsjournal.com/holiday-shopping-soars-driven-by-ai-and-e-commerce/",
  "title": "Holiday Shopping Soars, Driven by AI and E-Commerce - PaymentsJournal",
  "snippet": "Early data from Visa shows that U.S. holiday retail spending rose 4.2% year-over-year, excluding inflation.",
  "domain": "paymentsjournal.com",
  "publishedDate": "2025-12-23T19:00:00.000Z",
  "publishedDateInvalid": false,
  "extractedText": "Despite macroeconomic concerns, the holidays are still a priority for consumers. Early data from Visa shows that U.S. holiday retail spending rose 4.2% year-over-year, excluding inflation. The report is based on payments activity tracked from early November and excludes automotive, gas, and restaurant spending. While in-store purchases still account for nearly three-quarters of holiday spending, e-commerce emerged as the primary driver of growth. Artificial intelligence also played a role in the online shopping boom. Visa found that roughly half of surveyed consumers said they planned to use AI tools for comparison shopping and to help narrow down gift choices. “It’s good news that holiday sales are up over 4% and e-commerce sales largely drove that by growing almost 8%,” said Don Apgar, Director of Merchant Payments at Javelin Strategy & Research. “Certainly, AI is playing a role in this growth by making it easier to search for products with less-defined input.” “So-called agentic search uses AI to discern meaning and intent from user search requests, rather than just matching on key words,” he said. “Because agentic search can deliver more accurate context-aware results, users are more likely to follow through with purchasing one of the suggested items.” Picking It Up Today It’s important to distinguish between agentic search—where AI agents help users discover products or services—and full-fledged agentic commerce. For example, a recent agentic search partnership between PayPal and AI platform Perplexity allows users to consult an agent and complete purchases within a chat interference, but the final decision remains with the shopper. This trend is prompting many merchants to rethink their strategies, though it doesn’t diminish the importance of the brick-and-mortar experience. “While there’s no question that agentic search is giving e-commerce a boost, what’s notable in all of this is that physical retail still accounted for almost 75% of total retail spending this holiday season, according to Visa’s research,” Apgar said. “While agentic search can only discover results on the web, this underscores the importance of omnichannel alignment for retailers.” “In-store inventory and buying options need to be available for agentic search engines so the consumer still gets meaningful results when they add ‘that I can pick up today’ to the end of their search query,” he said. The Agentic Holidays Despite these dynamic shifts, the retail sector is still far from true agentic commerce, in which AI agents independently handle most or all aspects of a transaction with minimal user involvement. While agentic commerce has yet to gain the same level of adoption as agentic search, Visa expects that to change. The company said it already completed hundreds of AI-driven transactions through trials of its Intelligent Commerce program and anticipates that millions of consumers will rely on AI agents as personal shoppers during next year’s holiday season. 0 SHARES 0 VIEWS Share on FacebookShare on TwitterShare on LinkedIn Tags: Agentic AIAgentic Commerceagentic searchAIE-commerceHoliday ShoppingHoliday Spending",
  "wordCount": 478,
  "author": "Wesley Grant",
  "hash": "e41fbdc069e42865",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:23:28.193Z",
  "sourceType": "discovery"
}