{
  "url": "https://aws.amazon.com/blogs/industries/how-generative-ai-and-data-are-redefining-retail-experiences/",
  "title": "How generative AI and data are redefining retail experiences | AWS for Industriesxfacebooklinkedininstagramtwitchyoutubepodcastsemail",
  "snippet": "Generative AI technologies, such as Amazon Q and Amazon QuickSight, offer several capabilities, such as gathering advanced data insights.",
  "domain": "aws.amazon.com",
  "publishedDate": "2024-10-22T16:11:18-08:00",
  "extractedText": "How generative AI and data are redefining retail experiences by Anu Kaggadasapura Nagaraja, Brendan Jenkins, Esther Kang, and Parker Bradshaw on 22 OCT 2024 in Amazon Bedrock, Amazon Connect, Amazon Lex, Amazon Personalize, Amazon QuickSight, Amazon Simple Storage Service (S3), CPG, Generative AI, Industries, Retail Permalink Comments Share The retail and consumer goods landscape is shifting seismically, with digital transformation at its core. Retailers and consumer brands are at various stages of this digital journey, each seeking tailored solutions to propel their businesses forward. To kick-start digital transformation, organizations need data-based insights that help them deliver on business outcomes. Accessing and acting on these insights is simpler than ever because of technologies such as data lakes, machine learning (ML), and artificial intelligence (AI). Elevating retail to new heights with generative AI In the dynamic world of retail and consumer goods, generative AI is a catalyst for transformative change. It’s transforming how companies interact with customers, manage operations, and drive growth. The potential of generative AI is incredibly exciting, with Goldman Sachs forecasting a 7-percent increase in global GDP and productivity growth of 1.5 percentage points over the span of 10 years. Automating product marketing Retailers and consumer goods brands can use Amazon Bedrock, large language models (LLMs), and multi-modal models for intelligent product analysis and descriptive writing. These models can ensure product accuracy, as well as optimize product descriptions for search engine optimization across online product portfolios. Take The Very Group (TVG), for example. TVG, a leading multi-brand online retailer in UK, offers customers access to thousands of products—across categories such as clothing, homeware, and electronics—through its popular ecommerce websites. It transformed its product-development process by developing a generative AI system to bolster TVG development. The system uses Amazon Bedrock, LLMs, and multi-modal models to analyze products and create content for TVG copywriters. This improved productivity by condensing development-processing times and increasing the quality of product descriptions. Empowering customer service Retailers are also striving to improve the customer experience both online and in stores. In a 2021 Qualtrics survey, 80 percent of customer respondents said they’ve switched brands because of a poor customer experience. Behind the scenes, AI-powered chatbots and customer service solutions are redefining personalized consumer interactions. With Amazon Web Services (AWS) contact center solutions, organizations can use chatbots to assist web customers almost instantly, improving customer satisfaction while reducing operational costs. And with Amazon Q in Connect, a generative AI assistant suggests agent responses and actions to address customer questions, providing faster issue resolution and improved customer experience. As Brian Dick, Senior Manager of Customer Care at Orbit Irrigation, said, “To resolve customers’ questions, our agents spend two to three minutes per interaction searching through several different sources of knowledge…. Amazon Q in Connect will create 10–15-percent time savings on every contact, and the increased number of calls handled every hour is expected to translate directly into costs savings for Orbit.” This personalized approach not only boosts customer satisfaction, but also cultivates loyalty. Another company revitalizing customer service is DoorDash. In early 2024, DoorDash deployed generative AI–powered self-service in its Amazon Connect contact center. DoorDash used generative AI to strengthen its customer support experience, particularly for Dashers, its delivery drivers. Faced with a high volume of requests from consumers, merchants, and Dashers, the company sought to improve its self-service options. DoorDash collaborated with AWS in its Generative AI Innovation Center, developing a voice-operated, self-service contact center solution within two months. Using Amazon Connect and Amazon Lex, DoorDash created an interactive voice response system that has reduced agent transfers by 49 percent. DoorDash also increased first-contact resolution by 12 percent, leading to better CX and $3 million in annual operational savings. However, many calls still required live agent assistance, prompting DoorDash to further enhance self-service capabilities. Since Dashers prefer phone support for quick help while on the road, DoorDash focused on shortening response times. It implemented generative AI through Amazon Bedrock, which helped answer common questions quickly, improving efficiency and trust in self-service. This initiative not only streamlined support, but also reinforced DoorDash’s commitment to empowering local economies and enhancing CX for its user base of more than 37 million consumers and 2 million Dashers. Hyper-personalizing",
  "wordCount": 2005,
  "hash": "e50554732afb29c8",
  "topic": "AI_and_Strategy"
}