{
  "url": "https://www.forbes.com/sites/peterbendorsamuel/2026/01/15/enterprise-ai-adoption-is-rising-but-the-conviction-is-still-missing/",
  "title": "Enterprise AI Adoption Is Rising, But The Conviction Is Still Missing",
  "snippet": "# Enterprise AI Adoption Is Rising, But The Conviction Is Still Missing. While generative AI and LLM-based technology options are being increasingly adopted by individuals for personal use, the same cannot be said for large enterprises. As I look across the marketplace, I see CIOs and CTOs preparing",
  "domain": "forbes.com",
  "publishedDate": "2026-01-15",
  "extractedText": "InnovationEnterprise TechEnterprise AI Adoption Is Rising, But The Conviction Is Still MissingByPeter Bendor-Samuel,Contributor.Forbes contributors publish independent expert analyses and insights. Peter Bendor-Samuel is founder & executive chairman of Everest Group.Follow AuthorJan 15, 2026, 08:43am EST--:-- / --:--This voice experience is generated by AI. Learn more.This voice experience is generated by AI. Learn more.Enterprise AI Adoption Is Rising, But The Conviction Is Still MissinggettyA dichotomy is forming between the personal and the professional when it comes to AI adoption. While generative AI and LLM-based technology options are being increasingly adopted by individuals for personal use, the same cannot be said for large enterprises. Trending terms such as “AI transformation”, |operating-model redesign”, and “enterprise readiness” dominate today’s technology dialogue, yet the reality of adoption and evolution on the ground is more measured. As I look across the marketplace, I see CIOs and CTOs preparing seriously for AI; but unfortunately, most enterprises still lack the conviction to make the large, structural investments required to unlock AI at scale. What specific preparations need to be made before this adoption can begin to mirror personal usage increase, then? And what is behind this hesitancy? Personal AI Adoption Is Surging, but Enterprises Are Moving Cautiously On the consumer side, AI is rocketing ahead. In our own firm, personal adoption is above 95 percent. Educated professionals commonly have multiple Large Language Models on their phones, using them for everything from productive work to quick research. This reflects a deep and wide B2C adoption pattern, similar to what I described in earlier blog analyses of generative AI’s ease of integration and current pricing dynamics. Yet this enthusiasm has not translated into enterprise-scale change. Most large companies have run numerous pilots. Employees use the tools, often enthusiastically, but the ROI remains incremental. For AI to unlock transformational value, enterprises must rethink core operating models, overhaul foundational technology, and redesign critical workflows. Those commitments are substantial, and we simply have not seen firms make them. MORE FOR YOUCIOs Are Locking Down on Preparation, Specifically on Governance, Security, and Vendor Simplification Although enterprises are not yet investing at scale, CIOs and CTOs are far from idle. Across industries, I see three clear patterns of preparation: 1. Building governance and security frameworks Leaders recognize that broad deployment requires rigorous guardrails. This stage mirrors the “last mile” challenges I have written about before, where compliance, security, and organizational alignment become the true bottlenecks to adoption. 2. Developing internal expertise. Companies are building AI fluency through training, small centers of excellence, and targeted hiring. Many are still determining how domain knowledge, functional insight, and prompt engineering will come together in their organizations. 3. Simplifying vendor portfolios. This is perhaps the most significant shift. During the Covid years, shortages of technology talent drove organizations to add vendors rapidly, creating an explosion in supplier portfolios. Today, I see broad, strategic efforts to consolidate these vendors. The motivation is partly cost, but more importantly, enterprises want a simpler, more manageable ecosystem to support AI-driven reinvention. Interestingly, this consolidation is changing market share dynamics. Historically, large low-cost providers were the disproportionate winners. Companies hesitated to shift work to new partners because of risk, and incumbents could defend their footprint. Now the pattern is different: firms are prioritizing capability over scale. Providers positioned around advanced operating models and AI transformation are gaining share, while specialist firms with deep expertise increasingly win work over traditional incumbents. These trends echo the broader shifts we have seen in how Global In-House Centers (GICs) and service providers compete on capability and integration rather than pure labor arbitrage. Why Enterprises Are Still Hesitant to Invest at Scale If preparation is happening everywhere, why is transformation not following? The answer lies in conviction. Companies understand that real value requires deep operating-model change, yet they have not aligned on what that future looks like. Technology teams often look to vendors to deliver innovation, while business lines expect the CIO to bring them fully formed solutions. Meanwhile, vendors themselves are racing to position their AI offerings, but their incentives do not always align with what enterprises truly need. This creates a strategic hesitation: firms want the benefits of AI but are unsure how much to rely on vendors versus internal capabilities, or how to sequence foundational investments that will not",
  "wordCount": 972,
  "author": "Peter Bendor-Samuel",
  "hash": "e6811e5167f606d2",
  "topic": "AI_and_Strategy"
}