{
  "url": "https://www.oliverwyman.com/our-expertise/insights/2024/aug/how-generative-ai-can-transform-retail-stores-key-benefits.html",
  "title": "How Generative AI Can Transform Retail Stores: Key Benefits",
  "snippet": "# Why Generative AI-Powered Stores Are The Future Of Retail. //     Insights  //     Why Generative AI-Powered Stores Are The Future Of Retail. In this article, we explore how generative AI can serve as a catalyst for retailers to operate their stores leaner and more cost-efficiently, while providin",
  "domain": "oliverwyman.com",
  "publishedDate": "2024-07-30",
  "extractedText": "In the dynamic world of retail, generative artificial intelligence (AI) is revolutionizing the game. But can it also revolutionize how retail stores operate? In this article, we explore how generative AI can serve as a catalyst for retailers to operate their stores leaner and more cost-efficiently, while providing store associates with enhanced knowledge and decision support. Furthermore, we believe that generative AI has the potential to fuel new growth for retailers, particularly by improving the customer shopping experience through hyper-personalized offers. Here, we delve into the impact of generative AI on store operations and the workforce, showcasing accessible and ready-to-implement use cases that can generate high impact in these early stages of technology adoption. Two key benefits of generative AI in retail store operations The adoption of generative AI in stores brings forth a twofold benefit: driving cost and productivity improvements and fueling new growth. Together, these benefits create a virtuous cycle that propels businesses forward. 1. AI can drive retil cost and productivity improvements Imagine a store where 40% to 60% of human tasks are automated using AI. First-line managers (such as store managers and shift leaders) believe that 45% of their own jobs could be automated by generative AI, which aligns with various expert views. In contrast, entry-level blue-collar employees think only 36% of their jobs could be automated by AI. However, experts believe the potential for automation in these roles is much higher, in the range of 60% or more. Generative AI acts as a catalyst for efficiency and effectiveness in store operations in the following three areas. Streamlining repetitive tasks of store associates. Generative AI can automate recurring tasks, such as employee labor scheduling, predictive maintenance of store equipment, routine customer inquiries (for instance returns or exchanges), or onboarding of new colleagues, freeing up employees’ time to focus on higher-value activities like customer interaction and sales opportunities.Enabling better and faster decision-making by augmenting (not replacing) human expertise with generative AI “copilots.” For example, generative AI can support associates in answering more complex customer questions or supporting inventory management and production planning decisions.Elevating the role of store management by shifting focus from task execution to validation and action-taking. For example, generative AI can support store and department managers through automated reporting analysis, summary of insights, and action planning based on multiple daily store and department performance reports, alerting compliance issues, flagging waste reduction opportunities, or detecting fraud in stores. 2. AI solutions can fuel new retail growth New growth is driven mainly by three types of generative AI solutions. Solutions that support store associates in better serving customers, for example by using generative AI copilots to help answer basic or more complex customer questions (for instance, “Help me find a healthy cereal option for kids under $5.”)Reallocating time freed up by generative AI solutions, for example time savings from automating repetitive tasks and supporting decision-making can be invested in activities highly valued by customers.End-customer-directed sales and profitability-driving generative AI solutions, for example: Hyper-personalized customer outreach, such as promotions and product recommendations, leveraging data at scale for improved relevance; offering unique services like meal inspiration and planning through AI copilots; or redirecting increased productivity toward innovation, particularly in merchandising and marketing functions. Solutions in the last category are primarily driven by leveraging generative AI in upstream functions, such as marketing and merchandizing, and are less prevalent in the hands of store operators. However, as we take an end-to-end view of the impact of generative AI on omni-channel shopping, we did not want to miss mentioning these opportunities in this article. Our most recent research shows that consumers’ interest in user-facing AI solutions is currently limited. This is particularly driven by concerns around data privacy issues. Personalized promotions, however, are an area of high interest and where generative AI can unlock material benefits. Despite limited interest, retailers should still find value in exploring generative AI solutions and building capabilities because, at some point, customers will be interested. How generative AI can boost productivity and empower store workers Imagine equipping every store associate with a tool that amplifies their capabilities. That’s the promise of generative AI. Unlike traditional large language models (LLMs), generative AI is accessible for the masses, easy, and user-friendly. Implementing generative AI into stores does not require over-engineered change management",
  "wordCount": 1370,
  "hash": "edfe7737f6dfafb1",
  "topic": "AI_and_Strategy"
}