{
  "url": "https://www.cmu.edu/tepper/news/stories/2025/0602-ai-driven-personalized-pricing-may-not-help-consumers",
  "title": "AI-Driven Personalized Pricing May Not Help Consumers | Tepper School of Business",
  "snippet": "“We examined the effects of personalized and unpersonalized ranking systems on algorithmic pricing outcomes and consumer welfare,” explains Param Vir Singh, Carnegie Bosch Professor of Business Technologies and Marketing and Associate Dean for Research the Tepper School of Business, who coauthored t",
  "domain": "cmu.edu",
  "publishedDate": "2025-06-02T18:24:08-04:00",
  "extractedText": "Tepper School of Business / News / Stories / AI-Driven Personalized Pricing May Not Help Consumers In This Section About Our Leadership Our History Engagement Building The Intelligent Future: Strategic Plan Nobel Laureates Tepper Quad Alumni Alumni Board Awards Events Giving Lifelong Learning Career Resources Team Contacts Chapters and Programs Regional Groups Executive Education Custom Programs Programs for Individuals Certificate in Executive Leadership FAQ Faculty and Research Academic Areas Artificial Intelligence Conferences and Seminars Faculty Profiles Support Faculty Research Programs Undergraduate Programs MBA MS in Business Analytics MS in Management MS in Product Management MS in Computational Finance Masters Admissions Graduate Student Support Services Doctoral Programs Recruiting & Corporate Engagement Hire Our Talent Partner with the Tepper School Jun 02, 2025 AI-Driven Personalized Pricing May Not Help Consumers Media Inquiries Caitlin Kizielewicz Email ckiz@andrew.cmu.edu Phone 412-554-0074 The autonomous nature and adaptability of artificial intelligence (AI)-powered pricing algorithms make them attractive for optimizing pricing strategies in dynamic market environments. However, certain pricing algorithms may learn to engage in tacit collusion in competitive scenarios, resulting in overly competitive prices and potentially harmful consequences for consumer welfare. This has prompted policymakers and scholars to emphasize the importance of designing rules to promote competitive behavior in marketplaces.In a new study in Marketing Science, researchers at Carnegie Mellon University investigated the role of product ranking systems on e-commerce platforms in influencing the ability of certain pricing algorithms to charge higher prices. The study’s findings suggest that even absent price discrimination, personalized ranking systems may not benefit consumers.“We examined the effects of personalized and unpersonalized ranking systems on algorithmic pricing outcomes and consumer welfare,” explains Param Vir Singh, Carnegie Bosch Professor of Business Technologies and Marketing and Associate Dean for Research the Tepper School of Business, who coauthored the study.Because of the number of options available, online consumers face a difficult, time-consuming search process. This has led to the emergence of online search intermediaries (e.g., Amazon, Expedia, Yelp), which use algorithms to rank and provide consumers with ordered lists of third-party sellers’ products in response to their queries. These intermediaries reduce search costs and boost consumer welfare by helping consumers find suitable products more efficiently.In this study, researchers examined two extreme scenarios of product ranking systems that differed in how they incorporated consumer information for generating product rankings. The first system, personalized ranking, used detailed consumer information to rank products based on predicted utility for each individual. The second, called unpersonalized ranking, relied solely on aggregate information across the entire population, resulting in an inability to customize the rankings for individual consumers.Researchers used a consumer demand model characterized by search behavior, in which consumers searched sequentially to learn about the utilities they could obtain from various products. In this model, the ranking algorithm suggested by the intermediary affects the order in which consumers evaluate products, with each evaluation incurring a search cost. Consumers engage in optimal search and purchase behavior to maximize their utility. Hence, an intermediary's specific ranking system can steer demand in different ways, which have important implications for pricing outcomes.“We compared these two systems to provide a clear understanding of the pricing implications of personalization in ranking technologies, specifically reinforcement learning (RL) algorithms, for AI-powered pricing algorithms,” says Liying Qiu, a Ph.D. student at Carnegie Mellon’s Tepper School, who led the study.“Studying RL pricing algorithms in the context of realistic consumer behavior models is challenging due to the complexity of the dynamics they create, but by setting up controlled simulated environments, we were able to examine how these algorithms evolve and interact over time experimentally,” notes Yan Huang, Associate Professor of Business Technologies at Carnegie Mellon’s Tepper School, who coauthored the study.Personalized ranking systems, which rank products in decreasing order of consumers’ utilities, may encourage higher prices charged by pricing algorithms, especially when consumers search for products sequentially on a third-party platform. This is because personalized ranking significantly reduces the ranking-mediated price elasticity of demand and thus incentives to lower prices.Conversely, unpersonalized ranking systems lead to significantly lower prices and greater consumer welfare. These findings s",
  "wordCount": 940,
  "hash": "f17aed163c7e0a78",
  "topic": "AI_and_Strategy"
}