{
  "url": "https://www.cnbc.com/2025/12/23/holiday-retail-spending-visa-report-2025.html",
  "title": "Visa says holiday spending rose 4.2% via AI, tech and apparel growth",
  "snippet": "U.S. holiday retail spending increased 4.2% year over year, not adjusted for inflation, according to preliminary data from Visa.",
  "domain": "cnbc.com",
  "publishedDate": "2025-12-23T12:00:01.000Z",
  "publishedDateInvalid": false,
  "extractedText": "RetailHoliday retail spending rose 4.2% this season, driven by e-commerce and electronics: Visa reportPublished Tue, Dec 23 20257:00 AM ESTUpdated Tue, Dec 23 20258:00 AM ESTLuke Fountain@Luke_Fountain25WATCH LIVEKey PointsU.S. holiday retail spending increased 4.2% year over year, not adjusted for inflation, according to preliminary data from Visa.E-commerce spending jumped 7.8%, though physical stores still captured nearly three-quarters of all spending.Electronics saw a 5.8% surge, which Visa attributed to consumer demand for high performance devices in a new AI era.In this articleVFollow your favorite stocksCREATE FREE ACCOUNTwatch nowVIDEO3:2303:23There's certainly a lot of bifurcation going on in consumer spending, says Visa's Michael BrownSquawk BoxU.S. consumers showed resilience this holiday season, driving retail spending up 4.2% year over year, according to preliminary data released Tuesday by Visa.The report from Visa Consulting and Analytics indicated that despite lingering economic headwinds, shoppers were still spending, particularly on technology and personal goods. The findings tracked payments activity over a seven-week period beginning Nov. 1 using a subset of Visa payments network data in the U.S. and cover core retail categories, excluding spending on automotive, gasoline and restaurants. The figures are also not adjusted for inflation.In-store shopping accounted for the bulk of holiday spending, capturing 73% of total retail payment volume during the period, while online purchases made up the remaining 27%. However, e-commerce was the primary driver of growth, with online sales rising 7.8% compared with last year, reflecting continued demand for convenience and early-season promotions.\"The underlying surprise here ... is that consumer spending is holding up reasonably well in light of softer consumer confidence than we had this time last year and a number of headwinds and concerns about inflation,\" Michael Brown, principal U.S. economist at Visa, told CNBC.Brown noted that the 2025 holiday season marked a distinct shift in consumer behavior, citing the growing influence of artificial intelligence in how shoppers find products and compare prices. \"We are seeing consumers use AI in a big way in comparison shopping and then helping to narrow down that perfect gift,\" Brown said. \"This is the first holiday shopping season where roughly half of the consumers in that survey responded that they are going to leverage AI for one of those two tasks.\"Read moreAI tools could drive $263 billion in holiday sales. Walmart and Target are racing to get inConsumers are feeling gloomy about the economy. Here's why they're spending anywaySupplements in your stocking: Why wellness gifts are gaining steam for the holidays and beyondThe breakdown of spending categories highlights a shift toward personal goods and convenience, and away from home renovation projects.Electronics emerged as the season's top-performing category, with sales climbing 5.8%. Visa attributed this jump to a refresh cycle driven by \"high-performance devices in the AI era.\"Apparel and accessories also posted strong numbers, rising 5.3%. General merchandise stores — retailers that offer a \"one-stop\" experience — saw a 3.7% lift.Conversely, the home improvement sector struggled during the holidays. Spending on building materials and garden equipment fell 1%, suggesting consumers prioritized gift-giving and gadgets over home maintenance as the year closed out. Furniture and home furnishings remained essentially flat, eking out a 0.8% gain.While the headline number is positive for the retail sector, the lack of inflation adjustment means the \"real\" volume growth will likely be more modest depending on the final Consumer Price Index readings for the period. Currently, Brown said, real spending growth adjusted for inflation is still up about 2.2% this season. \"That's not too bad in light of a lot of uncertainty this year,\" Brown said. \"The consumer is uncertain, they're cautious, but they're also smart about how they're spending their money.\"Visa's numbers also point to a disconnect between sentiment and action this season. According to the CNBC All-America Economic Survey released last week, 41% of Americans said they planned to spend less for the holidays this year, 6 points higher than a year ago.The CNBC survey found that the high cost of goods was emerging as a major factor in determining how much shoppers spend and where they spend, suggesting yearslong inflation and the rise in import goods prices from tariffs are being felt at checkout.",
  "wordCount": 685,
  "author": "Luke Fountain",
  "hash": "f28509a2890cbbc6",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-17T21:23:24.573Z",
  "sourceType": "discovery"
}