{
  "url": "https://techcrunch.com/2025/09/04/fashion-retailers-partner-to-offer-personalized-ai-styling-tool-ella/",
  "title": "Fashion platform Vivrelle partners with luxury retailers to offer personalized AI styling tool 'Ella' | TechCrunch",
  "snippet": "Fashion platform Vivrelle partners with luxury retailers to offer personalized AI styling tool 'Ella' · Google announces a new protocol to",
  "domain": "techcrunch.com",
  "publishedDate": "2025-09-04T12:45:00-07:00",
  "extractedText": "The luxury membership platform Vivrelle, which allows customers to rent high-end goods, announced Thursday the launch of an AI personal styling tool called Ella as part of its partnership with fashion retailers Revolve and FWRD. The launch is an example of how the fashion industry is leveraging AI technology to enhance customer experiences and is one of the first partnerships to see three retailers come together to offer a personalized AI experience. Revolve and FWRD let users shop designer clothing, while Revolve also has an option to shop pre-owned. The tool, Ella, provides recommendations to customers across the three retailers on what to purchase or rent to make an outfit come to life. For example, users can ask for “a bachelorette weekend outfit,” or “what to pack for a trip,” and the technology will search across the Vivrelle, FWRD, and Revolve shopping platforms to create outfit suggestions. Users can then check out in one cart on Vivrelle. In theory, the more one uses Ella, the better its suggestions become. It’s the fashion equivalent of asking ChatGPT what to wear in Miami for a girl’s weekend. Image Credits:Vivrelle Blake Geffen, the CEO and co-founder of Vivrelle (which announced a $62 million Series C earlier this year), told TechCrunch that she hopes Ella can take the “stress out of packing for a vacation or everyday dressing. “Ella has been in the works for quite some time,” she told TechCrunch, adding that it took about a year to build and release the product. This is actually the second AI tool from the three companies. The Vivrelle, Revolve, and FWRD partnership earlier this year also launched Complete the Look, which offers last-minute fashion suggestions to complement what’s in a customer’s cart at checkout. Their latest tool, Ella, however, takes the fashion recommendation game to another level. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Fashion has been obsessed with trying to make personalized shopping happen for decades now. Even the 90s movie “Clueless” showed Cher picking outfits from her digitized wardrobe. This current AI boom has led to rapid innovation and democratized access to AI technology, allowing many fashion companies to launch personalized AI fashion platforms and raise millions while doing so. “With Ella, we’re giving our members as much flexibility and options as possible to shop or borrow with ease, through seamless conversations that allow you to share as little or as much as you want, just like talking to a live stylist,” Geffen said. “We’re excited to be the first brand to integrate rental, resale, and retail into one streamlined omnichannel experience.” Topics AI, AI, Fashion Dominic-Madori Davis Senior Reporter, Venture Dominic-Madori Davis is a senior venture capital and startup reporter at TechCrunch. She is based in New York City. You can contact or verify outreach from Dominic by emailing dominic.davis@techcrunch.com or via encrypted message at +1 646 831-7565 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker This is Uber’s new robotaxi from Lucid and Nuro Sean O'Kane Lego Smart Bricks introduce a new way to build — and they don’t require screens Amanda Silberling Hacktivist deletes white supremacist websites live onstage during hacker conference Lorenzo Franceschi-Bicchierai",
  "wordCount": 771,
  "author": "Dominic-Madori Davis",
  "hash": "03691e1a90e67c5d"
}