{
  "url": "https://techcrunch.com/2023/08/21/dipp/",
  "title": "Dipp uses AI to fix bottlenecks between marketing and design teams | TechCrunch",
  "snippet": "Dipp was launched three years ago to automate workflow and allow marketing and design teams to collaborate more effectively.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-08-21T20:38:40-07:00",
  "extractedText": "Before founding dipp, Jennifer Chen and Mikhail Abramov spent 15 years working as art directors in New York City. During that time, Chen says they realized that the marketing, sales and design process has stayed the same, despite new technology and tools being introduced to the market, and is often riddled with bottlenecks. “Salespeople have sales needs, they communicate with the marketing team and then once the marketing team has a direction, they brief a designer, then the designer goes back to the marketer, and then the marketer goes back to the designer,” she said. “There’s that vicious cycle that slows down the entire process because nobody understands the needs and workflow of the other department.” Dipp was launched three years ago to automate much of that workflow and allow marketing and design teams to collaborate more effectively, while focusing on their own performance metrics. For example, if a marketing team wants to update a price on their ad, all they need to do is enter it into a spreadsheet instead of asking a designer. The Taipei-based startup recently raised $1.5 million in seed funding from investors, including SparkLabs Taiwan, Palm Drive Capital and content-tech unicorn Tezign, and will launch generative AI–powered features soon. To use dipp, brands first set up a brand guideline with information such as fonts, colors and layout (or they can upload an Adobe Photoshop file). That data is then turned into a dipp file with everything remaining editable. Then prices and other information for ads are uploaded into a spreadsheet, with each row representing a product, so visual assets can be edited in batches. This helps marketing and design teams keep up with the massive amount of visual content that is needed to sell online — Chen said brands typically generate 300 to 500 images at a time, which dipp can help them do in minutes. Dipp’s team. Image Credits: dipp The brands dipp works with are typically Fortune 500 companies in apparel and beauty selling a large number of products, or upward of 500 SKUs. They have high product rotation rates, often with weekly launches of 20 or more products, and sell on three or more marketplaces, alongside social media advertising campaigns. Chen says most have large sales and marketing teams, but a shortage of designers. Its customers include Levi’s, Estée Lauder and Rakuten. Dipp also works with e-commerce enablers, or agencies that help brands distribute products across multiple channels. Since its launch, dipp has primarily focused on Taiwan but is expanding into Southeast Asia, with new clients in Singapore, the Philippines and Thailand. Dipp started in New York, but the team decided to move to Taiwan after getting into Taipei-based accelerator AppWorks because of the market potential it saw in Asia. For example, brands here hold a high number of sales promotions. “Throughout the year, it’s not just Black Friday or Christmas; there’s a sale every month,” Chen said. “There’s a busy season starting in June that goes all the way to Chinese New Year.” Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW In terms of competition, Chen says potential customers often ask how dipp is different from Rocketium, which helps creative teams build very large marketing campaigns. Chen says dipp differentiates by focusing on e-commerce because brands in Asia often sell through multiple online channels at the same time, including PC Home, Momo, Shopee and Lazada. Each marketplace has its own unique guidelines for visual content, including file sizes and dimensions. That information is embedded into dipp’s platform, so brands can automate their ads to fit different requirements. Dipp is now working on integrating generative AI into its platform to help address gaps between marketing and design departments. For example, it will allow marketers to use prompts to generate images as a first draft of ideas to present to designers. It also automates the process of reviewing designs, or checking details like character limit and formatting to meet the requirements of different marketplaces a",
  "wordCount": 1277,
  "author": "Catherine Shu",
  "hash": "06b0e4d11410706d"
}