{
  "url": "https://techcrunch.com/2026/01/09/anthropic-adds-allianz-to-growing-list-of-enterprise-wins/",
  "title": "Anthropic adds Allianz to growing list of enterprise wins | TechCrunch",
  "snippet": "Companies like Google, Amazon, Walmart, and OpenAI have been releasing new standards and products to infuse AI into every bit of shopping, both",
  "domain": "techcrunch.com",
  "publishedDate": "2026-01-09T01:00:00-08:00",
  "extractedText": "AI research lab Anthropic continues to land sizable enterprise deals. Its latest entails bringing its large language models to a legacy German insurance giant. Anthropic on Friday announced a deal with Munich, Germany-based global insurance conglomerate Allianz to bring “responsible AI” to the insurance industry. The parties declined to share financial terms of the deal. The partnership is made up of three specific initiatives. The first is making Claude Code, Anthropic’s AI-powered coding tool, available to all of Allianz’s employees. Anthropic and Allianz will also build custom AI agents for Allianz employees that can execute multistep workflows with a human in the loop. This partnership also includes an AI system that logs all AI interactions to keep the AI transparent and ensure that information is readily available for regulatory or other needs. “With this partnership, Allianz is taking a decisive step to address critical AI challenges in insurance,” Oliver Bäte, CEO of Allianz SE, said in the company’s press release. “Anthropic’s focus on safety and transparency complements our strong dedication to customer excellence and stakeholder trust. Together, we are building solutions that prioritize what matters most to our customers while setting new standards for innovation and resilience.” This is just the latest enterprise deal Anthropic has landed in recent months. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW In December, the company inked a $200 million deal to bring its AI models to data cloud company Snowflake and its customers. Shortly after, it announced a multi-year partnership with the consulting firm Accenture. In October, it signed a deal with consulting firm Deloitte to bring its Claude chatbot to the firm’s 500,000 employees. That same month, Anthropic signed a deal with IBM to bring its AI models into the latter’s products. The race for AI enterprise dominance is clearly on, and Anthropic appears to be winning — so far at least. Anthropic holds 40% of enterprise AI market share, according to a December survey from Anthropic investor Menlo Ventures, and 54% of the market share for AI coding. Anthropic market share increased throughout last year. When Menlo’s original survey came out in July, the company held a 32% market share for overall enterprise LLM use. Google launched its dedicated enterprise AI product, Gemini Enterprise, in October. At the time, the company touted that the product suite already had customers, including fintech Klarna, design software company Figma, and cruise line operator Virgin Voyages, among others. OpenAI launched its enterprise version of ChatGPT, ChatGPT Enterprise, in 2023. Recently, the company reportedly expressed deep concern in an internal memo that Google Gemini’s success was starting to encroach on its business. Shortly after, the company released a report that said enterprise use of ChatGPT had surged 8x in the past year. A recent TechCrunch investor survey found that enterprise-focused VCs overwhelmingly think that 2026 will be the year that enterprises start to see a meaningful return on their investment into AI products. While Anthropic seems to be a clear favorite at the moment, this year will likely be telling of what the enterprise AI market — and its competitive landscape — will look like in the future. Topics AI, allianz, Anthropic, ChatGPT, Enterprise, Enterprise AI, gemini, Germany, OpenAI, United States Rebecca Szkutak Senior Reporter, Venture Becca is a senior writer at TechCrunch that covers venture capital trends and startups. She previously covered the same beat for Forbes and the Venture Capital Journal. You can contact or verify outreach from Becca by emailing rebecca.szkutak@techcrunch.com. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so",
  "wordCount": 870,
  "author": "Rebecca Szkutak",
  "hash": "075ff8479ab0a55b"
}