{
  "url": "https://techcrunch.com/2024/01/16/fancy-founder-returns-with-1000-per-month-luxury-shopping-startup-long-story-short/",
  "title": "Fancy founder returns with $1,000-per-month luxury shopping startup, Long Story Short | TechCrunch",
  "snippet": "Google is now also allowing merchants to integrate an AI-powered Business Agent within their websites to answer customer questions. The company",
  "domain": "techcrunch.com",
  "publishedDate": "2024-01-16T11:46:48-08:00",
  "extractedText": "A new luxury goods e-commerce startup dubbed Long Story Short has a provocative concept: it’s $1,000 per month to join for the privilege of shopping its curated collection. Shocking as that sounds, founder Joseph Einhorn believes he understands this sliver of the e-commerce market, and why many online luxury ventures to date have failed to work. The founder, known best for his 2010s e-commerce site The Fancy, an upscale shoppable Pinterest rival, says high-net-worth individuals demand more in terms of privacy and security from their online experience — something that shopping a luxury marketplace often does not provide. At Long Story Short, the private shopping club takes a different approach than other shopping sites. In addition to simply needing to have the funds to pay its $1,000 per month fee, potential customers must apply for acceptance. Once in, the customers can shop from the site’s 50,000 hand-selected luxury products, spanning categories like home décor, luxury apparel, art, cards, jewelry, watches, gadgets, and more, or they can request the LSS (Long Story Short) team to procure items on their behalf. Image Credits: Long Story ShortImage Credits:Long Story Short The value proposition — if such a word can be used for such a costly service — is that LSS will manage the transaction on the customer’s behalf. That means negotiating with vendors and sellers, acquiring the item, then inspecting and verifying the item for authenticity, before shipping it to the buyer. This allows the customer’s transactions to remain anonymous to the seller — something that’s prized among high-net-worth individuals due to the security risks involved with having their name, address, or phone number compromised. While LSS will have this information, Einhorn’s experience in e-commerce means he’s already familiar with the world of online fraud and how to combat it and has built the new company with an eye on privacy. The company won’t detail its security practices so as to not invite hackers but notes that it trades security for convenience in some cases by not collecting or storing anything but necessary info. In addition, some of its systems aren’t even connected to the web. Image Credits: Long Story ShortImage Credits:Long Story Short The concept of a private shopping club is something that Einhorn likens to other efforts in catering to high-net-worth individuals, as with Pharrell’s launch of his own auction house last year, Joopiter. And, similar to offline luxury retail, LSS aims to provide the white-glove service that luxury shoppers expect. Plus, Einhorn argues that subscribing to LSS makes sense for anyone already spending at least $1,000 per month on luxury goods because of the savings it delivers. Today’s online marketplaces are often heavily marketing up their items, which means people are paying “at least $1,000” by being overcharged on “marketplace waste,” he argues. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW “Number one, we’re recommending you items — you can see items that you probably didn’t know about that you can get involved in. And then, number two, let us get the best possible price, rather than just logging on somewhere everybody is being drawn into the same kind of marked-up overpriced item,” Einhorn explains. He believes that the combination of eliminating the marketplace fees and establishing direct relationships with vendors and sellers, LSS’s savings could reduce the cost of luxury items by 20% to 40%. However, his thesis has not yet been tested, as the site is only now launching. “What we hope is that by having this collective buying power of serious spenders — like serious shoppers — that we as a group will unlock better terms for everybody,” Einhorn says. LSS, meanwhile, doesn’t mark up the items itself nor charge any other fees beyond the (pricey) subscription. Image Credits: Long Story Short (user profile)Image Credits:Long Story Short (user profile) Still, Einhorn understands this business model will turn some heads, particularly in the current economic climate where housing prices are so high,",
  "wordCount": 1679,
  "author": "Sarah Perez",
  "hash": "0950185d2d6a0b33"
}