{
  "url": "https://hbr.org/2025/11/the-ai-tools-that-are-transforming-market-research",
  "title": "The AI Tools That Are Transforming Market ResearchHarvard Business Review LogoHarvard Business Review LogoHarvard Business Review LogoHarvard Business Review Logo",
  "snippet": "Generative AI is rapidly reshaping market research by enabling the creation of “synthetic personas” and “digital twins”—AI-generated proxies",
  "domain": "hbr.org",
  "publishedDate": "2025-11-17T13:15:33.000+00:00",
  "extractedText": "Harvard Business Review LogoMarketingThe AI Tools That Are Transforming Market Research by Jeremy Korst, Stefano Puntoni and Olivier ToubiaNovember 17, 2025HBR Staff/Tara Moore/Getty ImagesPostPostShareSaveBuy CopiesPrintSummary. Leer en españolLer em portuguêsPostPostShareSaveBuy CopiesPrintCustom market research has always been notoriously slow and costly to conduct, often requiring many months and significant investments. As a result, marketers have made many strategic decisions without the benefit of timely external insights. But as we argued in our recent HBR article, “How Gen AI is Transforming Market Research,” gen AI is transforming the collection, creation, and analysis of consumer and market insights—the lifeblood of strategic marketing. We’re not alone in making that argument: Since our article’s publication, for example, both Andreesen Horowitz and Foundation Capital have published investment theses predicting that gen AI will dramatically transform the $140 billion global market-research industry.Jeremy Korst is the founder of Mindspan Labs, an AI-transformation consultancy and incubator. He previously held senior executive roles at Microsoft and T-Mobile. He also serves as partner at GBK Collective, which provides strategic insights to global brands. He is a co-author of the Wharton School’s annual study on enterprise AI adoption.SPStefano Puntoni is a professor of marketing at the University of Pennsylvania’s Wharton School and is the co-director of Wharton Human-AI Research. He is one of the leading behavioral scientists studying the business applications of AI.OTOlivier Toubia is a professor of marketing at Columbia Business School and a recognized leader in the field of quantitative marketing.PostPostShareSaveBuy CopiesPrintRead more on Marketing or related topics Generative AI, Market research, Consumer behavior, Experimentation, Disruptive innovation, AI and machine learning, Market segmentation, Data management and Analytics and data science",
  "wordCount": 270,
  "hash": "0bb1f3bedbd33eac"
}