{
  "url": "https://techcrunch.com/2025/11/25/openai-and-perplexity-are-launching-ai-shopping-assistants-but-competing-startups-arent-sweating-it/",
  "title": "OpenAI and Perplexity are launching AI shopping assistants, but competing startups aren't sweating it | TechCrunch",
  "snippet": "Startup founders building AI shopping tools think general-purpose models are too broad to deliver truly personalized shopping experiences.",
  "domain": "techcrunch.com",
  "publishedDate": "2025-11-25T11:35:06-08:00",
  "extractedText": "With holiday shopping on the horizon, OpenAI and Perplexity both announced AI shopping features this week, which integrate into their existing chatbots to help users research potential purchases. The tools are markedly similar to one another. OpenAI suggests that users could ask ChatGPT for help finding a “new laptop suitable for gaming under $1000 with a screen that’s over 15 inches,” or they can share photos of a high-end garment and ask for something similar at a lower price point. Perplexity, meanwhile, is playing up how its chatbot’s memory can augment shopping-related searches for its users, suggesting that someone could ask for recommendations tailored to what the chatbot already knows about them, like where they live or what they do for work. Adobe predicted that AI-assisted online shopping will grow by 520% this holiday season, which could be a boon for AI shopping startups like Phia, Cherry, or Deft (rebranded as Onton) — but with OpenAI and Perplexity pushing further into AI shopping experiences, are these startups in danger? Zach Hudson, CEO of the interior design shopping tool Onton, thinks that AI shopping startups with a specialized niche will still provide a better experience to users than general-purpose tools like ChatGPT and Perplexity. “Any model or knowledge graph is only as good as its data sources,” Hudson told TechCrunch. “Right now, ChatGPT and LLM-based tools like Perplexity piggyback off existing search indexes like Bing or Google. That makes them really only as good as the first few results that come back from those indexes.” (Perplexity noted to TechCrunch that it has its own search index.) Daydream CEO and longtime e-commerce executive Julie Bornstein agrees — she remarked to TechCrunch over the summer that she always viewed search as “the forgotten child” of the fashion industry, since it never worked particularly well. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW “Fashion … is uniquely nuanced and emotional — finding a dress you love is not the same as finding a television,” Bornstein told TechCrunch on Tuesday. “That level of understanding for fashion shopping comes from domain-specific data and merchandising logic that grasps silhouettes, fabrics, occasions, and how people build outfits over time.” AI shopping startups develop their own datasets so that their tools are trained on higher-quality data — something that’s easier to achieve when you’re attempting to catalog fashion or furniture, rather than the sum of all human knowledge. In Hudson’s case, Onton developed a data pipeline to catalog hundreds of thousands of interior design products in a cleaner manner, helping to train its internal models with better data. But if AI shopping startups don’t pursue that level of specialization, Hudson thinks they’re bound to be overshadowed. “If you’re using only off-the-shelf LLMs and a conversational interface, it’s very hard to see how a startup can compete with the larger companies,” Hudson said. The advantage for OpenAI and Perplexity, however, is that their customers are already using their tools — plus, their large presence lets them ink deals with major retailers from the get-go. While Daydream and Phia redirect customers to retailers’ websites to complete their purchases — sometimes earning affiliate revenue — OpenAI and Perplexity have partnerships with Shopify and PayPal, respectively, allowing users to check out within the conversational interface. These companies, which depend on mammoth amounts of expensive compute power to operate, are still trying to figure out a path to profitability. If they take inspiration from Google and Amazon, then it makes sense to look toward e-commerce as an option — retailers could pay them to advertise their products within search results. But eventually, that could just exacerbate the existing issues that customers have with search. “Vertical models — whether in fashion, travel, or home goods — will outperform because they’re tuned to real consumer decision-making,” Bornstein said. Additional reporting by Ivan Mehta. Updated 11/26/25, 11:30 ",
  "wordCount": 1056,
  "author": "Amanda Silberling",
  "hash": "0e3813ef4ac6077b"
}