{
  "url": "https://techcrunch.com/2023/09/13/amazon-debuts-generative-ai-tools-that-helps-sellers-write-product-descriptions/",
  "title": "Amazon debuts generative AI tools that helps sellers write product descriptions | TechCrunch",
  "snippet": "Amazon today introduced a new set of generative AI tools aimed at sellers which the retailer says will simplify the process of creating product listings.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-09-13T06:43:46-07:00",
  "extractedText": "Amazon today introduced a new set of generative AI tools aimed at sellers which the retailer says will simplify the process of creating product listings. The retail giant claims these new capabilities are designed to help sellers generate “captivating product descriptions, titles, and listing details.” Sellers will also be able to add to their existing product descriptions using AI, instead of having to start from scratch. The AI tools were built using large language models, or LLMs, that were trained on large amounts of data. Though Amazon doesn’t specifically say, it seems that the retailer likely scoured its own listing data to train its machine learning models. Previously, Amazon had used machine learning and deep learning techniques to extract and enrich product information, but the new generation AI capabilities builds on that technology. “With our new generative AI models, we can infer, improve, and enrich product knowledge at an unprecedented scale and with dramatic improvement in quality, performance, and efficiency,” explained Robert Tekiela, vice president of Amazon Selection and Catalog Systems, in a statement. “Our models learn to infer product information through the diverse sources of information, latent knowledge, and logical reasoning that they learn. For example, they can infer a table is round if specifications list a diameter or infer the collar style of a shirt from its image.” Amazon claims that its generative AI tools will help sellers save time and allow customers to find more complete product information, but there are some concerns around using generative AI models at such scale, given their ability to “hallucinate” — or create false information not based on real data. The tools could also potentially contain other mistakes that aren’t caught if a human doesn’t review the output. And if the tools end up creating incorrect product listings and descriptions, Amazon could be held liable — particularly if it doesn’t disclose the listing was created using AI. The Information previously reported Amazon was piloting generative AI tools for content, noting that the tool warns sellers to double-check the content to ensure it complies with Amazon’s listing guidelines. The company had declined to answer questions about the LLMs it was using for the new tool, the report had said. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Amazon is not the only retailer to turn to generative AI to make the process of creating product listings easier. eBay announced last week the launch of a generative AI tool that could generate product listings from photos. Earlier this summer, Shopify announced its own ChatGPT-like sidekick for its e-commerce merchants designed to understand and interpret questions or prompts related to business decision-making, and create content like blog posts, campaign ideas and customer emails, among other things. eBay rolls out a tool that generates product listings from photos Topics AI, AI, Amazon, Artificial Intelligence (AI), Commerce, Generative AI Sarah Perez Consumer News Editor Sarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software. You can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads gui",
  "wordCount": 990,
  "author": "Sarah Perez",
  "hash": "0ea4cdb2a4848f61"
}