{
  "url": "https://techcrunch.com/2023/10/26/social-commerce-meta-ai-brand-messaging/",
  "title": "Stealthy social commerce startup taps into Meta roots to create AI-first brand messaging | TechCrunch",
  "snippet": "Nectar AI will help brands find new ways to personally engage and convert consumers where they spend the most time.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-10-26T09:02:09-07:00",
  "extractedText": "With consumer focus being pulled in lots of directions these days, it’s that much harder for brands to capture attention for longer than the average scroll on social media. At the same time, purchases made via social platforms are poised to reach nearly $3 trillion, globally, by 2026. Nectar AI wants to provide direct-to-consumer and e-commerce brands with an easier way to connect with consumers. The social commerce platform was started by sisters Misbah Uraizee and Farah Uraizee, who saw this problem firsthand while both worked at Meta. Misbah was building AI-based conversational and monetization tools for businesses and consumers, while Farah was building out products on the Facebook Community and Groups side. “We were building these products to encourage people to spend more time within Meta’s ecosystem, and what we realized quickly was that the products were Band-Aids at best,” Misbah Uraizee told TechCrunch. “There’s a super-strong trend that we were seeing, especially from Gen Z, of a gravitational pull toward private messaging. Messaging has exploded in the last five years.” As evidence of this trend, Uraizee pointed to a recent interview of Adam Mosseri, head of Instagram, who said that much of the growth and time spent on Meta’s apps were within the Stories and direct messaging features. That’s why the Nectar AI team says brands need to find new ways to personally engage and convert consumers where they spend the most time. The company enables D2C and e-commerce companies to swap out the half-dozen tools they use now for Nectar’s AI-generated messaging tool that uses large language models and retrieval-augmented generation, to connect at scale, Farah Uraizee said in an interview. The company joins other companies catering to e-commerce, for example, SuperOrdinary, Loup (formerly Social Chat) and Rebuy. Where the Uraizees say Nectar AI stands out is in its personalization tech, including identity mapping from social to commerce profiles of customers, and that proprietary commerce focused LLM that brands can deploy wherever they interact with customers. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW If all this sounds great, you’ll have to wait a bit before you can try it. The founders still consider Nectar AI pretty stealthy — its product is in beta and they are not likely to offer it to the public until “sometime mid next year,” according to Misbah Uraizee. To fuel that launch, the company recently closed on $2 million in pre-seed funding in a round. It was led by Flying Fish Ventures’ Heather Gorham and included BAM Ventures, Trust Fund’s Sophia Amoruso, XRC Ventures, Fab Ventures, Yale Index Ventures, CMDN, Dash VC and a group of angel investors, including Jennifer Dulski. Nectar AI will initially target mid-sized fashion and beauty brands that manage thousands of comments across their social media channels. The new capital will help expand its engineering and AI teams. “Our sweet spot is brands that have a decent amount of engagement across their social platforms and that are investing heavily across these platforms for their organic and paid campaigns,” Misbah Uraizee said. “They have a huge burning problem around this, and now we’re trying to balance how brands across the funnel receive Nectar.” Embracing digital commerce may be retailers’ best bet for staying ahead of a fast-moving industry Topics Commerce, e-commerce, Farah Uraizee, Misbah Uraizee, Nectar AI, social commerce, Startups, Venture Christine Hall Senior Reporter Christine Hall wrote about enterprise/B2B, e-commerce, and foodtech for TechCrunch, and venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the build",
  "wordCount": 1062,
  "author": "Christine Hall",
  "hash": "13198b82427f130a"
}