{
  "url": "https://techcrunch.com/2020/10/05/the-little-black-door-app-makes-luxury-wardrobes-shareable-resalable-and-sustainable/",
  "title": "The Little Black Door app makes luxury wardrobes shareable, resalable and sustainable | TechCrunch",
  "snippet": "Users add items to their virtual wardrobe, which then employs image recognition AI and natural language processing to figure out what the item",
  "domain": "techcrunch.com",
  "publishedDate": "2020-10-05T05:59:10-07:00",
  "extractedText": "When Lexi Willetts and Marina Pengilly realized they could make as much as £30,000 a year reselling their luxury clothes and accessories online, they resolved to create a solution for modern women who are already well-versed in the behaviors of Instagram and the sharing economy. Their solution, Little Black Door, has just gone live on the iOS store, and allows women to see, style and share their wardrobes with friends and followers. It also connects them to resale platforms, unlocking a vastly more environmental-friendly and sustainable way to shop for high-quality fashion. And with the COVID-19 pandemic hitting the fashion world, the app is set to benefit, as consumers head to the re-sale of luxury, rather than new items. As Willetts puts it: “This started as a response to our own bad wardrobe behaviors. Our overbuying often because we forgot what we had, often thinking to buy rather than borrow from friends. Plus, we saw the headache of creating resale listings. Realizing that so much of our interactions were online, thus producing very rich e-receipt data, we set about thinking how we could make use of that to create better wardrobe engagement and reduce our overbuying of irrelevant, cheap fashion.” The problem with platforms like this has always been: how to digitize the wardrobe in the first place. Most people can’t be bothered to go to the trouble. But this app takes a fresh approach. It concentrates on using wardrobe purchase data and leveraging social sharing behavior to more easily create a digital wardrobe. It also allows the wardrobe to be connected with retail, making it far easier to start the resale journey of selling unwanted items. The resulting LBD app appears at first to be a sort of “Instagram and Depop” mashup. Users add items to their virtual wardrobe, which then employs image recognition AI and natural language processing to figure out what the item is, and tries to categorize it as well. It checks with the user if something is a t-shirt, black, short sleeve, minimalism, urban casual, etc. before it’s confirmed into the wardrobe. Walmart partners with fashion consignment marketplace thredUP Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW But perhaps more interestingly, the LBD app will ingest receipts of items purchased via email. This means the wardrobe can be built up from new or existing data the user already has. Once the wardrobe is built inside the app, the user can see the clothes and categories, their total wardrobe spend, and create “lookbooks” which they can share with friends and followers to comment on. Friends can then borrow items or users can send items to resale via the “swipe to sell” feature. Most other wardrobe apps haven’t created a “viral loop” whereby the user is incentivized to use the app daily. LBD has added social features to create a community-driven platform that is almost like an “Instagram for fashion”. Previous “wardrobe apps” like this have obsessed over whether the app can recognize clothes or not, but most don’t work well. The better use of AI, as LBD has realized, is to use receipts data and purchase histories, plus retail partner links, to add to wardrobes. This means the wardrobe upload feature isn’t the primary focus, as it is trumped by wardrobe item data. It’s on this basis that they can create more useful and — crucially — playful features. “We’ve designed features to entertain and engage the user relating to their wardrobe. We create ease of sharing with friends, tapping into the sharing economy mindset… Moreover, the app is designed to build a culture of conscious consumption, encouraging users to buy less ‘fast fashion’, invest in quality pieces and wear and share the contents of their closets,” says Willetts. So the app is interesting, but what about the business model? Effectively, LBD is creating a data play around women’s wardrobes. They could use the data to create advertising for relevant and sustainable brands; partnerships with retailers; value-added services; a resale platform with commissions; verified sellers; and a premium version for hig",
  "wordCount": 1513,
  "author": "Mike Butcher",
  "hash": "15b4486a882c4ade"
}