{
  "url": "https://techcrunch.com/2013/08/26/gilt-launches-personalized-sales-because-personalization-is-where-its-at/",
  "title": "Gilt Launches Personalized Sales, Because Personalization Is Where It's At | TechCrunch",
  "snippet": "The algorithm-powered feature, aptly called “Your Personal Sale,” culls and presents the best sales for each user based on factors like their",
  "domain": "techcrunch.com",
  "publishedDate": "2013-08-26T09:33:47-07:00",
  "extractedText": "Personalization seems to be the name of the game in e-commerce right now, and to that end, the luxury flash sales site Gilt has just added a user-specific sales page to their offerings. The algorithm-powered feature, aptly called “Your Personal Sale,” culls and presents the best sales for each user based on factors like their purchase history, geographic location, and browsing behavior. It’s a step beyond the daily emails that Gilt shoppers receive, which already tailor content to the user. It also represents a continued investment in the flash sale model, which other sites like Fab have not been able to sustain. “We’re fully invested in flash. Flash is all about the daily visit,” Gilt CIO Steve Jacobs told us. “We’re investing more in the flash model by creating an every day sale that’s new. People are coming back more frequently, and they’re excited to see what’s in their sale tomorrow.” For users who do check the site daily, a personalized sale roster could be helpful as a way to assess their options quickly, especially given how easy it is to miss a flash sale. And, of course, showing people items that they’re predisposed to like is an easy way to get them buying and coming back for more. E-commerce personalization often blends into the woodwork, taking the form of sidebar recommendations and ads on Facebook showing items similar to the one I bought one from that retailer last week. Gilt’s “Your Personal Sale” turns it into the main event and a destination. “Your Personal Sale” is launching for womenswear and menswear today, with home and kids categories to follow. Gilt is also at work on another personalized sale feature, which will likely go live in a few months’ time. Topics TC Eliza Brooke Associate Editor Eliza Brooke is an associate editor at Fashionista. Having interned at T, The New York Times Style Magazine during college, she got her first job reporting on tech at TechCrunch, where she snuck in as much fashion coverage as she possibly could, before landing at Fashionista, where she sneaks in as much tech coverage as she can. She lives in Brooklyn. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW This is Uber’s new robotaxi from Lucid and Nuro Sean O'Kane Lego Smart Bricks introduce a new way to build — and they don’t require screens Amanda Silberling Hacktivist deletes white supremacist websites live onstage during hacker conference Lorenzo Franceschi-Bicchierai",
  "wordCount": 657,
  "author": "Eliza Brooke",
  "hash": "19ad9c7c7a3c7dbe"
}