{
  "url": "https://techcrunch.com/2023/10/04/walmart-experiments-with-new-generative-ai-tools-that-can-help-you-plan-a-party-or-decorate-a-space/",
  "title": "Walmart experiments with generative AI tools that can help you plan a party or decorate | TechCrunch",
  "snippet": "The retail giant is experimenting with generative AI to help shoppers in all stages of the shopping experience, from the search and discovery phase to making a",
  "domain": "techcrunch.com",
  "publishedDate": "2023-10-04T13:20:36-07:00",
  "extractedText": "After launching a generative AI tool for corporate employees in August, Walmart is bringing the technology to its customers. During a demo with TechCrunch, a company spokesperson outlined how the retail giant is experimenting with generative AI to help shoppers in all stages of the shopping experience, from the search and discovery phase to making a purchase. Three features coming down the pipeline include a shopping assistant, generative AI-powered search and an interior design feature. Walmart declined to share which AI models it’s using to develop these features, but says it’s using a variety of different external models and they may change over time. “Other companies are essentially locking themselves into working with Anthropic or OpenAI,” the spokesperson told us. “We want to have that flexibility to put in and out different models.” Image Credits: Walmart The new shopping assistant — which is launching in the coming weeks — will allow customers to have a more interactive and conversational experience as it can answer specific questions, provide personalized product suggestions and share detailed information about a certain product. For instance, it can give shoppers Halloween costume ideas to wear to a horror-themed party or which cell phone a parent should buy for their child. Similarly, users will soon be able to enter specific questions directly in the search bar. With the use of generative AI, Walmart’s search tool can understand context and generate a collection of items relevant to one query. For example, if a customer wants to plan for a unicorn-themed birthday, the AI displays a wide array of products such as balloons, paper napkins, streamers and so on. Instead of having to type in numerous separate searches, Walmart’s new AI search tool is designed to save customers time. We also see this being done by other companies like Instacart, which recently rolled out a ChatGPT-powered search tool that can generate suggestions like a selection of high-protein foods or Thanksgiving dinner ideas. Plus, Meta announced a new Bing-backed AI Assistant last month as well as an AI personality chatbot, among other tools. Image Credits: Walmart Walmart is also developing an interior design assistant for customers to decorate their rooms. In addition to generative AI, the feature also leverages AR technology; users must upload a photo of a room and it will then take an image capture of every item that’s in the space. Customers ask the chat assistant for advice on how they should redecorate, and the AI places items in the room that they suggest. Users can express their opinions on which items they want to keep or buy. The AI also asks for a budget so it can find items that are affordable. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW The continued investment in generative AI tools is a common theme these days as more companies rush to integrate the technology into their products and services. “Generative AI technology is a priority for the company,” said the Walmart spokesperson. The new tools come on the heels of Walmart rolling out its AI app, “My Assistant,” to 50,000 corporate employees in the U.S. to streamline tasks like summarizing documents, helping prep for meetings and speeding up projects. Walmart has been getting “great feedback” about the app and even found some employees using the assistant to draft “funny out-of-office messages,” the spokesperson added. Topics AI, Artificial Intelligence (AI), Commerce, e-commerce, Generative AI, online shopping, Walmart Lauren Forristal Lauren covers media, streaming, apps and platforms at TechCrunch. You can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The mo",
  "wordCount": 1045,
  "author": "Lauren Forristal",
  "hash": "1a7aa0acd521bb9a"
}