{
  "url": "https://techcrunch.com/2023/02/24/rebuy-commerce-personalization-series-a/",
  "title": "Rebuy is out to change the customer buying experience, one personalization at a time | TechCrunch",
  "snippet": "Merchants can create personalized shopping experiences for their customers through upsells, cross-sells and post-purchase follow-ups.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-02-24T07:01:49-08:00",
  "extractedText": "The number of Shopify live websites grew a whopping 201% between March 2020 and January 2022 with the shift to e-commerce during the global pandemic. With all of those stores going after customers it’s difficult for individual merchants to cut through the clutter. That problem has given rise to startups eager to offer their no-code or low-code technology to help Shopify merchants build their businesses. For example, we saw Replo for landing pages, Triple Whale for shopper data, Postscript for personalized texting, Shop Circle to find the best apps to get a Shopify business going and Popup for online storefronts. In addition, all of those companies raised venture capital the past year for those respective tools. Minneapolis-based Rebuy is the latest commerce tech startup to attract new funding, in its case a $17 million Series A, to advance its premier personalization platform for online retailers. The round was led by M13, with Dynamism Capital, R-Squared Ventures and existing investors Peterson Ventures and Sidekick Partners joining in. Ben Jabbawy of Privy and Nik Sharma also came on as strategic investors. This follows a $4.4 million seed round in 2021, led by Peterson Ventures. Rebuy, founded in 2017 by brothers John Erck and James Van Erck, has an end-to-end SaaS offering for e-commerce — Shopify merchants in particular — that combines artificial intelligence with no-code or low-code technology. Merchants can then create personalized shopping experiences for their customers through upsells, cross-sells and post-purchase follow-ups. For example, to help notify customers that they get free shipping when they spend $100 or more, how to provide gifts with purchase or understand that to convert a user requires helping them discover the right product. Replo gives businesses a low-code option for creating Shopify landing pages Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW It also provides data and AI intelligence to recommend ways to increase the average order value, improve the shopping cart and checkout processes, or help customers take a page from Amazon by recommending complementary products. James Van Erck told TechCrunch that there’s been a shift in how direct-to-consumer brands conduct themselves and how to expand their businesses. “With the iOS changes, it’s been harder and harder to track customers,” he said. “A year or two ago, brands were very focused on acquiring new customers. Now there’s been this shift around focusing more on your existing customers and helping to give them a much better experience. That’s what Rebuy is out to do: help create these intelligent shopping experiences.” That shift to existing customers validated what Rebuy had been working on over the past six years: generating smart product recommendations, John Erck said. He added that the company’s technology is currently running on close to 7,000 online stores, including 10% of all Shopify Plus merchants. In the past 12 months, the company tripled its revenue, released 218 new products or feature enhancements and launched integrations with e-commerce solutions, including Klaviyo and Attentive. Erck also said Rebuy was “well into the eight-figure annual recurring revenue stage.” In addition, the company more than doubled its customer count over the last year and currently serves more than 4 billion web requests per month, over 1 billion of which are behavioral analytics streaming into its AI engine. The company intends to deploy the new funds into technology development, investing in the Shopify ecosystem and additional hiring to complement its 70-employee workforce. One of the new hires is Jason Nelson, senior vice president of revenue. It is also interested in pursuing a multi-platform future so that any brand can use Rebuy independent of what platform they choose to run on. Additional investment will also go into new products, including Rebuy Search, Rebuy Intelligence Graph and Visual Editor. One of the first coming out is Rebuy Search, which Erck described as “the one piece that can have an outsized influence on us upselling, cro",
  "wordCount": 1353,
  "author": "Christine Hall",
  "hash": "1ab2fd0556f2fa0a"
}