{
  "url": "https://techcrunch.com/2024/10/16/long-careers-in-luxury-fashion-led-to-a-17m-raise-for-this-supply-chain-platform/",
  "title": "Long careers in luxury fashion led to a $17M raise for this supply chain platform | TechCrunch",
  "snippet": "An AI to help you sleep better​​ The company launched Sleep Patterns within its app in November to help customers understand how long and well",
  "domain": "techcrunch.com",
  "publishedDate": "2024-10-16T02:35:22-07:00",
  "extractedText": "The retail sector needs inventory planning to maintain margins and meet demand. This is getting harder because there are now many distribution channels, more complex supply chains, and shorter sales cycles. Mid-market retailers and premium brands have less firepower than the retail giants and tend to rely on legacy software. Founded in 2020, Autone aims to forecast demand, and aid sales, while cutting waste and manual tasks. The company has now raised a $17 million Series A funding round, led by General Catalyst. Previous investors also participated, including Speedinvest, Y Combinator, Seedcamp, 2100 Ventures, Motier, Financière Saint James, and angels from LVMH, Sephora, and Moncler. The new funding takes the total raised for the company to $20 million, including a $3 million seed round led by Speedinvest. Its competitors include Anaplan, Blue Yonder, and Relex. Born and raised in Paris, Autone co-founder and CEO Adil Bouhdadi (pictured above, right) first got into sneaker culture in the early 2000s. Later, he wanted to enter the luxury fashion business, but with few connections, he decided to incessantly refresh the LVMH career website until an internship at Givenchy came up. He ended up spending six months shadowing the CEO. After a Masters’ Degree in 2013, he got a break at Alexander Wang in New York, moved to Victoria Beckham in London, and joined Alexander McQueen in 2015. While there, Bouhdadi and colleague Harry Glucksmann-Cheslaw (now Autone CTO) both worked on an internal inventory platform which, they claim, helped the brand’s revenue increase substantially over the following five years. The co-founders are a Muslim and Jewish pairing. Bouhdadi comes from a Muslim family (his parents moved to Paris from Morocco) and his co-founder comes from a Jewish family who moved to the U.K. to escape the Holocaust. Bouhdadi (now CEO) told TechCrunch: “At Alexander McQueen we realized everyone in the company was just literally using Excel. The biggest pain point for any retail company is that they all operate in silos. We created the alpha version to Autone there.” Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW He said Autone can now look at a retail brand’s products in the next 12 months: “You can purchase raw materials in one month instead of three, reduce the inventory risk, and have a variable supply chain.” Autone now counts companies such as Courreges, Roberto Cavalli, Stussy, and Zadig&Voltaire amongst its customer. Topics Autone, Commerce, Enterprise, General Catalyst, TC Mike Butcher Editor At Large Mike Butcher (M.B.E.), formerly Editor-at-large of TechCrunch, has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder of TheEuropas.com (Top 100 listing of European startups); and the non-profits Techfugees.com, TechVets.co, and Startup Coalition. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-gener",
  "wordCount": 863,
  "author": "Mike Butcher",
  "hash": "1d09479293a908bf"
}