{
  "url": "https://techcrunch.com/2023/12/22/how-simplifying-the-production-of-customized-merchandise-led-this-lisbon-startup-to-raise-19m/",
  "title": "How simplifying the production of customized merchandise led this Lisbon startup to raise $19M | TechCrunch",
  "snippet": "As consumers increasingly rely on chatbots and automated agents to search for and compare products, Kuruvilla said brands will need software",
  "domain": "techcrunch.com",
  "publishedDate": "2023-12-22T01:00:59-08:00",
  "extractedText": "The advent of the internet combined with the ability to customize items such as clothing long ago created a revolution in marketing, especially for merchandise purposes. I think we’re all familiar with the “merch” phenomena by now, no? Benefiting from that long-term trend is SME-focused, customized merchandise startup Bizay, which has been able to raise a significant funding round, even in this relatively flat market of 2023. Following a Series C of $38.6 million (€32 million), which I reported on in 2020, the Lisbon, Portugal-based startup has now raised a Series “C2” (not yet a full series D) of €18 million ($19.78 million) in order to push into the U.S. market. The round was led by previous lead investor Indico Capital Partners, which was once again joined by fellow Portugal investors Iberis Capital and Lince Capital. That takes Bizay’s total funding to €72 million ($79 million), though, when asked what they think the company’s valuation is now, a spokesperson demurred. However, outside observers may well surmise a valuation of anywhere between $180-$220 million at this point. Suffice it to say, it’s not entirely surprising that customer merchandise continues to do well. Companies love to send out brand merch, and because of technological advances, the market just gets easier to serve. The global custom apparel market size (that’s clothing only) was valued at over $48 billion in 2022 and is expected to expand to $70 billion by 2028. Customized T-shirts alone are projected to be worth more than $3 billion in 2025. Bizay says its “special sauce” is a supply chain system for product customization which combines merchandising, packaging, apparel and a wide range of product customization, and has managed to ram down the costs and up the number of product categories it can serve — even down to customized company-barded watches, if that’s your thing. Over a call, Bizay co-founder Jose Salgado told me: “We see an increasing trend for customization across many different segments. It’s a way for them to self-express.” And Salgado says if, for instance, the Texas Broncos want 50,000 customized T-shirts, the company has “invested a lot of effort.” Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW “We are able to be competitive for small quantities, but also for medium or large quantities. We’ve done an extensive work into R&D, understanding how to scale. This is about industrial production. There are huge setup costs. What we enable our suppliers to do within the same job is to be producing several orders at the same time. With that, there’s a huge, huge cost saving.” He points out that the company has “no factories, no machines, no stocks” but is instead enabling a fairly complex value chain to deliver products: “We can have the three production suppliers within the same value chain because for each of those steps, we choose the best supplier. So there’s a really big optimization of the supply chain,” he told me. It’s clear there’s an e-commerce opportunity not just for SMEs. What’s also partly going on out there is an explosion in the creative economy, where — for instance— influencers are hooking up their various social platforms to customized merchandise platforms in order to, frankly, make some damn money. Consider that earlier this year the #TikTokMadeMeBuyIt hashtag had over 71 billion views — it’s clear influencer marketing is alive and well. Indeed, fans of the Sheffield band Bring Me The Horizon can purchase personalized BMTH t-shirts by simply connecting their Spotify account or e-mail to the band’s merchandise website. Bizay is of course often competing with the numerous print-on-demand shops out there, from Printful to Printify, Gelato, Gooten and Art of Where. The question is, how does one distinguish between these myriad players. Salgado counters that these companies focus on a single technology and says many of them are vertically integrated, and thus dependent on the production they have in house: “We can go deeper on the options that we have on each of the products, and are independent on the quantity and on",
  "wordCount": 1462,
  "author": "Mike Butcher",
  "hash": "205818831e39b99f"
}