{
  "url": "https://techcrunch.com/events/tc-disrupt-2025/partners/",
  "title": "Partners - Disrupt 2025 | TechCrunch",
  "snippet": "Build global teams with the leading AI-powered platform built on a decade of local knowledge and compliance expertise. DuploCloud simplifies DevOps with AI-powered automation, providing end-to-end infrastructure, security, and compliance solutions for startups and scaling companies, accelerating tim",
  "domain": "techcrunch.com",
  "extractedText": "TechCrunch Disrupt 2025 Mobile Menu Toggle Overview Tickets Investor Pass Founder Pass Speakers Agenda Side Events Partners Partner Sessions More Volunteer Startup Battlefield Exhibit Hotel Attendee Portal Disrupt 2025 Partners From pre-event engagement to on-site activations and post-event follow-ups, TechCrunch offers dynamic ways for partners to connect with attendees. Reach out to explore how your company can get involved. Get in Touch Meet our Disrupt partners Platinum The Aerospace Corporation The Aerospace Corporation is the nonprofit operator of a federally funded research and development center that provides technical leadership and innovation across the national space enterprise. With over 4,600 employees at labs and locations across the country, Aerospace is the government’s and industry’s most trusted partner on the hardest problems in space. Bright Data Bright Data is the industry-leading web data platform. Fortune 500 companies, industry leaders and small businesses all rely on Bright Data's DaaS (Data as a Service) solutions to retrieve the public web data they care about, in the most efficient, reliable and flexible manner. With 20,000+ customers across almost every industry, Bright Data products include a range of no-code data collection solutions, ready-made datasets, and a robust infrastructure used by engineers and IT professionals, covering every aspect of the web data collection space. Epic Aircraft, LLC Epic Aircraft is revolutionizing aviation with the newly certified E1000 AX—the world's fastest single-engine turboprop. Built in Bend, Oregon, Epic leverages AI across design, certification, and support to accelerate development and outperform legacy manufacturers. From engineering to predictive maintenance, Epic proves that a lean, tech-forward team can reshape a traditionally slow-moving industry. Discover how this aviation startup uses smart automation to scale, innovate, and lead. Greenfield Partners Greenfield Partners is an early growth-stage venture firm investing in disruptive technology and tech-enabled businesses worldwide. The firm manages over $1 billion across its portfolio, which includes companies such as Torq, Vast Data, BigPanda, and Coralogix. Greenfield applies its proprietary Greenfield Growth Momentum (G2M) playbooks to help companies implement best-in‑class go-to-market strategies and accelerate their path to global scale. Israel Innovation Authority Israel is a global leader in innovation, boasting the highest startup density worldwide and over 500 multinational R&D centers. At the heart of this ecosystem is the Israel Innovation Authority, Israel’s national innovation fund. As the country’s largest investor in early-stage tech, its flagship Startup Fund operates as Israel’s largest venture capital vehicle, empowering breakthrough ideas from inception and propelling ecosystem-wide growth. The Authority drives national innovation strategy, investing in disruptive Deep Tech, AI, quantum computing, climate-tech, and more. Through matched funding, risk mitigation, and global partnerships, it fuels competitiveness and productivity. Its success-based model rewards boldness, making it a key ally for forward-looking investors. JetBrains JetBrains creates intelligent software development tools trusted by over 15 million users and 88 Fortune Global Top 100 companies. Its lineup of more than 30 products includes award-winning IDEs like IntelliJ IDEA and PyCharm, as well as JetBrains AI-powered coding assistant, coding agent Junie, and productivity-boosting team tools like YouTrack, Qodana, and TeamCity. JetBrains is also the creator of Kotlin, a cross-platform language used by more than 2.5 million developers a year, worldwide. The company is headquartered in Amsterdam, the Netherlands, and has offices around the world. For more information, please visit https://www.jetbrains.com/. Mercury Mercury offers powerful banking,* credit cards, and financial software to over 200K ambitious companies. Mercury believes banking should do more than hold money — it should help you perform at your highest level. Visit mercury.com to learn more. *Mercury is a financial technology company, not a bank. Banking services provided by Choice Financial Group, Column, N.A., and Evolve Bank & Trust, Members FDIC. The IO Card is issued by Patriot Bank, Member FDIC, pursuant to a license from Mastercard. Pebl Pebl puts a world of talent at your fingertips. Build global teams with the leading AI-powered platform built on a decade of local knowledge and compliance expertise. Pebl helps you hire, pay, and manage employees in 185+ countries—removing risk, red tape, and guesswork from global growth. Scale Venture Partners Scale Venture Partners is an early-stage venture capital firm focused on intelligent business software. With a twenty-year track record of success, Scale has helped companies like Box, Bill.com, HubSpot, DocuSign, JFrog, and WalkMe transform from founder-led growth to a repeatable, sca",
  "wordCount": 7925,
  "hash": "23b3bba14b071804"
}