{
  "url": "https://techcrunch.com/2025/10/06/adobe-predicts-ai-assisted-online-shopping-to-grow-520-during-the-2025-u-s-holiday-season/",
  "title": "Adobe predicts AI-assisted online shopping to grow 520% during the 2025 US holiday season | TechCrunch",
  "snippet": "Notably, Adobe predicts that generative AI-powered shopping will boom this year, with AI traffic set to rise by 520% year-over-year and peaking",
  "domain": "techcrunch.com",
  "publishedDate": "2025-10-06T08:39:44-07:00",
  "extractedText": "The U.S. holiday shopping season is expected to bring in $253.4 billion in online sales this year, up 5.3% year-over-year, according to a new report from Adobe’s e-commerce connected division, Adobe Analytics. Adobe Analytics develops its predictions by analyzing over 1 trillion visits to U.S. retail sites, encompassing 100 million SKUs across 18 product categories. Its analytics software is used by a majority of the U.S.’s top 100 online retailers, giving it deep insights into online shopping and consumer behavior. The company forecasts that Cyber Monday will again be the biggest shopping day of the year, up 6.3% year-over-year to reach $14.2 billion. Black Friday will also see higher growth, up 8.3% year-over-year to hit $11.7 billion. U.S. consumers on Thanksgiving Day are also expected to spend $6.4 billion online, up 4.9% year-over-year, as online sales start early. Driving the sales this holiday season will be consumer demand for discounts, where products are expected to be 28% off listed prices. Other trends like shopping from mobile devices, the use of AI services to shop, and buy now, pay later services are other factors behind the rise in online sales. Notably, Adobe predicts that generative AI-powered shopping will boom this year, with AI traffic set to rise by 520% year-over-year and peaking in the 10 days leading up to Thanksgiving. This follows the 1,300% increase in AI traffic to U.S. retail sites seen in 2024. The company expects consumers to largely use AI for research ahead of purchases, based on a survey of 5,000 U.S. consumers — 53% of whom said they may use AI services for this purpose. The survey also found that 40% said they would use AI for recommendations, 36% for deal finding, and 30% for gift inspiration. Adobe expects AI to be used most across categories like toys, electronics, jewelry, and personal care. Another trend expected this year involves mobile devices once again driving more online spend compared with desktop shopping, reaching a record 56.1% share. Last year, mobile accounted for 54.5% of the online transactions during this period, up from 51.1% in 2023. It’s unclear when the mobile growth will taper off and stabilize, especially given the larger-screened smartphone devices available on the market, which make it easier to shop online. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW The 2025 holiday shopping will also see further growth of buy now, pay later (BNPL) services, which are expected to drive $20.2 billion in online spend, up 11% year-over-year, and around $2 billion more than the 2024 holiday season. Cyber Monday is also expected to see a new BNPL milestone, when online spend in this category is expected to reach $1.04 billion, up 5% year-over-year. Social media will also drive more online sales this year. Social media advertising is expected to drive a 51% year-over-year increase in online revenue, up from 5% year-over-year growth in 2024. Top categories for spending overall include electronics ($57.5 billion, up 4% YoY), apparel ($47.6 billion, up 4.4% YoY), and furniture ($31.1 billion, up 6.5% YoY). Topics Adobe, Adobe Analytics, AI, Commerce, e-commerce, online shopping, shopping Sarah Perez Consumer News Editor Sarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software. You can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant ",
  "wordCount": 875,
  "author": "Sarah Perez",
  "hash": "240e988d921a4f86"
}