{
  "url": "https://techcrunch.com/2023/12/04/mastercard-launches-shopping-muse-an-ai-powered-shopping-assistant/",
  "title": "Mastercard launches Shopping Muse, an AI-powered shopping assistant | TechCrunch",
  "snippet": "Mastercard is launching a new generative AI shopping tool called “Shopping Muse” that is designed to help users get personalized product recommendations.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-12-04T12:41:41-08:00",
  "extractedText": "Mastercard is launching a new generative AI shopping tool called “Shopping Muse” that is designed to help users get personalized product recommendations. The tool is powered by Dynamic Yield, a personalization company that was acquired by Mastercard in April 2022. Mastercard says the idea behind Shopping Muse is to “revolutionize how customers search for and discover products in a retailer’s digital catalogue.” The tool can take users’ colloquial language and turn it into tailored product recommendations. Shopping Muse is able to understand modern trends and phrases like “cottagecore” or “beach formal.” You can ask the tool questions like “What should I wear for a summer wedding?” or “Can you recommend pieces for a minimalist capsule wardrobe?” In order to provide personalized recommendations, Shopping Muse looks at the context of the user’s shopping experience, the direct question(s) it is being asked and the content of the conversation. The algorithms use data from the retailer’s product catalog, along with the shopper’s on-site behavior, such as clicking certain products and adding products to carts. The algorithms also look at real-time and known preferences the consumer demonstrates. If a user is logged-in, the algorithms may consider their past purchase and browsing history with that retailer, including any purchases made in-person that they connected to their account by providing the cashier their phone number or email, for example. Image Credits: Mastercard In addition to being able to help users search by phrase, Shopping Muse can also recommend items even when the user can’t find the words to describe what they’re looking for. Mastercard explains that “using integrated advanced image recognition tools, retailers can recommend relevant products based on visual similarities to others, even if they lack the right technical tags.” Although fashion is the first use case for Mastercard’s new tool, the company says this technology could extend into other categories, like furniture and grocery. “Personalization gives people the shopping experiences they want, and AI-driven innovation is the key to unlocking immersive and tailored online shopping,” said Ori Bauer, the CEO of Dynamic Yield by Mastercard, in a statement. “By harnessing the power of generative AI in Shopping Muse, we’re meeting the consumer’s standards and making shopping smarter and more seamless than ever.” Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Mastercard says that retailers must adapt to changing demands by embracing technology, noting that more than one in four retailers already use generative AI solutions, while another 13% plan to adopt them in the next year. The new tool is one of many generative AI shopping tools released in the past year. For instance, Google now lets users receive AI-generated gift recommendations on Search, while Microsoft’s Bing can automatically generate buying guides when you use a query like “college supplies.” We’ll likely see more similar tools in the future, as Gartner recently released a report that predicts that 80% of customer service and support organizations will be applying generative AI technology in some form by 2025. Topics AI, AI, Commerce, mastercard, shopping Aisha Malik Consumer News Reporter Aisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University. You can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pu",
  "wordCount": 1011,
  "author": "Aisha Malik",
  "hash": "2d9dcd2cc25760e6"
}