{
  "url": "https://techcrunch.com/2025/07/14/prime-day-event-drove-over-24b-in-u-s-e-commerce-sales-gen-ai-traffic-was-up-3300/",
  "title": "Prime Day event drove over $24B in US e-commerce sales, GenAI traffic was up 3,300% | TechCrunch",
  "snippet": "According to a post-Prime Day analysis by Adobe Analytics, GenAI traffic to U.S. retail sites increased by 3,300% year-over-year — which was",
  "domain": "techcrunch.com",
  "publishedDate": "2025-07-14T09:44:41-07:00",
  "extractedText": "Amazon’s Prime Day, which leads to an overall boost to U.S. e-commerce thanks to competitive sales, saw a significant increase in retail traffic driven by generative AI products, including chatbots and browsers. According to a post-Prime Day analysis by Adobe Analytics, GenAI traffic to U.S. retail sites increased by 3,300% year-over-year — which was more than the firm had originally forecast. Adobe’s e-commerce division provided an analysis of the U.S. retail landscape encompassing over 1 trillion visits to U.S. retail websites, including 100 million SKUs across 18 product categories. During the Amazon Prime Day event (July 8-11), U.S. retailers saw $24.1 billion in online spend, representing 30.3% year-over-year growth, or the equivalent of two Black Fridays. (Black Friday 2024 saw $10.8 billion in online spend, which was then a new benchmark for the holiday shopping event.) The actual results from the firm’s Prime Day analysis came in slightly higher than its estimates, which predicted $23.8 billion would be spent with U.S. e-commerce retailers over the four-day period, representing 28.4% year-over-year growth. As a result, the figures for the use of GenAI driving online shopping were higher as well, indicating increased consumer interest in using generative AI-powered chat services and browsers as online shopping assistants. However, this AI-driven traffic still remains much smaller than other channels like email or paid search, Adobe noted. Paid search, for example, accounted for a 28.5% share of U.S. e-commerce sales during the Prime Day event, up 5.6% year-over-year. Another growing channel for driving retail clicks this year involved social media influencers, who drove 19.9% of U.S. online retail sales during the event. That figure was up 15% year-over-year, and data indicated that influencers converted shoppers into making purchases 10 times more effectively than social media overall. Amazon didn’t share specific Prime Day figures, only saying that it was the biggest event ever with record sales and more items sold than before. However, the company also expanded Prime Day to a four-day event this year, making comparisons to prior years difficult. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW According to one third-party analysis from Momentum Commerce, reported by Adweek, Prime Day sales during its first two days were initially down 35% year-over-year, then increased by day three to be up 165% year-over-year. This suggests that shoppers may have been waiting until the later sale days to see if their items would receive deeper discounts. Adobe noted that top categories driving U.S. e-commerce sales during the Prime Day event this year included appliances, where online sales were up 112%, compared to average daily sales in June. Other categories that saw strong growth included office supplies (up 105%), electronics (up 95%), books (up 81%), tools and home improvement (up 76%), home and garden (up 58%), and baby and toddler (up 55%). Topics AI, Amazon, Commerce, commerce, gen ai, prime day, TC Sarah Perez Consumer News Editor Sarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software. You can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker p",
  "wordCount": 835,
  "author": "Sarah Perez",
  "hash": "32d7ddee223f32f1"
}