{
  "url": "https://www.digitalcommerce360.com/2024/11/18/october-2024-online-retail-sales/",
  "title": "October online retail sales lead category growth",
  "snippet": "NRF data shows total retail sales increased 0.74% compared to September 2024 as well as 4.13% compared to October 2023. In September, total",
  "domain": "digitalcommerce360.com",
  "publishedDate": "2024-11-18T18:00:23+00:00",
  "extractedText": "Online and nonstore sales growth picked up the pace in October, according to both advance estimates from the U.S. Census Bureau and the National Retail Federation’s Retail Monitor and CNBC. CNBC and NRF’s Retail Monitor exclude automobile and gasoline from their calculation of total retail sales. Additionally, they identify a calculation for “core” retail sales, which exclude restaurants in addition to automobile dealers and gas stations. “Inflation is mostly limited to services at this point and prices for some retail goods are actually falling,” said Matthew Shay, NRF president and CEO, in a statement. “October sales have set the stage for a good start to the holiday shopping season.” Total retail sales in October 2024 Based on Census Bureau data, total retail sales reached $718.9 billion in October 2024. That’s up 0.4% compared to September 2024, and it’s also up 2.8% compared to October 2023. Although that month-over-month growth rate is stagnant compared to September 2024’s growth over August 2024, the increased year-over-year growth indicates deeper sales gains. NRF did not release a total sales figure. Advance estimates from the U.S. Census Bureau differ slightly, in part because of the Retail Monitor’s exclusions. NRF data shows total retail sales increased 0.74% compared to September 2024 as well as 4.13% compared to October 2023. In September, total retail sales had decreased month over month (0.32%) and increased year over year (0.55%). Similar to October 2024 total retail sales, core retail sales increased 0.83% compared to September 2024 and 4.59% compared to October 2023. In September, core retail sales had shrunk month over month (0.28%) and grown year over year (0.94%). Until that drop in September, there had been seven consecutive months of gains, Shay had said in a statement at the time. Online and nonstore sales in October 2024 Census Bureau data indicates nonstore retailers grew 7% year over year in October. At the same time, Retail Monitor data indicates online and other non-store sales in October 2024 grew 1.84% over September 2024, as well as 19.38% over October 2023. Both month over month and year over year, the growth rate of online and nonstore sales in October outpaced each of the other categories the Retail Monitor tracks. NRF says the Retail Monitor uses actual, anonymized credit and debit card purchase data compiled by Affinity Solutions and does not need to be revised monthly or annually. Sales grew month over month in most categories October 2024 online and other nonstore sales (grew 1.84% month over month) Health and personal care stores (up 1.45%) General merchandise stores (up 0.05%) Grocery and beverage stores (up 0.87%) Building and garden supply stores (up 1.69%) Furniture and home furnishings stores (up 0.58%) Sporting goods, hobby, music and book stores (up 2.7%) Clothing and accessories stores (decreased 0.57%) Electronics and appliance stores (down 0.81%) Sales grew year over year in most categories October 2024 online and other nonstore sales (up 19.38% year over year) Clothing and accessories stores (up 8.56%) Health and personal care stores (up 8.35%) General merchandise stores (up 5.51%) Grocery and beverage stores (up 3.76%) Building and garden supply stores (up 3.12%) Furniture and home furnishings stores (up 1.87%) Electronics and appliance stores (decreased 0.64%) Sporting goods, hobby, music and book stores (down 1.23%) Click here to read last month’s update on U.S. online sales. Do you rank in our databases? Submit your data and we’ll see where you fit in our next ranking update. Sign up Stay on top of the latest developments in the online retail industry. Sign up for a complimentary subscription to Digital Commerce 360 Retail News. Follow us on LinkedIn, X (formerly Twitter), Facebook and YouTube. Be the first to know when Digital Commerce 360 publishes news content. Favorite",
  "wordCount": 621,
  "author": "Abbas Haleem",
  "hash": "34ade0a2750a2b10"
}