{
  "url": "https://hbr.org/podcast/2023/11/why-every-leader-needs-aesthetic-intelligence",
  "title": "Why Every Leader Needs “Aesthetic Intelligence”Navigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuClose menuSearch",
  "snippet": "Brown was formerly a chairman of the luxury goods company LVMH, whose brands include Louis Vuitton, Christian Dior, Sephora, and Hennessy, and she’s also the author of the book, *Aesthetic Intelligence: How to Boost It and Use It in Business and Beyond*. So, when I think of other industries that nev",
  "domain": "hbr.org",
  "publishedDate": "2023-11-01T10:22:36Z",
  "extractedText": "Skip to content Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Latest Magazine Topics Podcasts Store Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Ask AI Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Close menu Search Please enter a search term Submit Suggested Topics Explore HBR Latest The Magazine Podcasts Store Webinars Newsletters Popular Topics Managing Yourself Leadership Strategy Managing Teams Gender Innovation Work-life Balance All Topics For Subscribers Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Subscribe My Account My Library Topic Feeds Orders Account Settings Email Preferences Log Out Sign In Subscribe Latest Podcasts The Magazine Store Webinars Newsletters All Topics Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive My Library Account Settings Log Out Sign In Your Cart Your Shopping Cart is empty. Visit Our Store Guest User Subscriber My Library Topic Feeds Orders Account Settings Email Preferences Log Out Reading List Reading Lists X Share Podcast HBR On Strategy / Episode 30 Why Every Leader Needs “Aesthetic Intelligence” Play Listen | Podcast loading... Go Back 15 seconds Play Go Foward 15 seconds Share All organizations need to hire and train people to think this way. Subscribe: Apple Podcasts Spotify RSS All episodes All episodes Details Transcript November 01, 2023 Do you have good AI? That’s “aesthetic intelligence” — not artificial intelligence. Pauline Brown, former chairman of North America for the luxury goods company LVMH, argues that great leaders need to develop “aesthetic intelligence” to stand out among competitors. They need to understand how their products or services can “elicit true delight.” “When you look at the research, the vast majority of reasons that anyone will buy one product over another is based on how that product or service makes the person feel,” she tells IdeaCast host Alison Beard. In this episode, you’ll learn from companies—like Starbucks, Airbnb, and, of course, Apple—that successfully use aesthetics to set their products apart. You’ll also learn why it’s important for leaders or founders—not customers—to define and maintain a company’s aesthetic principles. Brown is the author of the book Aesthetic Intelligence: How to Boost It and Use It in Business and Beyond. Key episode topics include: strategy, creativity, design thinking, Starbucks, Apple, aesthetics, design, customer centricity, consumer research, competition. HBR On Strategy curates the best case studies and conversations with the world’s top business and management experts, to help you unlock new ways of doing business. New episodes every week. Listen to the full HBR IdeaCast episode: To Truly Delight Customers, You Need Aesthetic Intelligence (2019) Find more episodes of HBR IdeaCast. Discover 100 years of Harvard Business Review articles, case studies, podcasts, and more at HBR.org. HANNAH BATES: Welcome to HBR On Strategy, case studies and conversations with the world’s top business and management experts, hand-selected to help you unlock new ways of doing business. Do you have good A.I.? I’m not talking about technology. I mean aesthetic intelligence. Pauline Brown argues that, in addition to traditional and emotional intelligence, leaders also need to understand good taste. Literally, how services and products stimulate the five senses to spark delight. Brown was formerly a chairman of the luxury goods company LVMH, whose brands include Louis Vuitton, Christian Dior, Sephora, and Hennessy, and she’s also the author of the book, Aesthetic Intelligence: How to Boost It and Use It in Business and Beyond. She says that in today’s crowded marketplace, strong aesthetics set companies apart – and not just in the consumer products and luxury sectors. In this episode, you’ll learn from companies – like Starbucks, AirBnB, and, of course, Apple — that successfully used aesthetics to set their products apart. You’ll also learn why it’s important for leaders or founders – not customers – to define and maintain a company’s aesthetic principles. This episode originally aired on HBR IdeaCast in November 2019. Here it is. ALISON BEARD: Welcome to the HBR IdeaCast from Harvard Business Review. I’m Alison Beard. Trader Joe’s grocery stores, Disney Theme Parks, Veuve Clicquot champagne, Essie nail polish, Aveda shampoo, Airbnb, LEGOs. Apart from being both popular and profitable, what do all of these products and services have in common? Our guest today says that they’re all created with something she calls aesthetic intelligence. Pauline Brown is a former chairman of North America for the luxury good company, LVMH and also previously worked at cosmetic company Estee Lauder. But she’s talking about more ",
  "wordCount": 5314,
  "hash": "34c82a2fb55632d2"
}