{
  "url": "https://techcrunch.com/2023/11/01/google-launches-generative-ai-tools-for-product-imagery-to-u-s-advertisers/",
  "title": "Google launches generative AI tools for product imagery to US advertisers and merchants | TechCrunch",
  "snippet": "Via the new, AI-powered Product Studio, merchants and advertisers will be able to leverage text-to-image AI capabilities to create new product imagery for free.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-11-01T09:30:19-07:00",
  "extractedText": "Following Amazon’s adoption of generative AI for advertisers last week, Google today is launching a set of generative AI product imagery tools for advertisers in the U.S. Via the new, AI-powered Product Studio, merchants and advertisers will be able to leverage text-to-image AI capabilities to create new product imagery for free, simply by typing in a prompt of the image they want to use. The feature can be used for simple tasks, like changing the color of the background behind the product images or making the background a solid color. Or it could be used for something more advanced, like requesting a product be shown in a particular scene. For example, when the company first announced the feature in May, it suggested a skincare company could request seasonal imagery by typing something like a product that was “surrounded by peaches with tropical plants in the background.” Now that same company could request something winter-related, like the product “sitting on snow surrounded by pine branches or pinecones.” Image Credits: Google The generative AI model can also help to improve low-quality images without requiring a reshoot as well as remove a distracting background, Google said. By offering AI imagery capabilities, businesses of all sizes will have the ability to create professional images alongside their ads, without having to spend repeatedly on new photography sessions. We expect the feature will be used to augment the existing product photography a business already has on hand, allowing them to reuse their assets across different campaigns — like seasonal efforts or those centered around some sort of theme — even if it doesn’t replace the initial photoshoot. The feature is being made available to all Merchant Center Next users in the U.S. and the Google and YouTube app on Shopify, Google says. It begins rolling out today. The AI feature launched alongside other new additions for merchants, including a “small business” attribute for Google Search and Maps that will highlight to customers which brands have designed themselves as small businesses. Google said it will automatically add this attribute to some listings based on factors like how many products they offer or how much web traffic they see. However, businesses can also set the attribute or remove it from the Merchant Center or their Business Profile at any time. Image Credits: Google Google says it will also start showing more information to shoppers through the knowledge panel when customers are looking up merchant names on Search. Previously, this panel would share information like the location of the business’s HQ or the number of employees. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Image Credits: Google Now it will also show information like current deals, shipping and return policies, customer service information, and ratings and reviews. Some of this information is already shared with Google via Merchant Center, but will now be augmented with other authoritative information from across the web, the company said. The panel has helped drive over 2.3 billion connections to U.S. businesses per month in 2022, Google noted, including calls, requests for directions, bookings, and reviews. The updated panel will roll out this month. Google introduces Product Studio, a tool that lets merchants create product imagery using generative AI Topics advertisers, AI, AI, Artificial Intelligence (AI), Generative AI, Google Sarah Perez Consumer News Editor Sarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software. You can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industr",
  "wordCount": 1062,
  "author": "Sarah Perez",
  "hash": "368cac6870d49637"
}