{
  "url": "https://techcrunch.com/2024/07/25/luxury-fashion-startup-the-floorr-app-personal-stylists/",
  "title": "Luxury fashion startup The Floorr empowers personal stylists with tools to grow their businesses | TechCrunch",
  "snippet": "The Floorr offers tools for conducting sales, hosting tailored styling sessions, creating mood boards, and engaging in text or voice chats",
  "domain": "techcrunch.com",
  "publishedDate": "2024-07-25T13:16:08-07:00",
  "extractedText": "The Floorr launched earlier this year to shake up the digital styling experience by empowering personal shoppers and stylists to manage and expand their businesses in an increasingly competitive environment. Available on the web and iOS devices, The Floorr offers tools for conducting sales, hosting tailored styling sessions, creating mood boards, and engaging in text or voice chats with clients, all in one place. The company recently introduced a new styling tool called “Styling Sessions,” allowing stylists to create complete outfit looks using products from The Floorr’s marketplace or by uploading images or taking pictures of in-store items on their phones. Additionally, The Floorr formally announced Thursday its $1.7 million pre-seed funding round, backed by Net-a-Porter co-founder and investor Carmen Busquets (who is also an adviser for The Floorr) and Nigora Tokhtabayeva, a jewelry designer and founder of Tabayer. Styling Sessions featureImage Credits:App Store Screenshot Since beginning her career as a sales associate at Harrods in 2000 and later shifting to a leadership role for Net-a-Porter’s personal shopping service, founder Lupe Puerta has witnessed an increasing trend among luxury brands to adopt digital platforms to enhance the one-on-one styling experience. Virtual consultations and online styling services are common nowadays. For instance, companies like Next Level Wardrobe, Thread,and Wishi, among others, offer digital fashion services. Not to mention, the rising popularity of virtual try-on tech, AI-powered style assistants, and subscription boxes (Stitch Fix, Wantable and DailyLook) makes finding curated looks that much easier. Lupe PuertaImage Credits:The Floorr However, digital solutions for personal stylists, especially freelancers, remain relatively limited. “I wanted to create what my community needed in the form of an app by [helping] personal shoppers have the tools to really be agile and create beautiful content in one place and have that instant interaction with customers,” Puerta told TechCrunch. “Instead of creating PDFs, sending screenshots on WhatsApp, or sending an email, [The Floorr] has everything centralized in one place and gives them access to their business and analytics, allowing them to be more entrepreneurial.” Another tool available on the platform is a sales dashboard for stylists, which displays analytics like the total number of clicks, orders, items sold, and weekly/monthly earnings. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Stylists and their clients have access to a wide selection of luxury items, thanks to partnerships with high-end retailers, such as Bergdorf Goodman, Browns, Chloé, Farfetch, Neiman Marcus, Net-a-Porter, Saks and SSense. The company will continue to expand the list. Notably, personal shoppers receive an 80% commission from sales, while The Floorr takes 20%. This is higher than what personal shoppers are estimated to earn in typical retail settings, which varies depending on who you ask (and what products are being sold). The average retail commission rate for apparel is approximately 15%. However, for luxury fashion, the rate is likely lower. Puerta said that, based on her own experience, “In a traditional in-house brand/multi-brand retailer setting, personal shoppers and client-facing staff earn a base salary that will vary depending on their seniority. They may also earn commission, which is likely to be between 0.5% and 2.5% and again will depend on their seniority and the amount of sales they’re generating each month.” The company has onboarded 200 personal shoppers so far. On the consumer-facing side, The Floorr helps customers with a taste for luxury fashion (and the financial resources to indulge in it) to connect with a stylist to handle their shopping needs remotely, eliminating the need for in-person meetings. Customers must be personally invited by a stylist to use the client-focused app. The Floorr’s clientele comprises business professionals and Hollywood celebrities. According to the company, the average order value is $2,500. The",
  "wordCount": 995,
  "author": "Lauren Forristal",
  "hash": "39683b6564438c75"
}