{
  "url": "https://techcrunch.com/2023/03/04/enterprise-saas-companies-continue-to-navigate-a-complex-economic-environment/",
  "title": "Enterprise SaaS companies continue to navigate a complex economic environment | TechCrunch",
  "snippet": "As consumers increasingly rely on chatbots and automated agents to search for and compare products, Kuruvilla said brands will need software",
  "domain": "techcrunch.com",
  "publishedDate": "2023-03-04T09:00:19-08:00",
  "extractedText": "It’s been a tough time for enterprise SaaS companies. These organizations raked in profits and growth during the pandemic when offices shuttered and employees moved en masse to work from home. But as the economy turned last year and more workers returned to the office, their numbers slipped. At the same time, enterprise SaaS companies are dealing with several other major problems that have come together to knock them off their perches. Over the last year, TechCrunch has worked to better understand the current climate for selling software. It’s the most common startup product, and SaaS is the most common business model. So we pay special attention to leading SaaS companies on the public markets, hunting for trends, data and other pieces of information that we can apply to the private markets. A changing economy, shifting investor expectations and other bumps have made the picture of the present-day software market hard to clarify. However, new data is sharpening our perspective. We parsed earnings reports this week from Zoom, Salesforce, Box, Snowflake and Okta. The results were mixed, with some doing better than others. How do enterprise SaaS companies fight the short-term economic turbulence and get to the other side (whenever that may be)? And what do one quarter’s numbers actually mean in the scheme of things? Let’s dig into the data. Economic headwinds blowing hard It’s not your imagination: Companies of all stripes have been facing a challenging backdrop in which to operate. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW The macroeconomic environment started shifting last year. First came inflationary pressures, then came higher interest rates to combat inflation. Suddenly, money wasn’t cheap anymore. For startups, that meant tighter capital and more stunted valuations after years of gaudy (and perhaps unrealistic) numbers. For other companies, as interest rates have risen, it has had a negative impact on borrowing and spending. This was true for everyone, not just enterprise SaaS companies, but they were adversely affected nonetheless. But perhaps the biggest factor influencing the enterprise SaaS downturn has been a massive shift in investor expectations from growth to profitability. Companies with high marketing budgets, like Salesforce, have been under pressure to cut costs. We have seen this manifest itself in a number of ways, the most notable being layoffs. Companies that hired in huge numbers during the pandemic to meet growing demand were suddenly letting people go. Salesforce, the biggest of the enterprise SaaS companies, laid off 10% of its workforce as part of its attempts to cut costs, but it certainly wasn’t alone. As though all of that weren’t enough, there was the war in Ukraine, with Russia subsequently cutting off energy exports to Europe, all combining to put pressure on spending in the EU and generating a cascading impact across businesses. Finally, a strong U.S. dollar has been trouble for companies selling outside of U.S. markets as it has bitten into foreign profits and dragged down revenue growth overall. Ray Wang, founder and principal analyst at Constellation Research, said investors are now not looking at the same metrics in the same way, and the interest rates, in his view, are having the biggest impact. “What’s interesting is that we are no longer focused on fundamentals like we used to, such as market share, earnings growth and profitability. The public markets are only focused on Fed rates,” Wang told TechCrunch. “Taking that aside, what we do see is that the SaaS vendors are doing a good job in retention, double-digit growth and managing expenses. But the macro story is still about interest rates.” The bad news Despite being a recent winner in the enterprise software space, Box did not have a good run this earnings cycle. It barely cracked street expectations for revenue growth and guided under street expectations for its current quarter (by up to $12 million) and current fiscal year (by $40 million to $50 million). Box CEO Aaron Levie said that while his company sees the same ",
  "wordCount": 1766,
  "author": "Ron Miller, Alex Wilhelm",
  "hash": "3ad0c675d79e497a"
}