{
  "url": "https://techcrunch.com/2021/03/22/nfts-could-bridge-video-games-and-the-fashion-industry/",
  "title": "NFTs could bridge video games and the fashion industry | TechCrunch",
  "snippet": "Non-fungible tokens (NFTs) offer new ways for consumers to collect, wear and trade fashion online. Now that most fashion shows have scaled",
  "domain": "techcrunch.com",
  "publishedDate": "2021-03-22T07:10:57-07:00",
  "extractedText": "Non-fungible tokens (NFTs) offer new ways for consumers to collect, wear and trade fashion online, and now that most fashion shows have scaled back or gone virtual, they may become an important tool for the industry. Because some of the most profitable NFTs are produced by celebrities with teams, it makes sense that music corporations, fashion brands and designers are venturing into the NFT market as well. Just this month, sneaker brand RTFKT Studios garnered $3.1 million in seven minutes by selling crypto collectibles. In December 2020, NFT startup Enjin partnered with Netherlands-based fashion house The Fabricant on a virtual collection. Real-life fashion brands use NFTs for marketing in virtual worlds like Minecraft, plus several Atari and Microsoft video games. “Brands are coming up with some creative solutions because the pandemic is persistent, and fashion is something that is so close to our identities,” said Bryana Kortendick, Enjin’s VP of operations and communications. “You can snap a photo of yourself wearing your Atari-branded NFTs. You’ll also be able to wear them in video games.” Breakout NFT star Beeple said he imagines a future where fashion NFTs could be redeemed for specific items in physical stores, especially at luxury retailers like his former client Louis Vuitton. “You can relate NFTs to clothing in new and interesting ways,” he said. “This will be seen as the next chapter of digital art history. This is a continuation of digital art history that started decades ago, by that I mean art made on a computer and distributed through the internet.” Fashion designers like Schirin Negahbani are already creating NFTs that represent actual clothing. Precisely because multimillion-dollar NFT sales are breaking records, spectators have been prompted to question the role speculative trading plays in this trend. Textile designer Amber J. Dickinson says fashionable NFTs shouldn’t primarily be viewed as speculative trading opportunities. “The way I think fashion translates to the digital world is to view an NFT as a collectible piece of the garment for history,” said Dickinson, known for hand-made silk scarves and her work with Alexander McQueen. “I would only buy art as a piece that I liked. Whether digital or in the real world, I don’t take an investor’s point of view.” Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW There are many fashion fans who disagree with Dickinson, preferring to invest through assets like Birkin bags. They may have a different approach to NFTs. The DIGITALAX crypto fashion platform, for example, is being built with a plethora of trading features. As for Dickinson, she said she is still looking for her tribe of crypto-savvy artists on Twitter. “There’s too much fast fashion and consumers are not encouraged to hold a particular item or style,” Dickinson said. “I hope NFTs will bring back that mentality of treasuring a piece of fashion. Some people already collect shoes, don’t they?” Dickinson aims to make her first NFTs in 2021, fundraising to manufacture her collection of printed silk scarves. It’s a slow process, she said, because she feels intimidated by the technology and isn’t sure which platform is the best way to find collectors, not traders. Because she wants to avoid the NFT hype, she says she’s not in a rush. “I only came back onto Twitter because of this NFT movement,” Dickinson said. “It’s nice to have direct access to a community of artists. It’s about trying to find the right audience.” Crossing over to the video game community Brands like Gucci are already exploring ways to find new audiences through video games like Roblox and Animal Crossing. Blockade Games CTO Ben Heidorn says NFTs will be the next step in that evolution. “We would like to do a fashion line that has a digital analog; it could be displayed during times like New York Fashion Week,” Heidorn said. “We’re going to have an expansion set that feels like Magic the Gathering — expansion sets every few months. There will be missions and campaigns, all the nerdy fun stuff.” Blockade Games CEO Marguerite deCourc",
  "wordCount": 1501,
  "author": "Leigh Cuen",
  "hash": "4304177fbcc68fda"
}