{
  "url": "https://techcrunch.com/2023/11/22/birdseye-ai-chief-marketing-officer-retail/",
  "title": "Birdseye's AI-powered chief marketing officer drives personalized email campaigns for retailers | TechCrunch",
  "snippet": "The company offers hyper-personalization email and SMS campaigns and retail transaction data insights from one dashboard.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-11-22T05:00:53-08:00",
  "extractedText": "Consumer budgets are expected to be better this holiday shopping season, which could result in better sales outcomes for retailers. It continues to be a challenge to capture those consumer dollars amid myriad messages coming at consumers from all directions. However, one startup thinks it has cracked the code on how brands and retailers can most effectively target and connect with customers. Meet Birdseye, a Toronto-based company focused on retail and e-commerce artificial intelligence. Matt Bogoroch started the company in 2021 with his brother, Adam Bogoroch, and Shardul Frey to provide e-commerce analytics for Shopify brands to improve their marketing and advertising efforts and put them in an even playing field with larger companies. They recognized that smaller, online retailers don’t have the dedicated analytics teams to provide the data needed to boost their marketing, thus leaving sales on the table. Two years later, the company has grown into a platform for large brands and retailers offering the skills of an AI-powered chief marketing officer, including executing hyper-personalization email and SMS campaigns and insights from retail transaction data, from one dashboard. Its technology computes millions of marketing actions for the retailer so they can match their customers with the products they most likely would be interested in purchasing at any given time and price. Birdseye’s marketing recommendations dashboard. Image Credits: Birdseye This includes excess inventory so that retailers don’t have to run discounts or do mass email campaigns. In addition, Birdseye is able to alert retailers about potential customer churn so they can proactively respond with personalized offers to help retain them. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW “Each message and discount is unique, crafted by an advanced large language model, ensuring relevance and appeal to each recipient,” CEO Matt Bogoroch told TechCrunch via email. “Imagine Nike having 800 units of size 16 yellow shoes that are struggling to sell due to their unique size/color combination. Birdseye’s AI can identify customers who prefer yellow and wear size 16, then reach out with personalized pricing for the shoes — all without human intervention.” The company is working with approximately 120 logos, including Midori, bag & bougie and Eva Franco. That is an increase of 100% since the beginning of the year, Bogoroch said. He declined to go into specifics about revenue growth. Birdseye secured $500,000 in a pre-seed round from Drive Capital in March. Today, the venture capital firm infused additional capital into the company, this time $3 million in seed funding. As part of the investment, Drive Capital partner Masha Khusid will join Birdseye’s board of directors. With the funding, Birdseye has two years of runway and will focus on growing its customer base to include more mid-market and enterprise companies. It will also grow from eight to 14 engineers, mainly on the machine learning side, Bogoroch said. Embracing digital commerce may be retailers’ best bet for staying ahead of a fast-moving industry Topics birdseye, Commerce, Drive Capital, e-commerce, Matt Bogoroch, retail, Startups, Venture Christine Hall Senior Reporter Christine Hall wrote about enterprise/B2B, e-commerce, and foodtech for TechCrunch, and venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an undergraduate journalism degree from Murray State University and a graduate degree from The Ohio State University. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s bigg",
  "wordCount": 1005,
  "author": "Christine Hall",
  "hash": "46ac9dcdf6ed4be9"
}