{
  "url": "https://techcrunch.com/2023/07/07/speedybrand-generative-ai-marketing/",
  "title": "SpeedyBrand uses generative AI to create SEO-optimized content | TechCrunch",
  "snippet": "SpeedyBrand, a Y Combinator–backed startup developing generative AI tools for marketing use cases, has raised $2.5 million in seed funding.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-07-07T05:30:31-07:00",
  "extractedText": "While working at Vetan, a startup helping small- and medium-sized (SMBs) businesses manage employee payroll, Ranti Dev Sharma realized that SMBs often lack the tools to thrive online with organic sales. The cost to hire an agency is beyond their budget, and generating content is costly — both in terms of time and money. “Having a great online presence is critical for e-commerce stores like Shopify and Woo, as online traffic is the bread and butter of their business,” Sharma told TechCrunch in an email interview. “But existing content marketing solutions are not complete and require search engine optimization (SEO) expertise. Businesses need multiple SEO tools and to hire content strategists, writers and agencies to outsource their content marketing work.” So along with Jatin Mehta and Ayush Jasuja, Sharma co-founded SpeedyBrand, which aims to bring “high-quality,” affordable SEO content to SMBs using generative AI. SpeedyBrand today announced that it raised $2.5 million in a funding round led by GV (Google’s venture arm) and Y Combinator that values the company at $15 million post-money. SpeedyBrand’s platform, powered by generative AI, can create custom SEO-optimized content — including websites and social media posts — for brands. Brands first choose a topic. Then they have the platform generate text and suggest images that might be appropriate for the type of content they’re generating. From SpeedyBrand’s dashboard, generated content can be edited and further customized before being published to various channels. An analytics component allows brands to track the performance of the content once it’s live. “The economic slowdown requires cost-effective marketing solutions,” Sharma said. “Speedy is well-positioned to help businesses with an affordable solution.” But there’s reason to be wary of the tech. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW For one, generative AI, no matter how good, can — and does — run amok. Thanks to a phenomenon known as “hallucination,” AI models sometimes confidently make up facts. And, as a result of biases and other imbalances in their training data, text-generating AI can spew toxic, wildly offensive remarks. In another potential problem for brands, generative AI has been shown to plagiarize copyrighted work. One study found that an indirect predecessor to ChatGPT, GPT-2, can be prompted to “copy and paste” entire paragraphs from its training data. Then there’s the matter of generative AI spamming up the internet. As The Verge’s James Vincent wrote in a recent piece, generative AI models are changing the economy of the web — making it cheaper and easier to generate lower-quality content. Newsguard, a company that provides tools for vetting news sources, has exposed hundreds of ad-supported sites with generic-sounding names featuring misinformation created with generative AI. Sharma asserts that SpeedyBrand isn’t a content mill — and that it takes steps to mitigate any toxic content that the platform’s AI might generate. SpeedyBrand’s AI can be personalized to brand tone and generates provably “plagiarism-free” content, he claims, incorporating feedback from content edits to improve future output. To what extent is all this true? It’s tough to say without a third-party audit. But brands, no doubt eager to jump on the generative AI train, appear to be embracing SpeedyBrand. The company, which has a six-person team, has around 50 paying customers and over 1,000 users. Annual recurring revenue stands at $100,000, and Sharma anticipates that it’ll reach $1 million in the next year. That’s impressive considering the competition. SpeedyBrand faces off against Typeface, which recently emerged from stealth with $65 million in venture capital. Startups like Movio, Copysmith, Copy.ai, Sellscale, Jasper, Omneky and Regie.ai, too, are using generative AI to create (ostensibly) better marketing copy, imagery and even video for ads, websites and emails. It’s a large and growing market. Statista reports that 87% of current AI adopters are already using, or considering using, AI for improving th",
  "wordCount": 1252,
  "author": "Kyle Wiggers",
  "hash": "4c63c10764a1984a"
}