{
  "url": "https://wp.technologyreview.com/",
  "title": "MIT Technology Review",
  "snippet": "Google DeepMind's latest LLM, Gemini 3, may have at least a trillion—some think it's probably more like 7 trillion—but the company isn't saying. (With",
  "domain": "wp.technologyreview.com",
  "publishedDate": "2026-01-09T08:10:00-05:00",
  "extractedText": "The Download: the case for AI slop, and helping CRISPR fulfill its promise Posted on January 9, 2026January 9, 2026 by Rhiannon Williams This is today’s edition of The Download, our weekday newsletter that provides a daily dose of what’s going on in the world of technology. How I learned to stop worrying and love AI slop —Caiwei Chen If I were to locate the moment AI slop broke through into popular consciousness, I’d pick the video of rabbits bouncing on a trampoline that went viral last summer. For many savvy internet users, myself included, it was the first time we were fooled by an AI video, and it ended up spawning a wave of almost identical generated clips. My first reaction was that, broadly speaking, all of this sucked. That’s become a familiar refrain, in think pieces and at dinner parties. Everything online is slop now—the internet “enshittified,” with AI taking much of the blame. Initially, I largely agreed. But then friends started sharing AI clips in group chats that were compellingly weird, or funny. Some even had a grain of brilliance. I had to admit I didn’t fully understand what I was rejecting—what I found so objectionable. To try to get to the bottom of how I felt (and why), I spoke to the people making the videos, a company creating bespoke tools for creators, and experts who study how new media becomes culture. What I found convinced me that maybe generative AI will not end up ruining everything after all. Read the full story. A new CRISPR startup is betting regulators will ease up on gene-editingHere at MIT Technology Review we’ve been writing about the gene-editing technology CRISPR since 2013, calling it the biggest biotech breakthrough of the century. Yet so far, there’s been only one gene-editing drug approved, and it’s been used commercially on only about 40 patients, all with sickle-cell disease.It’s becoming clear that the impact of CRISPR isn’t as big as we all hoped. In fact, there’s a pall of discouragement over the entire field—with some journalists saying the gene-editing revolution has “lost its mojo.”So what will it take for CRISPR to help more people? A new startup says the answer could be an “umbrella approach” to testing and commercializing treatments which could avoid costly new trials or approvals for every new version. Read the full story. —Antonio Regalado America’s new dietary guidelines ignore decades of scientific research The first days of 2026 have brought big news for health. On Wednesday, health secretary Robert F. Kennedy Jr. and his colleagues at the Departments of Health and Human Services and Agriculture unveiled new dietary guidelines for Americans. And they are causing a bit of a stir.That’s partly because they recommend products like red meat, butter, and beef tallow—foods that have been linked to cardiovascular disease, and that nutrition experts have been recommending people limit in their diets.These guidelines are a big deal—they influence food assistance programs and school lunches, for example. Let’s take a look at the good, the bad, and the ugly advice being dished up to Americans by their government. —Jessica Hamzelou This article first appeared in The Checkup, MIT Technology Review’s weekly biotech newsletter. To receive it in your inbox every Thursday, and read articles like this first, sign up here. The must-reads I’ve combed the internet to find you today’s most fun/important/scary/fascinating stories about technology. 1 Grok has switched off its image-generating function for most usersFollowing a global backlash to its sexualized pictures of women and children. (The Guardian)+ Elon Musk has previously lamented the “guardrails” around the chatbot. (CNN)+ XAI has been burning through cash lately. (Bloomberg $) 2 Online sleuths tried to use AI to unmask the ICE agent who killed a womanThe problem is, its results are far from reliable. (WP $)+ The Trump administration is pushing videos of the incident filmed from a specific angle. (The Verge)+ Minneapolis is struggling to make sense of the shooting of Renee Nicole Good. (WSJ $)3 Smartphones and PCs are about to get more expensiveYou can thank the memory chip shortage sparked by the AI data center boom. (FT $)+ Expect delays alongside those price rises, too. (Economist $)4 NASA is bringing four of the seven ISS crew members back to EarthIt’s not clear exactly why, but it said one of them experienced a “medical situation” earlier this week. (Ars Technica) 5 The vast majority of humanoid robots shipped last year were from ChinaThe country is dominating early supply for the bipedal machines. (Bloomberg $)+ Why a Chinese robot vacuum firm is moving into EVs. (Wired $)+ China’s EV giants are betting big on humanoid robots. (MIT Technology Review) 6 New Jersey has banned students’ phones in schoolsIt’s the latest in a long line of states to restrict devices during school hours. (NYT $) 7 Are AI coding assistants getting worse?This data scientist certainly seems to think so. (IEEE Spectrum)+ AI coding",
  "wordCount": 1131,
  "author": "Rhiannon Williams",
  "hash": "4cad8e299f5f465a"
}