{
  "url": "https://techcrunch.com/2022/09/06/zineone-raises-cash-to-help-ecommerce-companies-predict-customer-behavior/",
  "title": "ZineOne helps e-ommerce companies predict customer behavior",
  "snippet": "ZineOne — which serves specifically e-commerce brands — uses AI to score behavior and personalize website and app users' individual experiences",
  "domain": "techcrunch.com",
  "publishedDate": "2022-09-06T06:00:29-07:00",
  "extractedText": "In-session marketing, a form of inbound marketing that attempts to analyze and influence web and app users’ purchasing decisions, is often challenging to implement. With so much competing for consumers’ attention these days, rare is the brand that’s able to make a lasting first impression. According to Microsoft Research, people only spend about 10 seconds on a company’s homepage if the page doesn’t immediately connect with a marketing message. Debjani Deb, Manish Malhotra and Arnab Mukherjee, the co-founders of in-session marketing platform ZineOne, dealt with the hurdles around customer tracking firsthand at their previous jobs. Deb previously co-founded EmPower, a firm that provided tools for social media research and media monitoring, while Malhotra started his own company, Social Lair, to build social media capabilities for large enterprises. As for Mukherjee, he left Oracle to launch Udichi, a compute platform for “big data” analysis. In the early days of ZineOne, Deb, Malhotra and Mukherjee met at the Milpitas Library in Santa Clara and local coffee shops to speculate about where online marketing technology was heading. They came to the conclusion that recording real-time customer decisions was the key to boosting conversions, springboarding ZineOne’s first series of products. After attracting customers like Men’s Wearhouse, Wynn Resorts, Advance Auto Parts and Kohl’s, ZineOne has raised $28 million in Series C funding, the company today announced. SignalFire led the round, with participation from Norwest and others, bringing ZineOne’s total raised to $42 million. “We believe in-session marketing is a critical, and perhaps the most important, component of modern marketing for brands in a privacy-first world,” Deb told TechCrunch in an email interview. “What in-session marketing accomplishes, ultimately, is enabling brands to capture the optimal amount of conversion on their website which results in more efficient pre-purchase dollars and less reliance on re-marketing strategies.” Image Credits: ZineOne At a high level, ZineOne — which serves specifically e-commerce brands — uses AI to score behavior and personalize website and app users’ individual experiences. By observing a visitor’s first few clicks or taps, the platform can ostensibly customize the messaging, discount offers and product recommendations that they see in real time. It’s worth noting that, at least according to some surveys, a large segment of consumers don’t agree with any form of behavior tracking for marketing. Part of the rejection might stem from concerns over bias in AI systems, which have the potential to impact the experiences of certain customer segments. But Deb argues that ZineOne has protections in place to allay these fears. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW For example, ZineOne uses anonymized session data to conduct its analyses, Deb says — primarily a “granular set of behavioral events” for each visitor, including product detail views, cart updates and checkouts. Since the platform’s targeting derives from short-term behaviors, it doesn’t need to store any longitudinal identity or profile data, she claims. “ZineOne’s in-session marketing platform focuses on these three key pillars: understanding in-session behaviors for anonymous visitors (not just known customers), predicting outcomes and taking the optimal set of in-session actions,” Deb said. “ZineOne’s early purchase prediction model tells [brands] within 5 clicks which anonymous visitors are highly likely to make a purchase, who is on the fence and who is unlikely to buy in that session. They are then able to trigger experiences according to the consumers’ purchase propensity today, right now, in the moment.” ZineOne isn’t the only platform applying data analytics to drive e-commerce personalization. DynamicYield, which was acquired by McDonald’s in 2019 before being sold to Mastercard, uses AI to customize content on websites, insert product recommendations and even dynamically change the layout of web flows. There’s also Metrical, which learns of those v",
  "wordCount": 1338,
  "author": "Kyle Wiggers",
  "hash": "4f23cb5a4682d539"
}