{
  "url": "https://techcrunch.com/2022/12/15/former-myntra-chiefs-fashion-startup-virgio-valued-at-161-million-in-new-funding/",
  "title": "Former Myntra chief's fashion startup Virgio valued at $161 million in new funding | TechCrunch",
  "snippet": "Fashion startup Virgio, co-founded by Amar Nagaram, former chief executive of Myntra, has raised $37 million in a new financing round.",
  "domain": "techcrunch.com",
  "publishedDate": "2022-12-15T23:28:20-08:00",
  "extractedText": "Fashion startup Virgio, co-founded by Amar Nagaram, former chief executive of Myntra, has raised $37 million in a new financing round as the young firm looks to build “a global fashion brand” from the South Asian market. Prosus Ventures, Alpha Wave and Accel co-led Virgio’s Series A funding, valuing the one-year-old startup at $161 million (post-money). (Virgio says it was founded this year, but hasn’t disclosed its seed funding round.) Virgio says consumers’ fashion preferences are changing rapidly and they are not satisfied with the incumbents’ offerings. It is attempting to solve this by streamlining design, manufacturing and purchasing processes in “real-time,” offering Gen Z and late millennials a platform where they can discover and purchase the new trendy apparels. Virgio offers a wide range of selection in casual, party and ethnic wear. Each week it adds new selections and customers receive large discounts and free shipping. The startup’s approach has prompted some to draw comparisons between its model with that of the behemoth Shein. “Traditionally, the fashion industry has operated on depth and discount models,” said Nagaram, founder and chief executive of Virgio, in a statement. “At the core of Virgio is the tech foundation, which is always listening to evolving trends on social media platforms and predicting the demand for each trend. This is then fed into our agile and responsive supply chain to enable the trendiest, elegant and yet affordable line in near real-time. Thus, Virgio is pioneering the test and scale method, making runway fashion accessible and affordable for all consumers, while eliminating excess inventory for manufacturers,” said Nagaram, a Flipkart veteran who took over Myntra’s top job in 2019 before leaving the firm last year. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW The startup says its full-stack approach is allowing it to condense the typical lead time of eight to 10 months to just one month. Its eponymous app has already amassed more than 100,000 downloads, it said. (On Sensor Tower, the app reflects very little metrics as it is still too small.) “There is a large underserved market for branded apparel in India currently. For example, for women, only ~25% of fashion is branded apparel. The fashion industry in India is thus at an inflection point, driven by changing consumer preferences as a result of social media’s influence, an important Gen-Z characteristic to individualize as a form of expression, and the integration of social commerce with social media platforms,” said Ashutosh Sharma, head of India Investments at Prosus Ventures, in a statement. “We are confident in Virgio’s tech-first model and believe the startup’s expert founding team is uniquely positioned to capture a large opportunity in India’s fashion industry,” he added. Scores of other entrepreneurs — including Mukesh Bansal, Kunal Shah, Binny Bansal, Bhavish Aggarwal, Vidit Aatrey, Saif Ali Khan, Sriharsha Majety and Sameer Nigam — also invested in the round. Topics Accel, Alpha Wave, India, India, myntra, Prosus Ventures, Startups, Venture, Virgio Manish Singh Reporter, India Manish Singh is a senior reporter at TechCrunch, covering India’s startup scene and venture capital investments. He also reports on global tech firms’ India play. Before joining TechCrunch in 2019, Singh wrote for about a dozen publications, including CNBC and VentureBeat. He graduated in Computer Science and Engineering in 2015. He is reachable on manish(at)techcrunch(dot)com. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Foun",
  "wordCount": 996,
  "author": "Manish Singh",
  "hash": "51788fd2bebe834e"
}