{
  "url": "https://techcrunch.com/2012/10/20/dublin-web-summit-picks-smartthings-out-of-100-strong-startup-competition/",
  "title": "Dublin Web Summit Picks SmartThings Out Of 100-Strong Startup Competition | TechCrunch",
  "snippet": "Every single one of our apps has been App of the Week or is in the Apple Hall of Fame on the appStore. 9GAG Ray Chan Hong Kong Their pitch: 9GAG",
  "domain": "techcrunch.com",
  "publishedDate": "2012-10-20T03:00:27-07:00",
  "extractedText": "Well, many have travelled but few will make the end. SmartThings won the Dublin Web Summit startup competition this week beating off the other three finalists Vibease, Ovelin and Tictail and winning €100,000 in cash, as part of the Electric Ireland Spark of Genius competition. Over 1,000 entries to the competition were shortlisted to 100 which then pitched from two stages (social, mobile, consumer and enterprise) to over the two day international tech conference. Set up by Alex Hawkinson, SmartThings turns everyday objects into smart objects. The platform is a hub that connects to the internet and other devices that then senses and controls real-world things like a door lock, or a light or anything else. This is along the lines of the Internet of things we’ve heard so much about. It previously secured $1.2 million in a Kickstarter campaign and has announced a partnership with Instacube which will allows the cube to display notifications for things like visitors arriving or leaving the lights on. It’ll also be able to control home automation systems that SmartThings can operate. The other startups in the final were: VIBEASE INC. Dema Tio, Singapore Their pitch: Vibease helps couples to stay intimate by using app and personal massager. “Vibease is a private social network app for couples with Bluetooth personal massager. Couples can use Vibease for chatting and share their moments. The woman’s partner can control her massager using a smartphone, even though they are separated. One of the top reasons for divorce is a lack of sexual intimacy in a relationship, especially in long distance relationships. With Vibease, distance doesn’t matter.” OVELIN Chris Thür Finland Their pitch: Guitar Hero for real guitar! Get hooked on practicing on your real instrument. Ovelin is changing the way how people learn to play a musical instru- ment. Our first game WildChords is played with a real guitar on the iPad (no special equipment needed). The guitar learning game has won numerous awards including best European learning game, iPad game of the year, Sunday Times award and was #1 music app in 34 countries. TICTAIL Carl Waldekranz Sweden Start a free and beautiful online store and get daily marketing advice. Their pitch: Called “The Tumblr of e-commerce” by Wired Magazine, Tictail offers a free and easy way to start your own online store. Since beta-launch in May 2012, Tictail has been named one of top 100 startups in Europe (Wired) and the hottest startup in Sweden (IDG) and have already gained traction amongst thousands of online retailers all around the world. Here is our bare-bones run though of the start-ups appearing at Dublin Web Summit’s START programme. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW 42MATTERS AG Andrea Girardello Switzerland Their pitch: 42matters, with its Playboard app, is a pioneer in app-discovery solutions. 42matters offers innovative app-finding solutions for smartphones. Our flagship product is Playboard, which is the Flipboard for app-dis- covery. Content is powered by algorithms and curated lists by third-party editors. Users can personalize the app, getting app-recom- mendations on what is really interesting for them. 45SOUND Cathal Furey Ireland Their pitch: Crowd-sourced live event videos with great audio. Let the fans tell the story! 45sound solves the problem of awful-sounding fan videos of live music on YouTube. We help bands connect with their fans by automatical-ly matching fan-shot concert videos with a proper live audio record- ing so they sound great & can be watched back from different angles. Artists are happy, fans are happy & it’s a great marketing platform for brands. 955 DREAMS INC. Kiran Bellubbi United States Their pitch: We make magical mobile experiences. Our flagship product: Band of the Day has been downloaded over 3M times on the iPhone and iPad. It was voted App of the Year (Runner Up) 2011 by Apple. Every single one of our apps has been App of the Week or is in the Apple Hall of Fame on the appStore. 9GAG Ray Chan Hong Kong Their pitch: 9GAG brings more fun to the world. 9",
  "wordCount": 12156,
  "author": "Mike Butcher",
  "hash": "51c9e889f47a23f5"
}