{
  "url": "https://hbr.org/podcast/2025/12/climate-rising-extending-apparel-lifespan-with-thredup",
  "title": "Climate Rising: Extending Apparel Lifespan with ThredUpNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuClose menuSearch",
  "snippet": "JAMES REINHART: Yeah Yes, yeah, I mean, you know because I was a teacher and in education before that’s also a proxy for saying I didn’t have any money and I went to actually sell some of my clothes at a local consignment store on Mass Ave and They wouldn’t take my stuff, you know, they said we don’",
  "domain": "hbr.org",
  "publishedDate": "2025-12-23T11:10:49Z",
  "extractedText": "Skip to content Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Latest Magazine Topics Podcasts Store Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Ask AI Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Close menu Search Please enter a search term Submit Suggested Topics Explore HBR Latest The Magazine Podcasts Store Webinars Newsletters Popular Topics Managing Yourself Leadership Strategy Managing Teams Gender Innovation Work-life Balance All Topics For Subscribers Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Subscribe My Account My Library Topic Feeds Orders Account Settings Email Preferences Log Out Sign In Subscribe Latest Podcasts The Magazine Store Webinars Newsletters All Topics Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive My Library Account Settings Log Out Sign In Your Cart Your Shopping Cart is empty. Visit Our Store Guest User Subscriber My Library Topic Feeds Orders Account Settings Email Preferences Log Out Reading List Reading Lists X Share Podcast Cold Call / Episode 272 Climate Rising: Extending Apparel Lifespan with ThredUp Play Listen | Podcast loading... Go Back 15 seconds Play Go Foward 15 seconds Share The business model, brand strategy, and AI tools powering one of the largest secondhand clothing platforms. Subscribe: Apple Podcasts Spotify RSS All episodes All episodes Details Transcript December 23, 2025 With the holiday season upon us, and thrifting a major trend, we’re sharing an episode of Harvard Business School’s Climate Rising podcast that’s focused on extending product life, reducing waste, and the growing role of resale in the circular economy. Climate Rising is all about what businesses are doing, can do, and should do to confront climate change. In this episode, “Extending Apparel Lifespan,” HBS Professor Mike Toffel talks to ThredUp CEO James Reinhart about why ThredUp chose to build a national logistics and technology platform for resale. They also talk about how the company partners with big brands to run their own resale channels and how AI and automation are reshaping the industry. It’s an insightful conversation for anyone interested in sustainability or circular business models. ROBIN PASSIAS: Hi, listeners. Robin Passias here, Cold Call producer. This week on the podcast, we’re sharing an episode of Harvard Business School’s Climate Rising podcast. In this conversation, Professor Mike Toffel speaks with James Reinhart, Co-Founder and CEO of ThredUp, one of the world’s largest online resale platforms for secondhand clothing. We thought it was the perfect time with the holiday season upon us and the results of ThredUp’s 2025 holiday report revealing 40% of holiday budgets will go to secondhand gifts this year. What a wonderful idea to extend product life, reduce waste, and be part of the circular economy. We hope you enjoy and will maybe be inspired to join in on this year’s thrifting as gifting trend. From all of us here at Cold Call, may you have a happy, healthy holiday season. We’ll see you back here on January 6, 2026, with all new episodes. Thanks for listening. Editor’s Note: This podcast originally aired on June 4, 2025. MIKE TOFFEL: James, thank you so much for joining us on Climate Rising. JAMES REINHART: Thanks for having me, great to be here. MIKE TOFFEL: James, why don’t we start with a little bit of your background. So, you started ThredUp almost 20 or 15 years ago or so. And so, what were you doing before that? JAMES REINHART: Yeah, I started the business out of business school. So I was, you know, I was working on the business while trying to get all my casework done. So, I didn’t get the best grades, you know, my final year of business school because of that. But before that, though, I worked in public education. So, I helped start a charter school serving low-income kids. I was a teacher for a few years. I was very focused on the intersection of private and public partnerships, right? And so education was a passion of mine and I thought the education system in this country could do better. And so, I was very much focused on that. And I think there’s a thorough line in my career around trying to do well and do good at the same time. MIKE TOFFEL: Right. So, then you were here at Harvard, HBS, and at Kennedy School doing a joint degree, the three-year program. JAMES REINHART: Correct, yep. I was there. I started at the Kennedy School and then did two years at the business school. MIKE TOFFEL: So, you were here, and you were drumming up this idea while you were a business school / Kennedy School student. JAMES REINHART: Yeah Yes, yeah, I mean, you know because I was a teacher and in education before that’s also a proxy for saying I didn’t have any ",
  "wordCount": 7341,
  "hash": "539605bb62b5a7a8"
}