{
  "url": "https://hbr.org/podcast/2025/02/the-consumer-psychology-of-adopting-ai",
  "title": "The Consumer Psychology of Adopting AINavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuClose menuSearch",
  "snippet": "So, while it’s true that there are cases like automated vehicles where the system behaves in a very sort of autonomous way that seems to take control away from you, there are other domains in which we worry that this AI system is not going to be flexible enough, that it’s not going to adapt to my pa",
  "domain": "hbr.org",
  "publishedDate": "2025-02-18T13:00:10Z",
  "extractedText": "Skip to content Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Latest Magazine Topics Podcasts Store Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Ask AI Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Close menu Search Please enter a search term Submit Suggested Topics Explore HBR Latest The Magazine Podcasts Store Webinars Newsletters Popular Topics Managing Yourself Leadership Strategy Managing Teams Gender Innovation Work-life Balance All Topics For Subscribers Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Subscribe My Account My Library Topic Feeds Orders Account Settings Email Preferences Log Out Sign In Subscribe Latest Podcasts The Magazine Store Webinars Newsletters All Topics Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive My Library Account Settings Log Out Sign In Your Cart Your Shopping Cart is empty. Visit Our Store Guest User Subscriber My Library Topic Feeds Orders Account Settings Email Preferences Log Out Reading List Reading Lists X Share Podcast HBR IdeaCast / Episode 1014 The Consumer Psychology of Adopting AI Play Listen | Podcast loading... Go Back 15 seconds Play Go Foward 15 seconds Share A conversation with HBS professor Julian De Freitas about overcoming five mental obstacles. Subscribe: Apple Podcasts Spotify RSS All episodes All episodes Details Transcript February 18, 2025 Despite all the ways that artificial intelligence promises to improve our lives, many consumers feel anxious and are averse to AI-powered products and services. For marketers and product managers, it’s vital to understand what is driving that resistance to adoption. Julian De Freitas is an assistant professor in the marketing unit at Harvard Business School. He has identified five main ways people see artificial intelligence negatively: that AI is opaque, emotionless, inflexible, autonomous, and not human enough. Through real-life cases and the latest research, he explains how companies can soothe anxieties and encourage consumer adoption. De Freitas the author of the HBR article “Why People Resist Embracing AI.” CURT NICKISCH: Welcome to the HBR IdeaCast from Harvard Business Review. I’m Curt Nickisch. Artificial intelligence is changing business as we know it, but the extent of those changes depends on two things. First, how good the technology gets, and second, how much companies adopt it and consumers actually buy it, and there’s a gap there. According to a Gartner survey, for instance, four out of five corporate strategists say AI will be critical to their success in the near future, but only one out of five said they actually use AI in their day-to-day work. That was a 2023 survey, it’s probably different today. But the point remains, there is, adoption is lagging, and a key reason for that is perception. Many people view AI and automation negatively and resist using them. Today’s guest has studied the psychological barriers to adoption and explains what managers can do to overcome them. Julian De Freitas is an assistant professor at Harvard Business School and he wrote the HBR article, Why People Resist Embracing AI. Julian, hi. JULIAN DE FREITAS: Hi, Curt. Thanks for having me on the show. CURT NICKISCH: Julian, the adoption of technology is an age-old experience for people. We’ve resisted technology many times in the past and have adopted it. Is AI any different from other technologies when it comes to resistance to adoption? JULIAN DE FREITAS: I think the answer is yes, and we’re finding in many cases AI is different from a consumer perception standpoint. What we’re seeing is that in many use cases, people perceive AI as though it is more human-like, as opposed to being this sort of non-living technology. And this has profound implications for a number of marketing problems, such as overcoming barriers to adoption, but also, new ways of unlocking value from the technology that aren’t possible with previous technologies. And then of course, there’s also interesting challenges around the risks, because it’s not actually the case that this is another human. It does fall short of humans in various ways. And so if we treat it as a full-fledged human being, that could also create challenges and risks. CURT NICKISCH: What are the main ways that people see AI as something that they want to drag their feet with, as something they want to resist? JULIAN DE FREITAS: We try to narrow it down to five main barriers. At a high level, I think you can summarize them as, AI is often seen as human-like, but not human enough. Or conversely, it is seen as a little bit too human, too capable. And then there’s one last barrier that’s just about how it’s really difficult to understand. So, the five barriers that myself ",
  "wordCount": 4572,
  "hash": "544f7b270824ddb7"
}