{
  "url": "https://techcrunch.com/2024/01/09/walmart-debuts-generative-ai-search-and-ai-replenishment-features-at-ces/",
  "title": "Walmart debuts generative AI search and AI replenishment features at CES | TechCrunch",
  "snippet": "Walmart is launching a new generative AI search feature on iOS that will allow customers to search for products by use cases, instead of by product or brand",
  "domain": "techcrunch.com",
  "publishedDate": "2024-01-09T14:05:40-08:00",
  "extractedText": "In a keynote address at the Consumer Electronics Show in Las Vegas, Walmart president and CEO Doug McMillon and other Walmart execs offered a glimpse as to how the retail giant was putting new technologies, including augmented reality (AR), drones, generative AI and other artificial intelligence tech to work in order improve the shopping experience for customers. At the trade show, the company revealed a handful of new products, including two AI-powered tools for managing product search and replenishment, as well as a new beta AR social commerce platform called “Shop with Friends.” It also highlighted how it was using AI in other areas of its business, including within Sam’s Club and in apps used by store associates. Most notably, Walmart is launching a new generative AI search feature on iOS that will allow customers to search for products by use cases, instead of by product or brand names. For example, you could ask Walmart to return search results for things needed for a “football watch party,” instead of specifically typing in searches for chips, wings, drinks or a 90-inch TV. These enhanced search results will span categories, rivaling Google’s SGE (Search Generative Experience), which can recommend products and show various factors to consider, along with reviews, prices, images and more. Image Credits: Walmart Ahead of CES, the company had demonstrated an AI shopping assistant that would let customers interact with a chatbot as they shopped, to ask questions and receive personalized product suggestions, as well. At the time, Walmart teased that a generative AI-powered search feature was also in the works. It suggested customers could ask for things like a “unicorn-themed birthday party” and get results like unicorn-themed napkins, balloons, streamers and more. Now the feature is rolling out on mobile devices, iOS first. Another potentially promising use of AI involves the replenishment of frequently ordered items. Walmart will initially test this use case with Walmart InHome Replenishment, which will use AI and its existing replenishment expertise combined to create automated online shopping carts for customers with items they regularly order. Because it’s only available through the InHome program, these items are then delivered to a customer’s fridge in their kitchen or garage using the smart lock-powered InHome delivery service, but it will not be a subscription service. The company also noted that customers will be able to remove items from their basket, as needed, and the service will adjust to customer’s changing needs over time. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Image Credits: Walmart However, if the feature works well, it’s not hard to imagine how it could be put to use to offer replenishment of other household items as well, similar to Amazon’s Subscribe-and-Save. Surprisingly, Amazon has not yet leveraged AI to do the same (i.e. to augment or replace Dash Replenishment). However, the online retailer has been putting AI to work in other ways, including by helping connect customers with the right product by summarizing product reviews, highlighting key attributes or helping them find clothes that fit. Image Credits: Walmart Another new Walmart product making a debut at CES is “Shop with Friends,” an AR shopping tool that lets customers share virtual outfits they create with their friends and then get feedback on their finds. The tool combines Walmart’s AI-powered virtual try-on tech, launched last year, with social features. Image Credits: Walmart CEO Doug McMillon referred to the suite of new products as something he called “adaptive retail” — that is, retail experiences that are personalized and flexible. “While omnichannel retail has been around for decades, this new type of retail — adaptive retail — takes it a step further, said Suresh Kumar, global chief technology officer, and chief development officer, Walmart Inc., in a statement shared ahead of the CES keynote. “It’s retail that is not only e-commerce or in-store, but a single, unified retail experience that seamlessly blends t",
  "wordCount": 1695,
  "author": "Sarah Perez",
  "hash": "581f15f0a7cbe524"
}