{
  "url": "https://techcrunch.com/2023/11/09/y-combinator-backed-ole-delivers-luxury-fashion-items-in-50-minutes/",
  "title": "Y Combinator-backed Ole delivers luxury fashion items in 50 minutes | TechCrunch",
  "snippet": "The app allows you to browse and shop at nearby luxury stores, including Miu Miu, Acne Studios, Isabel Marant, Fleur du Mal, Lisa Yang and more.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-11-09T07:15:57-08:00",
  "extractedText": "Ole (pronounced “o-lay”), an on-demand fashion app that promises to deliver designer clothing to you in less than an hour, recently closed a $1.5 million funding round, the company exclusively told TechCrunch. This brings the total amount raised to $2 million — Ole secured $500,000 from Y Combinator last year. Ole makes it easy for last-minute shoppers to purchase outfits in time for special occasions, vacations or events. The app allows you to browse and shop at nearby luxury stores, including Miu Miu, Acne Studios, Isabel Marant, Fleur du Mal, Lisa Yang and more. The company plans to use the new capital to further develop the product as well as partner with more brands to expand its fashion offering. Investors that participated in this round include AI Global, Goodwater Capital and Light Ray Ventures, as well as Spring Studios CEO Giuseppe Stigliano and Gad Allon, professor of operations, information and decisions at the Wharton School. There are a few significant differences between Ole and other fashion delivery apps. For instance, Ole allows you to return clothes as soon as they’re delivered. Ole’s “Try At Home” service is meant to feel like the typical in-store fitting room experience but more convenient since you’re at home. You can select multiple sizes of one item and, once delivered, the messenger waits up to 15 minutes for you to come back down and return the items you don’t want. The delivery person won’t leave until you sign off on the transaction. You pay for the items you keep in addition to a $5 delivery fee. When it comes to online shopping, returns are a huge hassle for most customers, resulting in wasted time out of your day and delayed refunds. Decreasing the return cycle from weeks to an hour improves the experience for customers and retailers alike. According to a 2022 survey, returns cost U.S. online retailers 21% of a product’s cost value. Image Credits: Ole Another aspect of Ole that stands out is it guarantees same-day delivery in just 50 minutes. For reference, London-based competitor NIFT (Need It For Tonight) promises delivery within 90 minutes. Plus, Ole messengers deliver items on bicycles in order to promote sustainability, a refreshing change for an industry responsible for around 10% of global greenhouse gas emissions. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Messengers are vetted based on “level of service and interest in fashion,” co-founder and CEO Alon Hendelman explained. Fifty percent of the delivery team are women, and Ole pays them “higher than the market standard,” he said, yet didn’t specify the amount. “As our mission is to provide an amazing experience from online to on-ground, Ole’s messengers are trustworthy contractors we select carefully,” Hendelman added. Image Credits: Ole Regarding Ole’s business model, the company takes a 25% commission from retail partners for every order. The average order value (AOV) is $450, Hendelman told us. “About 40% of our users are loyal and coming back for repeat purchases. These are highly valuable customers who frequently shop in high AOV,” he boasted. On the long-term roadmap, Ole wants to launch a live chat capability for users to contact customer service reps and get styling recommendations and assistance. It also wants to integrate AI-powered personalized recommendations. Hendelman founded the company in 2021 with his longtime friend, Gal Aharon (CMO). They previously started Engie together, a car diagnostics app and mechanic marketplace. His cousin Omer Hendelman (COO), former vice president of operations at delivery startup Avo, is also on the founding team. Hendelman and his wife conceptualized the idea for Ole when ordering food on a delivery app. “[My] wife asked, ‘How come I can get a burger in 25 minutes, yet if I am ordering from the boutique store around the corner, it takes days to arrive?’ That made us see the gap and opportunity in fashion shopping,” Hendelman remarked. “While every other segment made huge advancements with on-demand deliveries — pharmaceuticals, food, groceries — fashion has not changed. And ",
  "wordCount": 1207,
  "author": "Lauren Forristal",
  "hash": "61f77bc825eec869"
}