{
  "url": "https://techcrunch.com/2025/03/24/ai-creation-platform-arcade-expands-from-jewelry-to-home-goods/",
  "title": "AI creation platform Arcade expands from jewelry to home goods | TechCrunch",
  "snippet": "Arcade, a generative AI marketplace for designing jewelry, is expanding its offerings to include home goods, starting with rugs.",
  "domain": "techcrunch.com",
  "publishedDate": "2025-03-24T12:00:00-07:00",
  "extractedText": "Arcade, a generative AI marketplace for designing jewelry, is expanding its offerings to include home goods, starting with rugs. The company on Monday also introduced a new feature called “Match My Room,” which allows users to upload a photo of their room so their design complements the existing colors and style. Alongside this expansion, Arcade announced its $25 million Series A funding round, bringing the total amount raised to $42 million. Similar to Arcade’s jewelry design generator, the rug creation tool leverages Midjourney and Stable Diffusion. Users select the rug material and then enter a text prompt to describe the desired design. Once the design is generated, it’s then paired with a manufacturer, who will send the creator a free sample for approval before purchasing. Based on our testing, rugs start at around $400 for a 3×9 hand-tufted wool option, which is the most affordable material. Prices increase for higher-end materials such as cashmere, alpaca, and mohair. However, Arcade claims to offer more affordable options than luxury rug retailers that charge thousands of dollars. Image Credits:Arcade The “Match My Room” feature allows users to upload a photo of their space. While the AI analyzes color matching, it can’t successfully replicate patterns from other decor items in the image, like pillows and blankets. Overall, though, it’s a useful tool for ensuring the rug’s color accents tie in with other furniture. For users looking to create designs for pure enjoyment, Arcade offers “Dream Boards,” which function similarly to Pinterest boards, showcasing products with similar themes, such as Hollywood-inspired earrings. Users can also browse other Dream Boards and make purchases. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Additionally, Arcade has a seller program, allowing people to earn a 5% commission for each sale of their product, an increase from the previous 2.5%. Users can earn even more by joining Arcade’s affiliate program. The company recently launched a new entrepreneur program aimed at helping content creators unlock higher commission rates. Major media outlets and influencers with over 25,000 followers are encouraged to sign up by emailing Arcade’s marketing team. Despite launching its beta jewelry offering only in September 2024, Arcade claims to have generated 650,000 jewelry designs. But the company didn’t disclose how many users are interested in purchasing these designs, nor has it revealed the commission earnings of sellers. Arcade is spearheaded by Mariam Naficy, who previously founded cosmetics retailer Eve and design marketplace Minted. The Series A round was led by Laura Chau (Canaan Partners), with participation from Kirsten Green (Forerunner), April Underwood (Adverb Ventures), and Sol Bier (Factorial Funds). The new capital will be allocated toward hiring, platform development, and introducing new product categories like ceramics and pillows. Naficy has previously mentioned to TechCrunch that additional categories may include apparel and leather goods. According to its website, chain belts are also next. Arcade previously raised $17 million from Ashton Kutcher (Sound Ventures), Offline Ventures, and Reid Hoffman (LinkedIn co-founder). Other investors include Inspired Capital, Torch Capital, and David Luan, CEO of Adept AI Labs and former vice president of engineering at OpenAI, among others. This story was updated to include more investors. Topics AI, Arcade, Canaan Partners, commerce, Funding, Generative AI, Series A, Startups Lauren Forristal Lauren covers media, streaming, apps and platforms at TechCrunch. You can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The mo",
  "wordCount": 856,
  "author": "Lauren Forristal",
  "hash": "630e14960b66e222"
}