{
  "url": "https://techcrunch.com/2021/08/20/daily-crunch-51/",
  "title": "Daily Crunch: Alerzo lands $10.5 million Series A for digitizing Nigeria's mom-and-pop stores | TechCrunch",
  "snippet": "As consumers increasingly rely on chatbots and automated agents to search for and compare products, Kuruvilla said brands will need software",
  "domain": "techcrunch.com",
  "publishedDate": "2021-08-20T15:10:28-07:00",
  "extractedText": "To get a roundup of TechCrunch’s biggest and most important stories delivered to your inbox every day at 3 p.m. PDT, subscribe here. Hello and welcome to Daily Crunch for August 20, 2021. The week is finished, but our work to catch up with the torrent of technology, startup and venture capital news is not. Today we have software companies investing in hotels, profitable scooters, at-home rowing machines and TikTok radio? Oh, and apparently Elon is building a robot. It’s a great group of stories! — Alex The TechCrunch Top 3 Microsoft backs OYO: A while back TechCrunch broke the news that Microsoft might back Indian hotel upstart OYO. It was a bit of a wild story, as it didn’t seem to make that much sense. Well, the deal happened. Microsoft has invested $5 million into the company at a $9.6 billion valuation. Notably, that is only a slight discount from the company’s old $10 billion valuation. Next up for OYO is an IPO, we presume. Bird shows improving scooternomics: American scooter company Bird is going public via a SPAC — more here — and we got a look at the company’s most recent financial performance. In short, a shake-up of its operating model has improved its economics, even if the company still has a long way to go to turning a real profit. China shakes up its data privacy rules: For companies, that is, not the state; don’t expect the CCP to start respecting privacy anytime soon. But for companies in the country, a strict new law called the Personal Information Protection Law is coming into effect November 1. Per TechCrunch, the new set of rules will require “app makers to offer users options over how their information is or isn’t used, such as the ability not to be targeted for marketing purposes or to have marketing based on personal characteristics.” Startups/VC Alerzo raises $10.5M to digitize Nigeria’s economy: Nigeria’s expanding startup scene got another boost today with Alerzo’s latest round. The “B2B e-commerce retail” startup wants to help bring the country’s informal economy online. According to TechCrunch that part of the Nigerian economy is worth some $100 billion. São Paulo-based QuintoAndar puts points on the board for Brazil: What does one do after raising a $300 million round? Well, if you are a Brazilian property technology company, you raise another $120 million. That’s what QuintoAndar just did, at an eye-popping $5.1 billion valuation. The company connects demand and supply in the country’s rental and home markets. For more on Africa’s startup market, head here. And if you want more notes on Brazil, we’ve got you covered. Breef wants to connect brands and agencies: Normally we’d try to make a pun about how we hope that this startup’s life is not, ahem, breef, but we’re more mature than that. Instead, we’ll note that the Greycroft-backed company just raised $3.5 million, and it connects teams at boutique agencies with larger, more long-term contracts with brands than what most freelance platforms offer. Cardiomatics does just what it says on the tin: Yes, Cardiomatics is an electrocardiogram-reading automation company, like you surmised from its name. And it just loaded its accounts with $3.2 million. The company helps “GPs and smaller practices offer ECG analysis to patients without needing to refer them to specialist hospitals,” TechCrunch reports. Rutter is building the Plaid of e-commerce data: API-delivered startups are hot these days. Connecting various services in a particular niche via API is a popular idea as well. And e-commerce is booming. At the intersection of those three trends is Rutter, which just raised $1.5 million and is building a “unified e-commerce API that enables companies to connect with data across any platform.” Very cool. If you need more startup news, we have just what you require on this week’s Equity podcast. 4 common mistakes startups make when setting pay for hybrid workers In a recent survey, 58% of workers said they plan to quit if they’re not allowed to work remotely. Startups that don’t offer employees work-from-home flexibility are at a competitive disadvantage, but figuring out how to pay hybrid workers raises a complex set of questions: Should you localize salaries for workers in different areas? How should you pay workers who have the same job when one is WFH and the other is at their desk? Are you being transparent with your staff about how their compensation is set? 4 common mistakes startups make when setting pay for hybrid workers (Extra Crunch is our membership program, which helps founders and startup teams get ahead. You can sign up here.) Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, me",
  "wordCount": 1653,
  "author": "Alex Wilhelm",
  "hash": "670f9edd2f7b0739"
}