{
  "url": "https://techcrunch.com/2025/02/04/google-and-deepmind-alums-raises-10m-for-qee/",
  "title": "AI agents for e-commerce startup, founded by Google and DeepMind alums, raises $10M seed | TechCrunch",
  "snippet": "# AI agents for e-commerce startup, founded by Google and DeepMind alums, raises $10M seed. The startup has raised $10 million to scale its platform, which provides autonomous AI agents for e-commerce businesses. Qeen.ai’s thesis is that this could grow if the e-commerce processes were run better. Q",
  "domain": "techcrunch.com",
  "publishedDate": "2025-02-04T00:06:40-08:00",
  "extractedText": "AI is changing how we shop online, making our experiences more personalized. Smart assistants recommend products, negotiate deals, and even handle customer service. Big retailers and smaller businesses are using AI to improve search, supply chains, and checkout. If AI companies (and their investors) have their way, shopping will soon be focused on chatting with an assistant, with businesses automating everything behind the scenes. Dubai-based Qeen.ai (stylized as qeen.ai) is working to make this a reality in the Middle East and beyond. The startup has raised $10 million to scale its platform, which provides autonomous AI agents for e-commerce businesses. Prosus Ventures, a major e-commerce investor, led the seed round, which is one of the largest not only in the Middle East’s AI industry but also in MENA overall. The VC believes Qeen.ai is well positioned to bring AI-driven automation to merchants as AI agents reshape online marketplaces. Founders Morteza Ibrahimi (CEO), Ahmad Khwileh (CTO), and Dina Alsamhan (CBO) started Qeen after years of working on AI at Google and DeepMind. Ibrahimi, in an interview with TechCrunch, said that they honed in on e-commerce in part opportunistically: All three had worked at Google Ads in various roles during their time with the search giant, and they saw firsthand how other alums built highly successful e-commerce businesses. On top of their AI expertise, the trio knew how to run ads and optimize SEO exceptionally well and thought it could be a strong combination. Google and DeepMind background E-commerce has been steadily growing for years, but apart from certain spikes (particularly during holiday periods), it still accounts for between 15% and 20% of retail sales (even in a mature market like the U.S. it was only just over 16% as of the last quarter, per the U.S. Census Bureau). Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Qeen.ai’s thesis is that this could grow if the e-commerce processes were run better. Success in e-commerce, they believed, should be about great products and operational efficiency — not just who can game the ad system best. That insight led them to build a platform that helps e-commerce sellers grow without relying on ads as their primary driver. The global e-commerce market is expanding fast, driven by changing consumer behavior, digital payments, and better logistics. In MENA, the market is expected to hit $50 billion by 2025, with Saudi Arabia and the UAE leading the growth. Qeen.ai is tapping into this boom by developing AI-powered marketing agents designed for e-commerce businesses across MENA. These fully automated agents handle content creation, marketing, and conversational sales, allowing small and midsized merchants to compete without relying on expensive agencies or deep ad expertise. Unlike traditional solutions, Qeen’s AI continuously learns from consumer interactions using its proprietary RL-UI technology, refining marketing strategies in real time for better results. From Google ads to AI-driven e-commerce While AI-powered sales and customer service tools often struggle with high churn rates, as businesses frequently switch platforms, Qeen.ai claims to see stronger retention in e-commerce and marketing. Ibrahimi attributes this to how deeply Qeen.ai’s AI agents integrate into merchants’ workflows, making them a core part of daily operations rather than a replaceable tool. A key feature driving engagement is dynamic text personalization, which adjusts content based on user behavior and device type. For example, an iPhone user might see product details in bullet points for quick reading, while a laptop user gets a detailed paragraph. Since launching its Dynamic Content agent in Q2 2024, Qeen.ai has served over 15 million users, generated 1 million SKU descriptions, and helped merchants increase sales by 30%, according to the company. “We worked with a client to optimize their content and SEO. After using our AI plugins, their search volume increased by 40%, and their Google ranking improved from 22 to 18 — all with zero manual effort. The e",
  "wordCount": 1383,
  "author": "Tage Kene-Okafor",
  "hash": "683636266889fe6e"
}