{
  "url": "https://techcrunch.com/2025/05/21/amazon-rolls-out-short-form-ai-powered-audio-product-summaries-for-select-items/",
  "title": "Amazon rolls out short-form AI-powered audio product summaries for select items | TechCrunch",
  "snippet": "Amazon is testing short-form AI-powered audio product summaries on select product pages, the company announced on Wednesday.",
  "domain": "techcrunch.com",
  "publishedDate": "2025-05-21T09:04:27-07:00",
  "extractedText": "Amazon is testing short-form AI-powered audio product summaries on select product pages, the company announced on Wednesday. The audio summaries are voiced by what Amazon calls “AI-powered shopping experts” that discuss key product features, customer reviews, and information from across the web. The new AI product summaries can be accessed by tapping the “Hear the highlights” button in the Amazon Shopping app. Amazon will test the feature on products that typically require consideration before purchase, the company says. The idea behind the feature is to help Amazon customers save time while shopping and get important information through a conversational, discussion-style format. “The feature makes product research fun and convenient — it’s like having helpful friends discuss potential purchases to make your shopping easier, even if you’re multitasking or on the go,” the company wrote in their blog post. Image Credits:Amazon The summaries are currently available on select products to some U.S. customers. Amazon plans to roll out the feature to more products and to additional U.S. customers in the coming months. The company explains that the feature uses large language models (LLMs) to generate scripts by pulling from customer reviews and information from the web, and then transforms this content into short-form audio clips. Amazon says the new feature joins its current suite of AI-powered shopping features, which includes Rufus, its generative AI shopping assistant, and Interests, an AI feature that monitors new products that match your interests. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Amazon isn’t the only tech giant that’s leveraging short-form AI-powered audio to help users get informed in a quick, efficient way. Last year, Google’s NotebookLM rolled out Audio Overviews, a feature that gives users the ability to generate a podcast with AI virtual hosts based on documents they have shared with the AI research assistant, such as course readings or legal briefs. Topics AI, Amazon Aisha Malik Consumer News Reporter Aisha is a consumer news reporter at TechCrunch. Prior to joining the publication in 2021, she was a telecom reporter at MobileSyrup. Aisha holds an honours bachelor’s degree from University of Toronto and a master’s degree in journalism from Western University. You can contact or verify outreach from Aisha by emailing aisha@techcrunch.com or via encrypted message at aisha_malik.01 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker This is Uber’s new robotaxi from Lucid and Nuro Sean O'Kane Lego Smart Bricks introduce a new way to build — and they don’t require screens Amanda Silberling Hacktivist deletes white supremacist websites live onstage during hacker conference Lorenzo Franceschi-Bicchierai",
  "wordCount": 668,
  "author": "Aisha Malik",
  "hash": "6c87054d1c1a3f73"
}