{
  "url": "https://techcrunch.com/2024/04/21/tiktok-shop-expands-its-secondhand-luxury-fashion-offering-to-the-uk/",
  "title": "TikTok Shop expands its secondhand luxury fashion offering to the UK | TechCrunch",
  "snippet": "For the past two weeks, X has been flooded with AI-manipulated nude images, created by the Grok AI chatbot. An alarming range of women have",
  "domain": "techcrunch.com",
  "publishedDate": "2024-04-21T16:01:07-07:00",
  "extractedText": "TikTok Shop, TikTok’s social commerce marketplace, is launching a secondhand luxury category in the U.K., putting it in closer competition with The RealReal, Vestiaire Collective, Depop, Poshmark, and Mercari, among others. The offering has already existed in TikTok Shop U.S. for over six months. The new category allows customers in the U.K. to purchase pre-owned high-end clothing, designer handbags, and other accessories, all without leaving the TikTok app. At launch, only five U.K. brands are available, including Sellier, Luxe Collective, Sign of the Times, HardlyEverWornIt, and Break Archive. Since launching TikTok Shop in 2022, the platform has sold around $1 billion or more worth of products. However, despite its success, some argue that TikTok Shop is ruining the short-form video-sharing app, claiming fakes and poor-quality products are flooding the marketplace. Counterfeits are the biggest risk when buying pre-owned luxury goods online, with even the largest e-commerce giants (Amazon, eBay, and others) facing authenticity issues. Like all resale marketplaces, TikTok Shop has an anti-counterfeit policy that guarantees a full refund if a seller is proven to have sold a counterfeit product. Bloomberg recently reported that the company is in talks with luxury goods company LVMH to help crack down on counterfeiting. All secondhand brands on TikTok Shop U.S. are required to have certificates from third-party authenticators. TikTok partnered with authentication services Entrupy and Real Authentication to ensure that designer handbags on the platform are genuine. Meanwhile, a TikTok spokesperson told TechCrunch that the five U.K. brands all have their own in-house authentication process. They wouldn’t say when it would begin accepting other secondhand brands. TikTok usage is starting to slow — is TikTok Shop to blame? Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW The launch of TikTok Shop’s secondhand luxury category is a strategic move to tap into the growing market of preowned luxury items. The secondhand luxury market is a thriving multibillion-dollar business, with an estimated $49.3 billion (€45 billion) worth of secondhand designer items sold worldwide in 2023. Additionally, this expansion aligns with the increasing trend of people embracing preloved fashion, and it opens up new avenues for secondhand brands in the U.K. to reach a wider customer base. The popularity of secondhand fashion on TikTok is evident, with over 144,000 TikTok posts using the hashtag #secondhandfashion, which has garnered approximately 1.2 billion views. Today’s announcement arrives on the heels of the U.S. House of Representatives passing a bill that requires ByteDance to sell TikTok or face a ban in the U.S., a bill that appears to be gaining support in the Senate. A ban would be a serious blow to American merchants selling on the app. According to the company, the short video-sharing app generated $14.7 billion for small- to midsize businesses in 2023. US House passes revised bill to ban TikTok or force sale Topics Apps, Commerce, e-commerce, TikTok, TikTok Shop, United Kingdom Lauren Forristal Lauren covers media, streaming, apps and platforms at TechCrunch. You can contact or verify outreach from Lauren by emailing laurenf.techcrunch@gmail.com or via encrypted message at laurenforris22.25 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to ",
  "wordCount": 955,
  "author": "Lauren Forristal",
  "hash": "6dd499345bc0e270"
}