{
  "url": "https://techcrunch.com/2023/07/25/wayfairs-new-app-uses-generative-ai-to-transform-your-space/",
  "title": "Wayfair's new app uses generative AI to transform your space | TechCrunch",
  "snippet": "Decorify, a new web-based app from Wayfair, uses generative AI to transform your apartment and home spaces in various styles.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-07-25T05:00:14-07:00",
  "extractedText": "Generative AI is good for more than marketing copy and anime-style avatars — or so Wayfair wants you to think. Today, Wayfair launched a new app with a cutesy name, Decorify, that lets customers create “shoppable,” “photorealistic” images of rooms in their homes or apartments in new styles. After uploading a picture of the space they want to redesign, the app enables them to transform the space with styles like “Modern Farmhouse,” “Bohemian” or “Industrial.” According to Shrenik Sadalgi, director of R&D at Wayfair, the infrastructure behind Decorify has been in the works for some time. But the advent of image-generating AI diffusion models such as OpenAI’s DALL-E 2 brought it over the finish line, improving the quality of the generated images to the point where Wayfair saw it fit to ship. “Our hypothesis is that the quality is good enough to drive value for a customer,” Sadalgi told TechCrunch in an email interview. “Wayfair’s customers are looking for, and love, visual inspiration — they get that from our rich lifestyle imagery that we custom produce and curate. Now they can blend that with their spaces.” Decorify, which doesn’t require downloading a dedicated app, is pretty easy to use. After launching Decorify on the web (on desktop or mobile) and logging in with a Google or GitHub account or an email address, the app prompts you to upload a photo of your space. For now, Decorify only supports living rooms, disappointingly — Wayfair says that’ll change in the future. Once you’ve uploaded a photo, Decorify prompts you to choose a style: “Traditional,” “Modern,” “Farmhouse,” “Bohemian,” “Rustic,” “Industrial,” “Glam” or “Perfectly Pink.” Then, the app “transforms” your room, replacing the fixtures, rugs and furniture in the photo with products in the selected style. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW The experience brings to mind REimagineHome, an app that similarly taps generative AI to restyle images of spaces. Interior AI is another along those same lines. What Wayfair brings to the table, then, isn’t novel technology necessarily, but the might of its brand and massive online inventory. Image Credits: Wayfair “Combining the visual discovery and inspiration with shoppable products from an extensive catalog that covers everything home, Decorify has the potential to drive significant value for Wayfair customers,” Sadalgi added. “Wayfair hopes Decorify can kick off a camera-first shopping paradigm for visual discovery where the journey simply starts with clicking an image.” In my brief testing, Decorify worked well enough — style depending. I had the best luck with “Rustic” and “Modern,” which, true to the app’s sales pitch, replaced my pictured couch, TV, entertainment console, table, chairs, siding and even ceiling with items you might find in Wayfair’s catalog. Image Credits: Wayfair Decorify isn’t perfect, though. The products in the transformed photos aren’t actually real — they’re only meant to serve as inspiration. Decorify provides a list of the best matches available on Wayfair, but the suggestions weren’t often that close in my experience. And, as I alluded to earlier, Decorify struggles to apply some of the styles. “Pink” gave my furniture a very uneven coat of bright pink, while “Glam” mistook a table for some kind of Victorian-era fainting couch. One of Decorify’s failure cases. Sadalgi stressed that this is an early version of the tech that’ll improve with time. Currently, Decorify is using Stable Diffusion, the open source diffusion model from Stability AI, as the base model. But Wayfair plans to gradually fine-tune the model on its in-house image data. “We’re confident that we can fine-tune the model using proprietary Wayfair brand data so the results look a lot closer to a lifestyle photo that you see on Wayfair today, with more creative control over the style and one-to-one correlation with real products,” Sadalgi said. “In the short term, Decorify will support more rooms and improve the shoppability … We plan to offer swapping out furniture with specific furniture you may have alread",
  "wordCount": 1257,
  "author": "Kyle Wiggers",
  "hash": "6eef734069caba5e"
}