{
  "url": "https://techcrunch.com/2022/04/21/jarvis-ml-snags-16m-to-help-companies-personalize-their-products/",
  "title": "Jarvis ML snags $16M to help personalize companies' products",
  "snippet": "Jarvis ML, a platform offering an AI-powered personalization engine to brands selling products, services and experiences, today announced that it raised $16",
  "domain": "techcrunch.com",
  "publishedDate": "2022-04-21T06:00:34-07:00",
  "extractedText": "Jarvis ML, a platform offering an AI-powered personalization engine to brands selling products, services and experiences, today announced that it raised $16 million in a seed round led by Dell Technologies Capital. In an interview with TechCrunch, CEO Rakesh Yadav said that the new capital will be used to grow Jarvis ML’s R&D and sales and marketing teams to “accelerate product development and market penetration.” As the pandemic spurred brands to spruce up — or create from scratch — online presences, the value of personalization came into acute focus. Accustomed to Netflix- and Amazon-like tailored product recommendations, customers began to demand the same from companies of all sizes. According to McKinsey, 71% of shoppers now expect businesses to deliver personalized interactions, while 76% get frustrated when this doesn’t happen. Some research — particularly from customer analytics vendors, unsurprisingly — suggests that personalization is a worthwhile investment. Forty percent of consumers responding to one survey said they’ve purchased something more expensive than originally planned because of personalized experiences. But creating this type of personalization can be challenging from a technical standpoint. That’s why Yadav founded Jarvis ML in 2021. A former senior staff engineer at Google, where he led the development of the machine learning platforms behind Google Payments and Google Ads, Yadav sought to create a product that could enable companies to turn data into brand engagements, like marketing campaigns or customized web experiences. “The pandemic has accelerated the shift in consumer purchasing trends moving online. That also means that online recommendation strategies are mission critical for enterprises to adapt to this changing consumer paradigm,” Yadav told TechCrunch via email. “Giant tech companies like Amazon, Airbnb, Google and Facebook use machine learning to delight consumers and restrict the independence of the growth-stage and mid-market companies who end up being relegated to supplier or fulfillment roles in the tech giant ecosystems. Jarvis ML enables these companies to leverage data they already have to reduce the dependence on tech giants while scaling sustainably.” A screenshot of Jarvis ML’s website. Yadav describes Jarvis ML as a fully managed “machine learning-as-a-service” solution designed to allow companies to quickly deploy a personalization engine to their products. The platform leverages algorithms to learn sales and inventory patterns in data that companies feed to it, also building prediction, pricing and promotion models that enable those companies to personalize their websites, apps and advertising as well as concierge services and customer service. Biases of all kinds have been found to arise from personalization engines. Often, they’re a result of data imbalance — a group of customers is underrepresented in the data that’s used to develop the engine. Last year, LinkedIn said it fixed an issue that caused its connection suggestions to become less accurate for people who used the service less often than others. Other research has suggested that, on e-commerce sites, recommendation systems can treat economically disadvantaged customers unfairly compared to customers who make lots of purchases. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Yadav didn’t address the bias question directly, but emphasized that Jarvis ML customers “own their data” and that the platform optimizes for revenue across different shoppers’ “lifetime values, preferences and tastes.” “Jarvis ML is just a platform which helps leverage that data into actionable brand engagements, like marketing campaigns or personalized website experiences,” Yadav explained. “By profiling cohorts of customers … Jarvis ML can provide highly relevant recommended products, services and experiences to maximize sales. Our system picks best models from a pool of such taste-based models and picks the best model that performs for our enterprise customers.” In the recommendation engine market — a market that could be worth $",
  "wordCount": 1296,
  "author": "Kyle Wiggers",
  "hash": "72a8e27b90ea6f19"
}