{
  "url": "https://techcrunch.com/2014/11/06/strut-launch/",
  "title": "Mobile Fashion App Strut Is Like Tinder For Discovering And Sharing New Outfits | TechCrunch",
  "snippet": "It uses machine learning to refine the items it presents to users and improves its targeting over time. The idea is that Strut will get to know",
  "domain": "techcrunch.com",
  "publishedDate": "2014-11-06T07:00:03-08:00",
  "extractedText": "Back in August I wrote a little story about a Thiel Fellow named Mark Daniel who had raised $1.5 million to create a mobile fashion app called Strut. Well after a few months the app is now available for download on the Apple App Store and ready to help users socially discover new fashions and create outfits together. Strut is centered around the idea of helping users discover new apparel via mobile that they might want to buy. It does this by presenting them with 50 new pieces of clothing each morning, with a Tinder-like mechanism for swiping left on items they don’t like and swiping right on those they do. It uses machine learning to refine the items it presents to users and improves its targeting over time. The idea is that Strut will get to know their tastes better and provide clothing options more to their liking the longer that they use the app. If Strut were just about helping users to find new clothes, the app wouldn’t be that interesting. What makes it fun is the ability to create outfits around those finds and sharing them with others as part of some collaborative social fashion mashup. In addition to swiping right or left, users can also swipe up. That enables them to build a whole ensemble of clothing around the item. Find a shirt you like? Strut will show you a series of different pants, shoes, and jackets that you can match it up with. Once you create an outfit you can share it with your feed. That feature has been pretty popular with users so far: In the past six weeks since Strut opened its beta period, users are making an average of five or six outfits per week. And they’re spending about 15-20 minutes in the app per day, according to Daniel. Frankly it’s a little early to tell how successful the social aspects of the app will be, in part because there are a limited number of users in the company’s beta. But it’s easy enough to find Facebook and Twitter connections already using the app. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW And in theory at least, following people is just one more way to get exposed to new fashions that others share. Users can also share with their social feeds on other apps like Pinterest, Facebook, or Twitter. But the main point of Strut is that it’s a new way to enable mobile commerce specifically around clothing and fashion — which is an area that many have attempted but few have excelled at to date. On that front, Strut still has a lot of work to do. While it surfaces tens of thousands of items from a number of different retailers, if a customer wants to buy something, the app redirects them into the retailer’s mobile web experience. They then need to fill out credit card and shipping information for each individual retailer, which can be a hassle. So far Strut has succeeded in making some affiliate revenue, but to be really great, it will need to integrate one-click purchasing. To be fair, that’s something Daniel says the team is working on. Other features that Strut could add in future versions include messaging between users and the ability to create collections around certain types of clothing. For now though, the team is just happy to get the app in users’ hands and see what they do with it outside its beta. Topics Strut, TC Ryan Lawler Senior Reporter, TC+ Ryan Lawler was a technology writer for TC+ focused on the B2B fintech market. He most recently served as Head of Content for Samsung Next and has covered business and technology for publications that include GigaOM, Contentinople, and Light Reading. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Found",
  "wordCount": 1076,
  "author": "Ryan Lawler",
  "hash": "76bce188b6d8ee3f"
}