{
  "url": "https://techcrunch.com/2025/05/20/google-adds-ai-powered-shopping-features-for-discovery-and-easy-check-out/",
  "title": "Google introduces Shop with AI Mode with price tracking, agentic checkout, and virtual try-on | TechCrunch",
  "snippet": "Google announced at Google I/O 2025 that it is adding multiple AI-powered features for online shoppers, including a new visual panel in",
  "domain": "techcrunch.com",
  "publishedDate": "2025-05-20T10:45:00-07:00",
  "extractedText": "Google announced at Google I/O 2025 that it is adding multiple AI-powered features for online shoppers, including a new visual panel in Google Search’s AI Mode, personalized price tracking notifications with agentic checkout, and virtual try-ons. The new shopping experience is rolling out in AI Mode, where shoppers can view product visuals and other AI-powered guidance that leverages product data. For instance, if you search for a travel bag, the results will show you a panel of listings and images matched to your tastes that you can easily scroll through. And, if you want to narrow things down using a more specific query, such as “bags suitable for a trip to Portland, Oregon, in May,” AI Mode will run multiple simultaneous queries — which Google describes as a query “fan-out” — to figure out the best option for both long journeys and rainy weather. Image Credits:Google It will then update the panel of options to showcase those that are waterproof and those with easy access to pockets. As you continue to refine your query or add other specific filters for shopping, the visual panel on the right-hand will update to show new options. These features will arrive in the U.S. in the months ahead, says Google. The company is also adding a new price tracking feature with agentic checkout in the months ahead. Soon, consumers will be able to tap “track price” on any Google product listing. You’ll then be able to select a product, filtering for things like color and size, and specify the amount you want to spend on that item. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Image Credits:Google Google will track the price and send you a notification when the price matches what you were looking to spend. After confirming the details, you can opt to buy the item by tapping a new “buy for me” option. After clicking the buy button, Google adds the item to the checkout cart on the merchant’s website and uses your Google Pay details to secure the purchase. This feature will initially launch with product listings in the U.S., Google says. Another new feature will allow shoppers to try on clothes virtually. While Google has offered something similar to virtual try-on tech, the feature only involved showing items on a diverse range of models’ bodies. Now, the company will allow you to try clothes on yourself, too. To do so, you’ll upload a full-length photo under good lighting where you’re wearing fitted clothing. Google says it’s using a new diffusion model for fashion to understand the human body and how different materials would fold and stretch on different people. Image Credits:Google Google’s virtual try-on feature is available to users in the U.S. under Google’s Search Labs starting today. Users who opt in will see a virtual try-on button next to product listings for shirts, pants, skirts, and dresses. You’ll also be able to share your look with friends or tap to shop similar styles. Google’s range of new AI shopping technology will challenge the work of other startups to various degrees. Notably, companies like Thrive-backed Doji and Stellation Capital-backed Vybe are working on technology to make virtual try-on easy and fun for users. Meanwhile, startups like Daydream, Cherry, and Deft have used AI to solve for product discovery. Plus, general-purpose AI-powered chatbots like ChatGPT and Perplexity have also added shopping features in recent months. Topics AI, Commerce, Google, Google I/O Ivan Mehta Ivan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web. You can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech ",
  "wordCount": 911,
  "author": "Ivan Mehta",
  "hash": "8007815fc804d861"
}