{
  "url": "https://www.rila.org/retail-innovation-center/retail-technology-quarterly-q3-october-2021",
  "title": "Retail Technology Quarterly - Q3",
  "snippet": "RILA's innovation team looks at three trends driving retail into the future: supply chain automation, artificial intelligence, and the metaverse.",
  "domain": "rila.org",
  "extractedText": "Retail Technology Quarterly - Q3 Retail Technology Quarterly : October 2021 After a turbulent end of summer with renewed uncertainty related to the Delta variant of Covid-19, the pandemic continues to reinforce the need for agile and creative ways to keep retail thriving through adversity. In this RTQ, we focus on three trends: Supply Chain Automation; AI Driving the Business; and The Metaverse. Supply Chain Automation Supply Chains are at the crux of all retail, both brick-and-mortar and direct-to-consumer depend on accurate timing and swift delivery. So, when supply chains are experiencing labor shortages it causes prolonged delays, increased expenses, and overall frustrations. Over the past 18 months, retailers have been plagued by supply chain challenges and are looking to technologies to help alleviate some of that stress. Automation technologies can be deployed across distribution centers, factories, and ports to increase efficiencies and manage expenses. Chewy recently announced plans to open three automated fulfillment centers over the next 14 months as a response to labor shortages. RILA’s 2021 Supply Chain Startup Innovation Award winner, SVT Robotics, helps to integrate automated systems with no-code solutions creating an easier entry point for robotic solutions. For more sessions focused on Supply Chain Transformation and technologies, revisit the RIC Stage to see speakers from Microsoft, Intel, RILA, eMarketer, and more. AI Driving the Business While artificial intelligence (AI) is supporting transformation in supply chain automation and transparency (Note Gap’s acquisition of former Startup Network Member CB4); technologies powered by AI can be applied to nearly every aspect of the business. Spending by the retail industry on AI in 2021 has exceeded $11 billion, edging out banking for the top spot according to IDC forecasts. This growth was largely due to the continued rise of eCommerce shopping, demand for greater personalization, improved search, and inventory management. AI is a key player in digital strategies that are creating a high-end experience outside of physical stores. On the consumer side, we see it being used to create augmented “try-on” experiences allowing shoppers to explore collections and receive product recommendations, as well as being used to power social media interactions. Etsy is utilizing AI to create better search graphing, connecting search terms that may not match exactly, but are related to give shoppers better results to browse. AI offers abundant use-cases to create a modern shopping experience, but retailers will have to continue to refine the experience and relationship of AI across channels. The Metaverse Is The Metaverse the next frontier of retail? The term refers to the 3D space in which the digital and physical worlds intertwine. While most industries are in the very early stages of utilizing these technologies, many predict (Check out The Verge’s interview with Mark Zuckerberg and the subsequent name change) it will become a part of regular business. Companies like Gucci and Vans are partnering with the Roblox platform to interact with their customers in new ways, creating products and virtual experiences to explore. Another foray into The Metaverse might be selling NFTs, pieces of digital content linked to the blockchain, which luxury brands like Givenchy are selling. While we’ve only explored The Metaverse here in terms of consumer interaction, leaders on this technology predict it will also become commonplace among the workforce as a new way to host meetings and events. While the technology to make the Metaverse a reality is still in early stages, the hype is picking up steam, especially amongst Gen Z, and is worth keeping an eye on as it continues to develop and intertwine with our daily lives. At RILA’s Retail Innovation Center, we are working to help leading retailers navigate the challenges of transformation by connecting retailers with startups, investors, and technologies that will drive retail in the 21st century. Looking for more? Visit the RIC’s Insights on-Demand page for blogs, webinars, and startup pitch videos. For any questions about the Retail Innovation Center, please reach out to Nicholas Ahrens, Senior Vice President, Strategy, Innovation, and Content.",
  "wordCount": 662,
  "hash": "812172416bb1d412"
}