{
  "url": "https://hbr.org/podcast/2023/05/how-generative-ai-changes-strategy",
  "title": "How Generative AI Changes StrategyNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuClose menuSearch",
  "snippet": "In this episode, *How Generative AI Changes Strategy,* HBR editor in chief Adi Ignatius speaks to Microsoft’s head of strategy Chris Young and Harvard Business School professor Andy Wu. They lay out the technology, its emerging value chains, and its main providers. But the way I think about it is an",
  "domain": "hbr.org",
  "publishedDate": "2023-05-25T16:07:10Z",
  "extractedText": "Skip to content Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Latest Magazine Topics Podcasts Store Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Ask AI Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Close menu Search Please enter a search term Submit Suggested Topics Explore HBR Latest The Magazine Podcasts Store Webinars Newsletters Popular Topics Managing Yourself Leadership Strategy Managing Teams Gender Innovation Work-life Balance All Topics For Subscribers Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Subscribe My Account My Library Topic Feeds Orders Account Settings Email Preferences Log Out Sign In Subscribe Latest Podcasts The Magazine Store Webinars Newsletters All Topics Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive My Library Account Settings Log Out Sign In Your Cart Your Shopping Cart is empty. Visit Our Store Guest User Subscriber My Library Topic Feeds Orders Account Settings Email Preferences Log Out Reading List Reading Lists X Share Podcast HBR IdeaCast / Episode 915 How Generative AI Changes Strategy Play Listen | Podcast loading... Go Back 15 seconds Play Go Foward 15 seconds Share Conversations with experts about the imminent tradeoffs facing senior leaders. Subscribe: Apple Podcasts Spotify RSS All episodes All episodes Details Transcript May 25, 2023 Strategy is about making the future happen, not just reacting to it, according to author Gary Hamel. And with generative artificial intelligence, senior leaders suddenly wield an awesome new tool to change the fortunes of their organizations. The promise of generative AI is more than just a sweet hack to boost productivity and streamline operations. Its deeper potential lies in companies that rethink what they do and conjure brand-new, AI-first products and services. Simply put, generative AI is blasting open new strategic paths to create novel business opportunities, even as it brings serious risks and heightened competition. In this episode, How Generative AI Changes Strategy, HBR editor in chief Adi Ignatius speaks to Microsoft’s head of strategy Chris Young and Harvard Business School professor Andy Wu. They lay out the technology, its emerging value chains, and its main providers. They also break down the key choices and tradeoffs that large and small companies alike will be making in this fast-changing market. This is the fourth and final episode in the special series How Generative AI Changes Everything. Each week, HBR editor in chief Adi Ignatius and HBR editor Amy Bernstein have been hosting conversations with experts and business leaders about the impact of generative AI. Find those episodes on the impact on productivity, creativity, and organizational culture in the HBR IdeaCast feed. And for more on ethics in the age of AI, check out HBR’s Big Idea on implementing the new technology responsibly. HBR EDITOR IN CHIEF ADI IGNATIUS: Chris, you’ve been a tech company CEO. You’re strategy head at Microsoft. You’ve seen a lot of technologies over the years. There’s some that land and we think, “Okay, this is truly transformative, disruptive. This is an inflection point.” In your mind, is that where we are now? Or do we need to wait and see what the impact of generative AI will be on business and on everything? MICROSOFT EXECUTIVE VICE PRESIDENT CHRIS YOUNG: We’re at a place where we see this as truly transformative. I might actually draw a contrast to one of the trends that many people were very excited about in the tech landscape just a little bit over a year ago, which was Web3 and the promise of blockchains, and everything that would happen. But there was definitely a segment of the world that was saying, “Well, interesting, but not sure what the practical applications are here, not sure it’s going to change everything.” No one’s saying that about AI. I think immediately, many of us recognize that this is going to be completely game changing, not only for the tech landscape, but for humanity. ADI IGNATIUS: Welcome to How Generative AI Changes Everything, a special series of the HBR IdeaCast. There are many shorthand definitions of strategy. One that I like is from the author, Gary Hamel, who says that strategy is about making the future happen, not just reacting to it. Well, this sure feels like a time when it’s possible to make the future happen. Generative AI has stormed to the consciousness of practically every business leader, and it’s opening up new strategic paths and new ways to create new businesses. This week, How Generative AI Changes Strategy. I’m Adi Ignatius, editor in chief of Harvard Business Review and your host for this episode. In this special series, we’re talking to experts to find out how this new te",
  "wordCount": 7184,
  "hash": "84fb4002a5724f45"
}