{
  "url": "https://techcrunch.com/2024/01/11/google-cloud-rolls-out-new-gen-ai-products-for-retailers/",
  "title": "Google Cloud rolls out new GenAI products for retailers | TechCrunch",
  "snippet": "Google Cloud today unveiled new GenAI products designed to help retailers personalize their online shopping experiences and streamline their back-office",
  "domain": "techcrunch.com",
  "publishedDate": "2024-01-11T04:00:39-08:00",
  "extractedText": "Google wants to inject a little generative AI into retail. Or to try, at least. To coincide with the National Retail Federation’s annual conference in NYC, Google Cloud today unveiled new GenAI products designed to help retailers personalize their online shopping experiences and streamline their back-office operations. As to whether they perform as advertised, this writer can’t say — TechCrunch wasn’t given the chance to test the new tools prior to this morning’s unveiling. (They’re set to launch sometime in Q1.) But the slew of announcements show, if nothing else, how aggressively Google is attempting to court GenAI customers. One of Google Cloud’s new products, Conversational Commerce Solution, lets retailers embed GenAI-powered agents on their websites and mobile apps — sort of like a brand-specific ChatGPT. The agents have conversations with shoppers in natural language, tailored product suggestions based on shoppers’ individual preferences. Branded chatbots are hardly new. But Google says that “sophisticated” models like PaLM are powering the agents, which can be fine-tuned and customized with retailers’ own data (e.g. catalogs and websites). Complementing Conversational Commerce Solution is Google Cloud’s new Catalog and Content Enrichment toolset, which taps GenAI models including the aforementioned PaLM and Imagen to automatically generate product descriptions, metadata, categorization suggestions and more from as little as a single product photo. The toolset also let retailers generate new product images from existing ones, or to use product descriptions as the basis for AI-generated photos of products. Now, when eBay launched a similar AI-powered product-image-to-description capability a few months back, it didn’t take long before sellers began complaining about its performance — pointing to misleading, unnecessarily repetitive and in some cases downright untruthful text. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW I asked Amy Eschliman, managing director of retail at Google Cloud, what steps Google’s taken, if any, to address concerns around such hallucinations. She didn’t point to specific measures but stressed that Google’s “continuously improving” its tools and that human review is a core part of the Catalog and Content Enrichment workflows. I’d certainly hope there’s human review where the stakes are high. It’s not inconceivable, after all, that a misleading AI-generated image or description in a product catalog could land a retailer in hot water with shoppers — or on the receiving end of false advertising allegations. “Human-in-the-loop is a best practice that helps with enterprise use cases to ensure high-quality, mitigate bias-related risk, improve trust and transparency, improve and continually train the model, while complying with regulatory and business policy,” Eschliman said. In a related announcement today, Google took the wraps off a retail-specific Distributed Cloud Edge device, a managed self-contained hardware kit to “reduce IT costs and resource investments” around retail GenAI. (Google’s long offered Distributed Cloud Edge as a service, but it’s now targeting retailers more directly.) Available in a range of sizes from single-server to multi-server configurations, Google says that the edge cluster is designed to fit into stores from convenience marts and gas stations to fast casual restaurants and grocery stores — powering customers’ GenAI apps. “With the … control plane running locally, Google Distributed Cloud Edge provides retailers non-stop operations even when their location is disconnected from the internet for short periods of time (days),” Eschliman said. “Retailers now have access to a small cluster of Google Cloud-managed nodes that can be conveniently installed in nearly any store. With this fully managed hardware and software, retailers can now run existing software with distributed AI to enable mission-critical operations in the store at all times.” Google says that pricing and availability info will be released in Q1. My question after being pre-briefed on all this wa",
  "wordCount": 1295,
  "author": "Kyle Wiggers",
  "hash": "852c28de6feb1f39"
}