{
  "url": "https://techcrunch.com/2025/02/26/lockscreen-platform-glance-launches-gen-ai-led-shopping-experience-gets-fresh-backing-from-google/",
  "title": "Lock screen platform Glance launches AI-powered shopping experience, gets fresh backing from Google | TechCrunch",
  "snippet": "Companies and startups are trying to solve personalization in the e-commerce world through AI-powered search and agents, starting with tech",
  "domain": "techcrunch.com",
  "publishedDate": "2025-02-26T06:00:00-08:00",
  "extractedText": "Lock screen platform Glance announced today that it is launching a new generative AI-based shopping experience. It will suggest different outfits on a user’s personalized avatar. The company is partnering with Google to use the company’s Gemini models and Vertex AI to deploy the experience. Separately, the company also got fresh backing from Google — which was already an investor — according to people familiar with the matter. Glance and Google didn’t comment on the funding details. Glance said that it is already experimenting with the new-gen AI-powered experience in the U.S. through a new app called Glance AI. The startup plans to roll out this experience to all users in the U.S. and India in the coming months. Google is trying to have more companies use its Gemini and Cloud platforms for AI implementation in India. The company is also investing in startups in parallel. Most recently, it backed the webtoon platform Toonsutra. Glance’s CEO, Naveen Tewari, said that the app’s model understands fashion trends and personalizes suggestions for you. “Think of this experience as looking through a fashion magazine with the latest apparel, where you are the model on each page,” Tewari said. Tewari added that the company wants to build a discovery engine and a feed so you can explore different items — and buy the ones you like the most. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Users who download the app will have to upload a selfie of themselves, select their gender, hair length, and ethnicity, and specify their body type during the onboarding process. Subsequently, the app will generate a model for you using AI. Glance will then show you different looks on your lock screen. You can tap on a button on the lock screen to see some suggestions from the web that match the AI-generated avatar’s apparel. Glance fetches these results from the e-commerce sites it has partnered with. At launch, the company said it has 400 partners. The startup takes a cut if the customer completes a purchase thanks to affiliate links. In the Glance AI app, users can scroll through multiple outfit suggestions and even put them on the lock screen. On the app, apart from apparel, you would also get suggestions about other items present in the scene, such as a guitar or a candle. But at the moment, you can’t purchase them. In the future, users will be able to tune their suggestions using an upvote/downvote-like mechanism along with using chat to find inspiration for a specific look. Glance, which has over 300 million active users in markets like India, Japan, and Indonesia, primarily displays its content on Android-powered phones’ lock screens. While India is the largest user base for the company, it piloted its lock screen solution in the U.S. last year in partnership with Motorola. The company has started making inroads into showing this content on smart TVs as well. Companies and startups are trying to solve personalization in the e-commerce world through AI-powered search and agents, starting with tech giants like Google and Amazon. Glance aims to be an app that inspires users to buy clothes. Topics Apps, Fundraising, Glance, Google, Lockscreen Ivan Mehta Ivan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web. You can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads g",
  "wordCount": 868,
  "author": "Ivan Mehta",
  "hash": "89035c2a6081c980"
}