{
  "url": "https://techcrunch.com/2012/02/05/personalized-ecommerce-is-already-here-you-just-dont-recognize-it/",
  "title": "Personalized eCommerce Is Already Here, You Just Don’t Recognize It | TechCrunch",
  "snippet": "Pinterest will be the first company to nail eCommerce personalization because they understand the importance of having an interface, which",
  "domain": "techcrunch.com",
  "publishedDate": "2012-02-05T12:08:10-08:00",
  "extractedText": "Editor’s Note: This guest post is written by Nir Eyal (@nireyal), a founder of two startups and an advisor to several Bay Area incubators. Nir blogs about technology and behavior design at nirandfar.com. Reading Leena Rao’s recent article on Techcrunch about the personalization revolution, you get the sense that the tech world is waiting for a bus that isn’t coming. Rao quotes well-known industry experts and luminaries describing what needs to happen for e-commerce to finally realize the promise of personalized shopping, a future where online retailers predict what you’ll want to buy before you know yourself. Ironically, Rao and her pundits are missing the zooming racecar that’s speeding by them as they wait for the personalization bus to arrive. That racecar is Pinterest and the new breed of startups marking the beginning of what I call the “Curated Web.” The promise of personalized e-commerce began over 10 years ago with technology pioneered at Amazon. It was then that the mental dye was cast for what eCommerce personalization would look like, an algorithmic solution for matching customer to products. Web watchers came to expect that someday all online retailers would have such algorithms on their sites and the dream of personalized commerce would finally be realized. For over a decade, startups took their best shot at making this apparition a reality. Companies like Hunch tackled the data collection piece of the equation, asking users endless survey questions to determine their tastes and preferences. Google’s Boutiques.com tried to crack the challenges of structuring the data associated with personalized shopping recommendations. Ultimately, these attempts failed. In September, Google shut down Boutiques.com and the founders of Hunch sold their company to eBay, an outcome far short of their IPO hopes. Previous attempts at eCommerce personalization were unsuccessful because those involved failed to realize they were missing one key element, the interface. Curated Web companies are defined by their ability to use new interfaces to collect and structure data better then previous algorithmic solutions. Users Want it All While the tech world waits patiently, expecting the solution to e-commerce personalization to look like Amazon ported to other online retailers, “Curated Web” companies like Pinterest are changing the game by changing the interface. Pinterest will be the first company to nail eCommerce personalization because they understand the importance of having an interface, which matches what the user is there to do, discover stuff they like from across the web. Pinterest has cracked personalization right under everyone’s nose by doing the two things Rao says have yet-to-be invented, data collection and data structuring. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Collecting Data, One Pin at a Time. Pinterest is becoming the web’s personalized mail-order catalog. Each user is presented with a one-of-a-kind visual interface based on their tastes. They are presented with any product, from any retailer, anywhere in the world. The items they see are curated through people and topics they’ve identified as interesting and what is shown to them improves the more they interact with it. Every time they pin, re-pin, like, or comment on an object, the relevancy of the products displayed on their magic catalog improves. This is what personalization looks like, effortless, simple, social and fun. It’s the interface, stupid. “Big deal?” you say. “Facebook can do this!” No, they can’t. Social media is for selectively sharing information about you and Facebook is built for presenting yourself in the way you want to be seen by others. Facebook is, by design, about creating a network of relationships and sharing with them selectively. This brings up all kinds of privacy concerns, which reduce the flow of content creation and sharing to limited circles (Yes, I said “circles.” Don’t even try it, Google). Pinterest has no such restrictions. Pins are inherently open and there is no expectation that anything shared is private. I",
  "wordCount": 1480,
  "author": "Contributor",
  "hash": "895d0d0a6c4fd817"
}