{
  "url": "https://techcrunch.com/2022/10/06/gather-ai-secures-new-cash-to-scan-inventory-in-warehouses-using-drones/",
  "title": "Gather AI secures new cash to scan inventory in warehouses using drones | TechCrunch",
  "snippet": "Gather AI, a startup using drones and software to sell inventory management services to warehouse operators, has raised $10 million.",
  "domain": "techcrunch.com",
  "publishedDate": "2022-10-06T05:00:45-07:00",
  "extractedText": "Gather AI, a startup using drones to inventory items in warehouses, today announced that it raised $10 million in a Series A round led by Tribeca Venture Partners with participation from Xplorer Capital, Dundee Venture Capital, Expa, Bling Capital, XRC Labs and 99 Tartans. The proceeds bring the company’s total raised to $17 million, which CEO Sankalp Arora says is being put toward expanding Gather’s deployment capacity and go-to-market plans as well as hiring new machine learning engineers. Arora co-founded Gather AI in 2019 with Daniel Maturana and Geetesh Dubey, graduate students at Carnegie Mellon’s Robotics Institute. The trio had the idea to use drones to gather data — specifically data in warehouses, such as the number of items on a shelf and the locations of particular pallets. Over the course of several years, they designed a prototype of an inventory monitoring system that used off-the-shelf autonomous drones, which became Gather’s core product. “The space we are operating in is about providing automation with zero capital expenditure and enabling our customers to work at the efficiency of Amazon without needing the hundreds of millions of dollars they pour into their warehouses,” Arora told TechCrunch in an email interview. “Off-the-shelf hardware is more reliable and proven than custom-engineered hardware and our software is drone-agnostic so we can source from a large supply chain with no factory to manage.” Gather isn’t the first to market with a drone-based inventory monitoring system. Boston-based Corvus Robotics, too, leverages indoor drones to help warehouses keep track of stock. So does Pensa Systems, Vimaan, Intelligent Flying Machines, Vtrus and Verity. But Arora makes the case that Gather’s approach is more fungible — and less costly — than that of its rivals because it relies on consumer as opposed to custom-built drones. While consumer-grade drones usually lack high-quality sensors, they’re more attainable and scalable than their commercial counterparts, according to Arora, and still able to perform tasks like detecting damaged inventory (with thermal scanning) and counting pallet cases. They’re also more replaceable — Gather swaps drones out for free in the event one malfunctions. “A core innovation of our company is that we can achieve sophisticated state estimation on commodity hardware, and we can fly autonomously without GPS on drones that you can walk into a Best Buy and buy tomorrow if you wanted,” Arora said. “Consumer drones use consumer hardware, and unlike the high-end sensors in expensive robots you’re stuck using monocular vision on rolling shutter cameras that have a ‘Jell-O’ effect, and asynchronous sensor data. This was a huge challenge to solve, but now that we have overcome it our autonomy is extensible to non-drone commodity applications in the future.” Gather’s drones scan the sides of boxes in warehouses, updating inventory as they fly. Image Credits: Gather AI Arora says Gather also benefits from “network effects” in the sense that each new pallet its drones scan increases the size of the data set the company uses to train its inventory-classifying systems. This in turn improves the overall accuracy of the platform’s image processing. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW “[These network effects are] especially important for irregularities that are hard to model with synthetic data, like occluded barcodes, damaged boxes and irregular case stacking,” Arora says. Gather’s other innovation lies in the platform’s autonomy software, which doesn’t require customers to make changes to their warehouse layouts or infrastructure. Gather’s drones work in dark warehouses with motion sensor lights — the drones are equipped with night vision — and run on an iPad attached to the drone controller that works absent Wi-Fi. Setup usually takes a matter of weeks and costs clients “little to nothing,” Arora says. Arora claims that Gather drones are now deployed in 14 warehouses and scanning “thousands” of pallets every week for customers in industries such as air cargo, third-part",
  "wordCount": 1420,
  "author": "Kyle Wiggers",
  "hash": "8b5ed8d7c1724e54"
}