{
  "url": "https://techcrunch.com/2021/03/17/snap-is-taking-a-significant-step-into-fashion-e-commerce-with-its-acquisition-of-fit-analytics/",
  "title": "Snap acquires Fit Analytics, a fitting technology startup, to double down on fashion and e-commerce | TechCrunch",
  "snippet": "Fit Analytics' technology lets people enter their own measurements into a tool that uses machine learning to match those dimensions up to the",
  "domain": "techcrunch.com",
  "publishedDate": "2021-03-17T10:08:11-07:00",
  "extractedText": "“Snap, Inc. is a camera company,” Snap notes on its homepage, and while a lot of its effort up to now have been about using that camera ethos to help people share images of their lives with their social circles on its flagship app Snapchat, today the company made an acquisition to further that camera reach in another direction: selling fashion and more generally, e-commerce and shopping. Snap today confirmed that it has acquired Fit Analytics, a startup based in Berlin that has built technology to help shoppers find the right-sized apparel and footwear from online retailers, along with a wider set of personalization tools and other analytics to help retailers figure out how to sell more overall. Fit Analytics already works with a number of big retailers, including North Face, Asos, Calvin Klein, Patagonia, Puma, and many more — in all, some 18,000 retailers already. In other words, Snap is adding not just a technology team — there are 100 staff at the company, based in Berlin, who will be reporting to Snap VP of Engineering Nima Khajehnouri — but a substantial e-commerce technology business into its portfolio. Fit Analytics has confirmed that it will be continuing to operate its existing business, while also working on helping Snap build out its shopping platform. “If you are a Fit Analytics partner, this is only the beginning,” Fit Analytics’ CEO and co-founder Sebastian Schulze wrote in a blog post announcing the deal. “By leveraging Snap’s scale and capabilities, we will not only continue to service our existing clients, but also deepen our relationships and offerings with our brand partners and retailers. Our main focus going forward will be to scale the Fit Analytics business and work with Snap to grow their shopping platform, leveraging our technology and expertise. Our teams will be jointly executing on next-gen shopping, fashion and style offerings.” Fit Analytics’ technology lets people enter their own measurements into a tool that uses machine learning to match those dimensions up to the clothes or shoes in question to find the best fit. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Notably, although it is not the focus for the company right now, Fit Analytics also has built technology to match clothing using images that customers upload themselves — an interesting area considering Snap’s focus on the visual experience, on visuals created by its users — and of course the features it has built around lenses and other augmented reality experiences to let people play with different versions of themselves and how they look. The terms of the deal are not being disclosed. Fit Analytics, which used to be called UpCload (and actually launched back in 2011 at a TC Disrupt event in Beijing focused mainly on “webcam” technology — this was the days before smartphone-created selfies were de rigueur) had disclosed less than $1 million in funding according to PitchBook data, although that list of customers implies that it was generating strong revenues. Social shopping spree Snap’s acquisition of Fit Analytics pulls on a few different strategic threads for the social media company. For starters, it will give Snap another way to diversify its revenues. The company is now making nearly $1 billion a quarter in revenues (in its Q4 earnings, it posted sales of $911 million). The majority of that is coming from advertising on Snapchat, so Snap is naturally looking for other ways of making money. Whether Fit Analytics is integrated into Snapchat or not, and regardless of what will happen with how Apple and Google let apps monetize on their mobile platforms, Fit Analytics is already likely pulling in a substantial amount of revenue by way of its e-commerce services for retailers. Covid-19 has led a lot of retailers to rethink how well their e-commerce experiences work, and that could have meant more activity for companies like Fit Analytics. All that will now be funneled on to Snap’s balance sheet. Its advertising business, meanwhile, reveals that Snap already has a substantial relationship with fashion and beauty brands. In ",
  "wordCount": 1821,
  "author": "Ingrid Lunden",
  "hash": "911d3520c105a57d"
}