{
  "url": "https://hbr.org/podcast/2022/05/delivering-a-personalized-shopping-experience-with-ai",
  "title": "Delivering a Personalized Shopping Experience with AINavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuClose menuSearch",
  "snippet": "I would say once someone actually buys sort of for the first time and they see how the whole system goes, you check out right on the platform, we communicate with you where your product is and when it’s arriving to you, then I think that we find that customers are really sticky and so it’s more abou",
  "domain": "hbr.org",
  "publishedDate": "2022-05-17T12:00:30Z",
  "extractedText": "Skip to content Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Latest Magazine Topics Podcasts Store Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Ask AI Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Close menu Search Please enter a search term Submit Suggested Topics Explore HBR Latest The Magazine Podcasts Store Webinars Newsletters Popular Topics Managing Yourself Leadership Strategy Managing Teams Gender Innovation Work-life Balance All Topics For Subscribers Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Subscribe My Account My Library Topic Feeds Orders Account Settings Email Preferences Log Out Sign In Subscribe Latest Podcasts The Magazine Store Webinars Newsletters All Topics Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive My Library Account Settings Log Out Sign In Your Cart Your Shopping Cart is empty. Visit Our Store Guest User Subscriber My Library Topic Feeds Orders Account Settings Email Preferences Log Out Reading List Reading Lists X Share Podcast Cold Call / Episode 175 Delivering a Personalized Shopping Experience with AI Play Listen | Podcast loading... Go Back 15 seconds Play Go Foward 15 seconds Share What’s next for fashion shopping app, THE YES: improving the algorithm or investing in customer acquisition? Subscribe: Apple Podcasts Spotify RSS All episodes All episodes Details Transcript May 17, 2022 THE YES, a shopping app for fashion brands, uses a sophisticated algorithm to create and deliver a personalized store for every shopper, based on her style preferences, size, and budget. After launching the app in 2020, the founders must decide whether to continue developing the algorithm to deliver on the company’s customer value proposition or to focus their resources on new customer acquisition, with the idea that more users on the app would improve the algorithm’s performance. Harvard Business School senior lecturer Jill Avery and THE YES co-founder and CEO Julie Bornstein to discuss this make-or-break dilemma in the case, THE YES: Reimagining the Future of e-Commerce with Artificial Intelligence (AI). This episode was recorded live at Harvard Business School on March 30, 2022. BRIAN KENNY: On June 18, 1956, ten mathematicians gathered at Dartmouth College on the top floor of Kemeny Hall for a six-week workshop on how to make machines improve themselves and solve the kinds of problems now reserved for humans. It was called the “Design Workshop on Artificial Intelligence,” giving a name to a field that, depending on who you ask, could either save the world or destroy it. The truth is probably somewhere in the middle of that spectrum. Although, much about AI is still the stuff of science fiction, many practical applications have made their way into our daily lives. Brands like Netflix, Tesla, and Pandora are pushing the boundaries on AI and finding new ways to delight and engage customers. But for many sectors, the field is still wide open and waiting on a game changer. Today on Cold Call, we’ve invited professor Jill Avery and case protagonist, Julie Bornstein, to discuss the case entitled THE YES: Reimagining the Future of E-Commerce with Artificial Intelligence. I’m your host, Brian Kenny, and you’re listening to Cold Call on the HBR Presents Network. Jill Avery is an expert on brand management and customer relationship management. Before coming to HBS, she managed several world class consumer brands, including Gillette, Braun, Sam Adams, and AT&T. Julie Bornstein has spent her career at the intersection of retail and technology. She is the co-founder and CEO of THE YES, and the protagonist in the case we’re going to discuss today. She’s beaming in from San Francisco. It’s great to have you both here today. This is a special episode of Cold Call. We are actually taping this in front of a live audience at Harvard Business School, make some noise so they can hear you. That’s the audience that’s in the classroom. This is one of the classrooms at Harvard Business School, where we teach cases every day to our MBA students and Executive Education participants. So, we’re really happy to be able to do this live taping as part of a celebration of the 100th anniversary of the Case Method at Harvard Business School. So, this is a big day at the school, and we’re happy to have several hundred people streaming this as well on YouTube. So, let’s just dig in. Why don’t we start with you, Jill. Because it’s the 100th anniversary of the case method, I thought I would just pull the lens back a little bit and ask you the first question about what makes an enduring case? Why is this case one that will endure over time? JILL AVERY: Sure. I think to me, the biggest thing an enduring case needs to be ",
  "wordCount": 6478,
  "hash": "93a3e7f0e6c3b643"
}