{
  "url": "https://techcrunch.com/2010/11/16/barilliance/",
  "title": "Barilliance: Dead-Simple eCommerce Site Personalization | TechCrunch",
  "snippet": "Barilliance offers four products that are designed to help sites increase sales and conversion rates through a personalized shopping experience for visitors.",
  "domain": "techcrunch.com",
  "publishedDate": "2010-11-16T04:03:52-08:00",
  "extractedText": "It’s never been easier for non-programmers to launch and manage eCommerce sites. For most, the basic feature-set is well and plenty. But for those who want to push the envelope slightly with more sophisticated features like product recommendation, the daunting challenge of acquiring custom development is a deal-breaking deterrent. Barilliance wants to change that with a suite of eCommerce personalization features which are as simple as things can get in terms of integration: Copy/Paste a snippet of JavaScript. Barilliance offers four products that are designed to help sites increase sales and conversion rates through a personalized shopping experience for visitors: Product recommendations – Similar in concept and styling to Amazon’s personalized product recommendations. These display cross-sells and up-sells. Email personalization – Personalized product offers designed for integration within email marketing. Recommendations are based on the visitor’s activity on the e-commerce site. Onsite behavioral targeting – Site owners can determine website content based on pre-defined visitor segments like traffic source, search terms, time of day, and loyalty. Cart abandonment – Automated email campaigns for visitors who started but abandoned the checkout process. The personalization can be enhanced for sites that implemented Facebook Connect. In such sites, Barilliance can target visitors based on profile data, for example, showing a customized ad for visitors that have a birthday soon. There’s also the ability to show a “Friends also liked…” indicator that trumps the generalized “People also liked…” indicator. Obviously, these features require configuration and ongoing management, but the integration part—the copying and pasting of JS code—couldn’t be easier. If the integration is that easy, how then does Barilliance integrate with the site’s product catalog? Well, they scrape. That’s right, they put scraping to good use and build a product catalog without requiring the site owner’s intervention. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Once the data is scarped and cookies are placed and analyzed, Barilliance starts fine tuning its product recommendation for the site in question—a process that takes 3-7 days. Barilliance co-founder, Ido Ariel, explained that’s typically when most sites notice an increase in conversion. Pricing is tailored to each customer but generally involves a monthly fee that correlates to sales volume and page views. [youtube=http://www.youtube.com/watch?v=ZjaLcrKYIqk&w=620&h=480&hl=en_US&fs=1&] Topics Barilliance, TC Roi Carthy I’ve helped market big ideas & the startups behind them. Noteworthy work in these realms: PHP & Ad Blocking. Previously, the CMO of The Singulariteam Technology Group, where I supported a portfolio of 40+ companies. Before that, I was CMO of Rainbow (formerly Shine), where I championed the right of individuals to block abusive ads, while helping the Advertising Industry embrace better online ad experiences. In 2015 my work was recognized by ‘The Drum’ and their selecting of me as ‘CMO of the Year: http://www.thedrum.com/news/2015/12/30/drums-new-year-honours-2015-industry-champions-and-ones-watch-including-top-names Before that, I was Managing Partner at Initial Capital (initial.vc), a private investment firm focused on deals in Israel and Brazil. I had the pleasure of working at companies such as Soluto and Zend Technologies. I also covered the Israeli startup scene for TechCrunch from 2007 – 2012. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spywar",
  "wordCount": 951,
  "author": "Roi Carthy",
  "hash": "964e03a1ce215b22"
}