{
  "url": "https://techcrunch.com/2018/08/17/threads-raises-20m-for-its-luxury-goods-boutique-that-exists-only-in-messaging-apps/",
  "title": "Threads raises $20M for its luxury goods 'boutique' that exists only in messaging apps | TechCrunch",
  "snippet": "London-based Threads has raised $20 million in funding for an operation that courts high-end, millennial, mostly female customers with tailored",
  "domain": "techcrunch.com",
  "publishedDate": "2018-08-17T00:43:56-07:00",
  "extractedText": "When you think of e-commerce marketplaces, chances are that the first things that come to mind are storefronts built on websites and apps. But today an e-commerce startup that has never had either — and never plans to — has raised a fistful of cash to continue building out its shopping experience on the platform that has been its growth engine: messaging apps. London-based Threads has raised $20 million in funding for an operation that courts high-end, millennial, mostly female customers with tailored selections of luxury fashion, which it then sells to them on services like WeChat, WhatsApp, Snapchat, Instagram and Apple’s iMessage for their primary interactions with a team of human (not AI) shopping assistants. “We very intentionally didn’t build a website for consumers, just as we haven’t built an app,” founder and CEO Sophie Hill explained in an interview. “The idea behind Threads is curation and convenience. It’s a customer-centric business and it’s built on chat because that is where the customers wanted to be and transact. Chat may not have been used in the way we were using it in 2010” — when the company was founded — “but that was our problem to solve. We had to learn to serve through chat rather than create was for convenient for us as a business.” The company says that it will be using the new funding — led by fashion and millennial-focused fund C Ventures, with participation from Highland Europe (which invests in Matches Fashion, among other related businesses) — to expand its business across the board: hiring more stylists, more engineers to build tech to help the operation run smoother, and creative and other staff to bolster the 90 who already work for the business. But even before now, the company has been growing quite impressively. With customers in 100 countries — 70 percent of them under the age of 35, with Asia one of its fastest-growing regions — Threads says that its average amount people spend in a shopping session (basket size) is a very unshabby $3,000. And because of its success in linking up expensive goods with people willing to buy them, it’s secured relationships with designers and brands like Dior, Fendi, Chopard and some 250 other luxury names to source key items for its clients. As a marketplace, Threads makes commissions from the suppliers when items are sold. Threads materialised (sorry) as a business when founder and CEO Sophie Hill was still working as a buyer for Topshop owner Arcadia, her first job out of university (where she studied sociology). The year was 2010, and even though messaging apps had yet to take off, and well before the ones you likely use today really had any functionality at all, with Instagram and the “stories” format nowhere on the scene, Hill started canvassing opinion among the people she hoped to target. She saw that they were already all avidly using messaging clients on their phones to chat to each other. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Messaging in the West was relatively feature-free, but Hill could see what was coming around the corner by looking at WeChat, the Chinese app that was well ahead of its time, and that — plus what her target audience was already using — was enough to convince her of how she needed to build her business. Threads has a somewhat unconventional cost base as an e-commerce startup. Without a site and app, its developer team instead is focused on ways of improving the processes that go into the selling that Threads does do: personalized, concierge style services. That means building tech to make tracking items more efficient for customers (that might come in the form of an actual chatbot at some point, Hill said); building a better search engine for the assistants to find specific pieces for Threads clients; and so on. Another area where Threads’ costs are quite different from the typical e-commerce business is in customer acquisition. Hill says the startup company also has never really had a dedicated marketing budget (nor “someone leading the marketing function”). Instead, Threads has grown mainly by word of ",
  "wordCount": 1721,
  "author": "Ingrid Lunden",
  "hash": "99a98ba1db8f619c"
}