{
  "url": "https://hbr.org/podcast/2024/08/how-to-build-a-dynamic-pricing-strategy-that-works",
  "title": "How to Build a Dynamic-Pricing Strategy That WorksNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuNavigation MenuAccount MenuAccount MenuSearch MenuClose menuSearch",
  "snippet": "I think in great part by the way, companies start to understand and actually individuals as well, but the way companies start to understand the many of the ramifications that a price has when you transact your customers. In the case of Uber, when these shocks happen, sometimes even if it is not, eve",
  "domain": "hbr.org",
  "publishedDate": "2024-08-14T10:22:24Z",
  "extractedText": "Skip to content Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Latest Magazine Topics Podcasts Store Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Ask AI Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Navigation Menu Subscribe Sign In Account Menu Account Menu Hi, Guest Search Menu Close menu Search Please enter a search term Submit Suggested Topics Explore HBR Latest The Magazine Podcasts Store Webinars Newsletters Popular Topics Managing Yourself Leadership Strategy Managing Teams Gender Innovation Work-life Balance All Topics For Subscribers Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive Subscribe My Account My Library Topic Feeds Orders Account Settings Email Preferences Log Out Sign In Subscribe Latest Podcasts The Magazine Store Webinars Newsletters All Topics Reading Lists Data & Visuals Case Selections HBR Learning HBR Executive My Library Account Settings Log Out Sign In Your Cart Your Shopping Cart is empty. Visit Our Store Guest User Subscriber My Library Topic Feeds Orders Account Settings Email Preferences Log Out Reading List Reading Lists X Share Podcast HBR On Strategy / Episode 71 How to Build a Dynamic-Pricing Strategy That Works Play Listen | Podcast loading... Go Back 15 seconds Play Go Foward 15 seconds Share You can avoid the downsides of dynamic pricing with some basic guardrails, overrides, and communication tactics. Subscribe: Apple Podcasts Spotify RSS All episodes All episodes Details Transcript August 14, 2024 More and more companies are turning to pricing algorithms to maximize profits. But many are unaware of a big downside. Marco Bertini, a marketing professor at Esade Business School in Barcelona, says constant price shifts can actually hurt the perception of your brand and its products. He warns that employing AI and machine learning without considering human psychology can damage your relationship with customers. In this episode, he outlines steps you can take to avoid these pitfalls, including some basic guardrails, overrides, and communication tactics. He also shares real-world examples of companies that are using dynamic pricing to smooth demand and provide better customer experiences. Key episode topics include: strategy, pricing strategy, algorithms, psychology, customer experience, communication, dynamic pricing, brand, AI, machine learning, profits. HBR On Strategy curates the best case studies and conversations with the world’s top business and management experts, to help you unlock new ways of doing business. New episodes every week. Listen to the full HBR IdeaCast episode: Algorithms Won’t Solve All Your Pricing Problems (2021) Find more episodes of HBR IdeaCast Discover 100 years of Harvard Business Review articles, case studies, podcasts, and more at HBR.org HANNAH BATES: Welcome to HBR On Strategy, case studies and conversations with the world’s top business and management experts — hand-selected to help you unlock new ways of doing business. More and more companies are turning to pricing algorithms to maximize profits. But many are unaware of a big downside. Marco Bertini, a marketing professor at Esade Business School in Barcelona, says constant price shifts can actually hurt the perception of your brand and its products. He warns that employing AI and machine learning without considering human psychology can damage your relationship with customers. In this episode, he outlines the steps you can take to avoid that – including some basic guardrails, overrides, and communication tactics. He also shares real-world examples of companies that use dynamic pricing to smooth demand and provide better customer experiences. This episode originally aired on HBR IdeaCast in October 2021. Here it is. CURT NICKISCH: Welcome to the HBR IdeaCast from Harvard Business Review. I’m Curt Nickisch. When I was a teenager on a sports team, our team bus stopped at a McDonald’s restaurant. Waiting in line, we noticed that the board that showed the prices for the French fries and hamburgers had little wheels for the numbers. Whoever set the prices, spun the wheels to show the right number. One of us joked that they probably rolled the prices higher when they saw the bus pulling up. And as you do, when you’re trying to be funnier than the next kid, we started imagining the prices bouncing around like stocks that if you were shopping at McDonald’s, you’d have to yell, “Buy now!”, when the price of a big Mac dropped to where you wanted to swoop in and pick one up. What was totally laughable to us at the time is actually become the norm of pricing today. Algorithms that can change prices by the minute are commonplace. It’s not just airfares and hotel rates anymore. Check your ride sharing app a minute later, and you can get a wildly different number. Leave items in your online shopping car",
  "wordCount": 5769,
  "hash": "a3726c46cfe6dc5e"
}