{
  "url": "https://techcrunch.com/2025/01/13/raspberry-ai-raises-24m-from-a16z-to-accelerate-fashion-design/",
  "title": "Raspberry AI raises $24M from a16z to accelerate fashion design | TechCrunch",
  "snippet": "Raspberry AI, a startup founded two years ago, is one of the technological solutions that helps expedite product development.",
  "domain": "techcrunch.com",
  "publishedDate": "2025-01-13T09:00:00-08:00",
  "extractedText": "The world of fashion is moving at a faster pace each year. Most retailers introduce new styles each season, and fast-fashion companies like Shein, H&M, and Zara update their collections continuously. To keep pace with the rapid demand for new styles, brands and manufacturers have been turning to tech to accelerate their design process. Raspberry AI, a startup founded two years ago, is one of the technological solutions that helps expedite product development by allowing designers to visualize and iterate their ideas nearly instantly with its text-to-image platform. Rasberry’s founder Cheryl Liu, who was a private equity analyst at KKR focused on retail before working for Amazon and DoorDash, spotted an opportunity to apply generative AI to fashion design right after image models like Open AI’s DALL-E and Stability AI‘s stable diffusion became available in late 2022. “For the first time in history, you could rapidly create hundreds of designs in a way that you could never do before,” Liu told TechCrunch. She explained that before generative AI, designers would often have to order physical samples to visualize their ideas, which would take weeks. The other alternative was to use older computer-aided design tools like Browzwear and Adobe’s Photoshop. But with Raspberry designers can turn their sketches into photo-realistic images just as they would appear on the brand’s website. Those images can help brands decide if they want to manufacture the product, according to Liu. “You can see the same foundational piece in a lot of different materials and prints,” she said. “No company is going to order 50 different sample iterations for one single product, but now they can see 50 different iterations of a single design.” Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW The product quickly became popular with brands. Today, Raspberry counts 70 customers, including fashion houses like athletic brand Under Armour, Gruppo Teddy, an Italian manufacturer with 8,840 stores across 39 countries, and luxury designer MCM Worldwide. Such fast growth has helped Raspberry raise a $24 million Series A led by Andreessen Horowitz, with the participation of existing investors Greycroft, Correlation Ventures, and MVP Ventures. The funding comes about 10 months after the startup’s $4.5 million seed round. Image Credits:Raspberry AI Andreessen Horowitz was interested in investing in an AI company that can accelerate the fashion manufacturing process, said Bryan Kim, a partner at the firm. “We had met with multiple companies and got excited about Cheryl as a founder and how she approaches building a company.” Of course, it also helped that Raspberry has “marquee clients that are very, very large and important,” Kim added. While Liu acknowledged that Raspberry competes with other AI image generators like Midjourney, DALL-E, and Adobe Firefly, a key reason why professional designers choose her company’s product is its ability to understand and accurately interpret industry-specific terminology. She gave an example of the word “fuzzy sweater.” She explained: “There’s a lot of terminology behind that sweater that a Midjourney does not know.” Another design-specific feature that Raspberry offers is the ability to create images from sketches. Raspberry will use the funding to hire engineering, sales, and marketing professionals and expand into home, furniture, and cosmetics product design. TechCrunch has an AI-focused newsletter! Sign up here to get it in your inbox every Wednesday. Topics a16z, AI, design, Exclusive, Fashion, greycroft, Startups Marina Temkin Reporter, Venture Marina Temkin is a venture capital and startups reporter at TechCrunch. Prior to joining TechCrunch, she wrote about VC for PitchBook and Venture Capital Journal. Earlier in her career, Marina was a financial analyst and earned a CFA charterholder designation. You can contact or verify outreach from Marina by emailing marina.temkin@techcrunch.com or via encrypted message at +1 347-683-3909 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear",
  "wordCount": 908,
  "author": "Marina Temkin",
  "hash": "a7be08f0ccaa5439"
}