{
  "url": "https://techcrunch.com/2025/02/26/shop-circle-raises-60m-to-encircle-ecommerce-with-an-app-suite/",
  "title": "Shop Circle raises $60M to encircle e-commerce with an app suite | TechCrunch",
  "snippet": "With this funding, Shop Circle has also completed the acquisition of Aiden, an AI-powered, “guided-selling” software used by such e-commerce",
  "domain": "techcrunch.com",
  "publishedDate": "2025-02-26T16:07:00-08:00",
  "extractedText": "The boom in e-commerce post-pandemic meant shops moved online. However, some merchants ended up with dozens of separate app providers to accommodate everything from supply chains, to inventory, to marketing. The founders of Shop Circle realized this and either built or bought many such apps. The company has now raised $60 million in a Series B fundraise led by Nextalia Ventures in order to scale up this strategy. With this funding, Shop Circle has also completed the acquisition of Aiden, an AI-powered, “guided-selling” software used by such e-commerce giants as LG, Prenatal, and Intersport, among others. Shop Circle claims its year-on-year revenues have increased by 110%, which helped it raise funds, as did its focus on commerce-centric products powered by the increasing power of generative AI integration. It also has been profitable for two consecutive years. “Our main solutions range from AI-driven product discovery, primarily for commerce, up-selling, review management, inventory management, and the strength is that all the software comes together under one unified Shop Circle platform,” said CEO and co-founder Luca Cartechini, who co-founded the company with Luca Cartechini. Asked about their competitors, he said: “We do have several competitors for each of the category … But none of them have all the products under one platform.” In fact, part of Shop Circle’s success lies in its deep integration with Shopify: “Shopify is a partner for us and we’re the largest provider of solutions in the Shopify app store, basically the App Store of Shopify,” he said. In a statement, Francesco Canzonieri, CEO of Nextalia said: “Shop Circle stands out in the industry with its innovative approach to delivering a unified B2B software suite.” Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Additional participants in this funding round included Endeavor Catalyst, along with existing investors such NFX, QED Investors, 645 Ventures, 3VC, and i80 Group. This latest fundraising follows a $120 million 2023 raise that was led by 645 Ventures and 3VC. Topics Commerce, eCommerce, Europe, Exclusive, Fundraising, Shopify Mike Butcher Editor At Large Mike Butcher (M.B.E.), formerly Editor-at-large of TechCrunch, has written for UK national newspapers and magazines and been named one of the most influential people in European technology by Wired UK. He has spoken at the World Economic Forum, Web Summit, and DLD. He has interviewed Tony Blair, Dmitry Medvedev, Kevin Spacey, Lily Cole, Pavel Durov, Jimmy Wales, and many other tech leaders and celebrities. Mike is a regular broadcaster, appearing on BBC News, Sky News, CNBC, Channel 4, Al Jazeera and Bloomberg. He has also advised UK Prime Ministers and the Mayor of London on tech startup policy, as well as being a judge on The Apprentice UK. GQ magazine named him one of the 100 Most Connected Men in the UK. He is the co-founder of TheEuropas.com (Top 100 listing of European startups); and the non-profits Techfugees.com, TechVets.co, and Startup Coalition. He was awarded an MBE in the Queen’s Birthday Honours list in 2016 for services to the UK technology industry and journalism. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker This is Uber’s new robotaxi from Lucid and Nuro Sean O'Kane Lego Smart Bricks introduce a new way to build — and they don’t require screens Amanda Silberling Hacktivist deletes white supremacist websites live onstage during hacker conference Lorenzo Fra",
  "wordCount": 792,
  "author": "Mike Butcher",
  "hash": "a94dfe3424985896"
}