{
  "url": "https://techcrunch.com/2025/01/03/generative-ai-funding-reached-new-heights-in-2024/",
  "title": "Generative AI funding reached new heights in 2024 | TechCrunch",
  "snippet": "Competitors like Meta and Shopify have been exploring AI-powered tools for businesses for customer support and outreach. The search giant also",
  "domain": "techcrunch.com",
  "publishedDate": "2025-01-03T13:11:30-08:00",
  "extractedText": "If there was any doubt, the generative AI bubble did not burst in 2024. Investments in generative AI, which encompasses a range of AI-powered apps, tools, and services to generate text, images, videos, speech, music, and more, reached new heights last year. According to data from financial tracker PitchBook compiled for TechCrunch, generative AI companies worldwide raised $56 billion from VCs in 2024 across 885 deals. That raw cash total is a new record for the segment. It’s up 92% from 2023, when investors poured $29.1 billion into generative AI startups across 691 deals. “We aren’t seeing a slowdown in generative AI funding, as big names like OpenAI, Anthropic, and xAI continue to secure major raises and release new, competitive products,” said Ali Javaheri, an emerging technology analyst at PitchBook, in an interview. Deal value in Q4 2024 soared to $31.1 billion with the closure of mammoth rounds like Databricks’ $10 billion Series J, xAI’s $6 billion Series C, Anthropic’s $4 billion strategic investment from Amazon, and OpenAI’s $6.6 billion round. Mergers and acquisitions were a small share of generative AI investments in 2024: $951 million, per PitchBook data. To be clear, that’s exclusive of the various “acqui-hire” deals executed by Google, Microsoft, and Amazon. Google reportedly paid $2.7 billion to hire much of chatbot startup Character AI‘s staff and license its technology, while Microsoft is said to have spent $650 million licensing Inflection‘s AI models and hiring its CEO, Mustafa Suleyman. U.S. companies attracted the bulk of generative AI backing last year. Startups outside the U.S. nabbed just $6.2 billion of all 2024 VC investments in the market. There were some big winners, however, like Beijing-based Moonshot AI ($1 billion in February), French startup Mistral (~$640 million in June), Cologne-based company DeepL ($300 million in May), Shanghainese firm MiniMax ($600 million in March), and Tokyo-based Sakana AI (~$214 million in September). Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW So what might 2025 hold? Javaheri believes that the generative AI sector risks becoming oversaturated with startups in exceedingly similar (or even identical) verticals. To his point, no fewer than four companies developing AI coding assistants — Augment, Magic, Codeium, and Poolside — closed rounds exceeding $100 million last year. And a host of generative media startups (e.g., Black Forest Labs, ElevenLabs) have recently secured tens of millions of dollars in funding at sky-high valuations. The trend may not be sustainable as investor pressure to show appreciable revenue growth increases. According to Javaheri, technical challenges and the vast computing costs needed to stay competitive may pose additional challenges for generative AI ventures. “Only the best-funded startups can continue to keep up with the pace needed for the most innovative models,” he added. “Most of the high valuations are thus going to come from the infrastructure layer.” That is, of course, very good news for “infrastructure layer” generative AI players, which did quite well for themselves in 2024. Data center startups like Crusoe ($600 million in December) and Lambda ($320 million in February) represented some of the generative AI market’s largest rounds. Investment firm KKR predicts that soaring demand for data centers to support AI will boost global spending in the sector to $250 billion a year. TechCrunch has an AI-focused newsletter! Sign up here to get it in your inbox every Wednesday. Topics AI, AI, Exclusive, Funding, Fundraising, Generative AI, pitchbook, Startups, Startups, trends, VC, Venture Kyle Wiggers AI Editor Kyle Wiggers was TechCrunch’s AI Editor until June 2025. His writing has appeared in VentureBeat and Digital Trends, as well as a range of gadget blogs including Android Police, Android Authority, Droid-Life, and XDA-Developers. He lives in Manhattan with his partner, a music therapist. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-st",
  "wordCount": 906,
  "author": "Kyle Wiggers",
  "hash": "b4a25db3e57b7f0c"
}