{
  "url": "https://techcrunch.com/2025/07/08/genai-as-a-shopping-assistant-set-to-explode-during-prime-day-sales/",
  "title": "GenAI as a shopping assistant set to explode during Prime Day sales | TechCrunch",
  "snippet": "A new report estimates that AI will be a larger-than-ever part of the online shopping process during Amazon's Prime Day sale.",
  "domain": "techcrunch.com",
  "publishedDate": "2025-07-08T13:07:45-07:00",
  "extractedText": "A new report estimates that AI will be a larger-than-ever part of the online shopping process during Amazon’s Prime Day sale, which began Tuesday morning. Amazon’s annual sale, which this year spans four days (July 8-11), is predicted to drive $23.8 billion in online spending across U.S. e-commerce retailers, as other businesses run their own competing sales alongside the popular shopping event. Adobe, whose e-commerce division regularly releases estimates for online shopping events like Black Friday and others, offers a view into online commerce by tracking transactions online. The firm’s analysis encompasses over 1 trillion visits to U.S. retail websites, including 100 million SKUs across 18 product categories. This year, Adobe forecasts that Prime Day will be the equivalent of “two Black Fridays.” The $23.8 billion spent over the four-day period will represent 28.4% year-over-year growth and $9.6 billion more than the comparable period last year. Mobile will be a large part of that equation, accounting for more than half (52.5%) of sales, but this year, generative AI will also play a role. During the Prime Day event, Adobe estimates that traffic from generative AI sources will increase 3,200% year-over-year. This is still a much smaller source than other channels, like paid search and email, but Adobe believes it will continue to grow as consumers see the value in using AI for shopping. The company noted that GenAI-powered chatbots and browsers saw an initial surge in use during the 2024 holiday season, when traffic from those sources jumped 1,300% compared with the prior year from November 1 through December 31, 2024. The company also cited a survey of 5,000 U.S. consumers, which indicated that people were using GenAI for research (55% of respondents), product recommendations (47%), finding deals (43%), getting gift ideas (35%), finding unique products (35%), and creating shopping lists (33%). Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Of those who used GenAI, 92% said it enhanced their purchase experience, and 87% said they are more likely to use AI for larger or more complex purchases. AI providers have been capitalizing on this trend by integrating AI into shopping, as Google has with Gemini-enhanced product search and as OpenAI has with the addition of shopping features in ChatGPT, for example. Adobe’s forecast says that consumers this Prime Day will be focused on discounts, with apparel having the biggest deals. Back-to-school needs will also drive sales this year. Topics AI, Amazon, Commerce, eCommerce, prime day Sarah Perez Consumer News Editor Sarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software. You can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker This is Uber’s new robotaxi from Lucid and Nuro Sean O'Kane Lego Smart Bricks introduce a new way to build — and they don’t require screens Amanda Silberling Hacktivist deletes white supremacist websites live onstage during hacker conference Lorenzo Franceschi-Bicchierai",
  "wordCount": 767,
  "author": "Sarah Perez",
  "hash": "b4d0aca4ed851152"
}