{
  "url": "https://techcrunch.com/2024/04/09/ebay-adds-an-ai-powered-shop-the-look-feature-to-its-ios-app/",
  "title": "eBay adds an AI-powered 'shop the look' feature to its iOS app | TechCrunch",
  "snippet": "eBay on Tuesday launched a new generative AI-powered feature to appeal to fashion enthusiasts: a “shop the look” section within its iOS mobile app.",
  "domain": "techcrunch.com",
  "publishedDate": "2024-04-09T09:08:05-07:00",
  "extractedText": "eBay on Tuesday launched a new generative AI-powered feature to appeal to fashion enthusiasts: a “shop the look” section within its iOS mobile app that will suggest a carousel of images and ideas, based on the customer’s shopping history. The company says its recommendations will be personalized to the end user and will evolve as the customer shops more. The idea is to introduce how other fashion items may complement their current wardrobe. To do so, “shop the look” will include interactive hotspots that, when tapped, will reveal similar items and outfit inspirations, with the resulting looks including both preowned and luxury items that match the user’s personal style. The feature is powered by eBay.ai, and was developed in collaboration with the company’s Responsible AI team and RAI Principles, eBay notes. Image Credits: eBay “Shop the look” will appear to any eBay shopper who has viewed at least 10 fashion items over the past 180 days, the company notes. It will display both on the eBay homepage and the fashion landing page. For eBay, the addition offers a way to showcase its wide expanse of inventory available for sale differently than before — and one that could potentially encourage more sales, if successful. eBay says it plans to explore expansions to other categories over time and will continue adding more personalization elements to the feature over the new year. eBay isn’t the only one exploring how AI can improve the fashion shopping experience. Google last summer introduced a way for consumers to virtually try on clothes using a new AI shopping feature, for example. Amazon has also turned to AI to help customers find clothes that fit when shopping online. In those cases, the AI features were meant to help customers find the right fit or size, whereas eBay’s new feature is more focused on fashion inspiration — meaning finding the right style. That can be harder to do, given that personal style is subjective. “Shop the look” will initially be available on iOS in the U.S. and U.K., with support for Android coming later this year. Topics AI, AI, Apps, Commerce, eBay, eCommerce, Fashion, online shopping, shopping Sarah Perez Consumer News Editor Sarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software. You can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW This is Uber’s new robotaxi from Lucid and Nuro Sean O'Kane Lego Smart Bricks introduce a new way to build — and they don’t require screens Amanda Silberling Hacktivist deletes white supremacist websites live onstage during hacker conference Lorenzo Franceschi-Bicchierai",
  "wordCount": 727,
  "author": "Sarah Perez",
  "hash": "b4f35930aa557770"
}