{
  "url": "https://techcrunch.com/2025/11/04/shopify-says-ai-traffic-is-up-7x-since-january-ai-driven-orders-are-up-11x/",
  "title": "Shopify says AI traffic is up 7x since January, AI-driven orders are up 11x | TechCrunch",
  "snippet": "E-commerce software provider Shopify is bullish on AI-powered shopping agents, citing AI as an “incredible tool” to enable more entrepreneurs and calling it the “biggest shift in technology since the internet” during its third-quarter earnings call. According to Shopify president Harley Finkelstein,",
  "domain": "techcrunch.com",
  "publishedDate": "2025-11-04T10:20:55-08:00",
  "extractedText": "E-commerce software provider Shopify is bullish on AI-powered shopping agents, citing AI as an “incredible tool” to enable more entrepreneurs and calling it the “biggest shift in technology since the internet” during its third-quarter earnings call. The company, which partnered with ChatGPT maker OpenAI in September, reported that traffic from AI tools to its online stores is up 7x since January of this year, and purchases attributed to AI-powered search have increased by 11x. According to Shopify president Harley Finkelstein, the company’s advantage in the AI era comes from its ability to access the data from millions of merchants and billions of transactions, and its “founder mode” mentality to ship products quickly. This also includes its internal tools, like Scout, which uses AI to help Shopify employees search hundreds of millions of pieces of merchant feedback to make better product decisions. “And Scout is just one of many tools we’re developing to turn our own signals, whether it’s support tickets, usage data, reviews, social interactions, or even Sidekick prompts, into fast, informed decisions,” Finkelstein said on the call. “If you take away one thing from this call, let it be this: AI is not just a feature at Shopify. It is central to our engine that powers everything we build.” In addition to ChatGPT, Shopify is working with Perplexity and Microsoft Copilot on other in-chat shopping experiences. A recent Shopify survey found that 64% of shoppers said they’re “likely” to use AI to some extent when making purchases. “We’ve been building and investing in this infrastructure to make it really easy to bring shopping into every single AI conversation,” Finkelstein said. “The fact that we’re already working with the leaders in the space should, I think, be a testament to the fact that we want to make sure merchants on Shopify are better prepared than those that are not. It’s still obviously very, very early,” he continued. “But what we’re really trying to do is lay the rails for agentic commerce.” While the company is currently focused on building connections with AI agents, it’s also prepared for the fact that there will be “different permutations” of how agentic commerce will evolve, Finkelstein also noted, which means it needs to be ready for “whichever path wins.” Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW “That was the same thing when social commerce started to get a lot of attention, or when [people realized it wasn’t] e-commerce versus physical commerce but … this idea of commerce everywhere,” he added. Separately, Shopify’s Q3 financial results showed revenue up 32% to $2.84 billion, ahead of estimates, and profit of $264 million, or 20 cents per share. However, the stock sagged on news that the company’s operating income of $434 million had missed estimates of $437 million. Topics AI, Commerce, e-commerce, Shopify Sarah Perez Consumer News Editor Sarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software. You can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker This is Uber’s new robotaxi from Lucid and Nuro Sean O'Kane Lego Smart Bricks intr",
  "wordCount": 828,
  "author": "Sarah Perez",
  "hash": "b5cf82456ebf5b04"
}