{
  "url": "https://techcrunch.com/2021/01/27/finesse-launch-seed-funding/",
  "title": "Finesse raises $4.5M to predict fashion trends with AI | TechCrunch",
  "snippet": "Finesse, a startup promising to take the guesswork and waste out of fashion, is announcing that it has raised $4.5 million in seed and pre-seed funding.",
  "domain": "techcrunch.com",
  "publishedDate": "2021-01-27T07:13:17-08:00",
  "extractedText": "Finesse, a startup promising to take the guesswork and waste out of fashion, is announcing that it has raised $4.5 million in seed and pre-seed funding. Founder and CEO Ramin Ahmari said the tremendous waste in the fashion industry has become a badly kept secret, with Burberry recently facing a backlash over its practice of burning unwanted products, and the industry as a whole producing an estimated 13 million tons of textile waste each year. Finesse is looking to change that, Ahmari said, in part by taking advantage of the fact that fashion trends are moving out of the “hermetically sealed” world of catwalks and onto social media, where new products take off “on the backs and bodies and posts” of influencers like Kylie Jenner. “This is data we have access to,” he said. Noting that he previously worked in finance, Ahmari added that the stock market is “much more unpredictable” than the fashion industry — there just hasn’t been a tech startup applying tools like natural language processing and deep learning to fashion. “In the simplest terms, you can think of what we do as seeing when Kylie posts a picture on Instagram and people go crazy about it … and then you see that happen not just on Kylie’s post but across Instagram, TikTok, Google Trends,” he said. “We predict the establishing of a trend before it goes super viral.” Image Credits: Finesse Finesse then uses this data to design new products. Ahmari said that by taking advantage of a “very fast supply chain,” along with tools like CLO 3D-modeling software, Finesse can go from identifying a trend to having a product available for purchase in less than 25 days. While the startup is officially launching today, it’s already been selling products through “drops,” where customers vote for and pre-order products that will only be available in limited quantities. Ahmari said Finesse focuses on selling unique pieces rather than staples, but because it’s confident about consumer demand, it can keep things much more affordable — the products currently for sale range from $8 to $116. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Unlike most fashion companies, Ahmari said that Finesse does not need to employ a giant design department, although he suggested that team members like Vice President of Product Andrea Knopf and Head of Product Development Brittany Fleck — who work in tandem with the startup’s algorithms — are “artists in their own right.” “Unless we have true AI — which we’re very far from — you are never going to have a machine that’s purely creative,” he said. “You have to have feedback cycles … What we are eliminating is the job where it’s just an intern doing grunt work, all of these people just going through Instagram to find new fashion trends.” Ahmari also said that with its emphasis on sustainability and connecting with the LGBTQ community (Ahmari identifies as queer and nonbinary, and all of the startup’s products are designed for any gender), Finesse is aimed squarely at Gen Z consumers who are tired of fashion dictated by “white, older, cisgender men.” The startup’s investors include former Twitter Head of Engineering Alex Roetter, Collective Health CEO Ali Diab, Hoxton Ventures, MaC Venture Capital, Mango Capital and Fab Fit Fun co-founder Sam Teller. “We believe that Finesse is truly the future of fashion, from its trend prediction to sustainable supply chain and manufacturing,” said MaC Managing Partner Marlon Nichols in a statement. “We hope other fashion brands can learn from Finesse’s disruption in the space and we’re eager to see what’s next.” Amazon Fashion launches a custom clothing service, Made for You Topics Alex Roetter, Artificial Intelligence (AI), Fashion, MaC Venture Capital, Marlon Nichols, TC Anthony Ha Anthony Ha is TechCrunch’s weekend editor. Previously, he worked as a tech reporter at Adweek, a senior editor at VentureBeat, a local government reporter at the Hollister Free Lance, and vice president of content at a VC firm. He lives in New York City. You can contact or verify outreach from Anthony by emailing anthony.ha@techcrun",
  "wordCount": 1126,
  "author": "Anthony Ha",
  "hash": "bcc4523c215bb55c"
}