{
  "url": "https://techcrunch.com/2023/11/06/luxury-clothing-virtual-try-on-100m-valuation-e-commerce/",
  "title": "Luxury clothing distributors get into virtual try-on tech; bag $15M Series A on a $100M valuation | TechCrunch",
  "snippet": "Zelig users can create different outfit combinations and then save them to their profile and even share them before purchasing complete looks.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-11-06T06:03:55-08:00",
  "extractedText": "Sandy Sholl and Adam Freede are no strangers to the world of fashion. They’ve been at the helm of MadaLuxe Group, a luxury distribution platform for fashion and accessories, since 1990. Now they’re adding AI-powered virtual try-on and styling technology to the list. Today, the pair launched Zelig, offering personalized technology that will eventually enable consumers to upload a photo to visualize how clothes, shoes and accessories look on their body type as they shop online. At launch, consumers can choose between more than 40 models of diverse body types, skin tones and hair colors. The technology uses a combination of artificial intelligence, machine learning and computer vision to do this. Zelig users can create different outfit combinations and then save them to their profile and even share them before purchasing complete looks. The concept of virtual try-on is not new. Large enterprises, like Walmart, Google and Amazon, have invested in some kind of try-on technology. There are also a number of venture-backed startups in this sector, including Dia & Co., AIMIRR and Revery.ai, showing us how certain clothes might fit, while also attempting to reduce the number of returns. Want to know how a dress looks on you? AIMIRR has your back … and front Sholl told TechCrunch that Zelig is the first to offer this kind of “hyper-personalized online shopping experience” meant to mimic what you might find if you tried on clothes at a retailer. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW She explained that nowhere else can a shopper see themselves through the entire shopping journey. “So many people, when we did our UX testing, forgot why they even picked certain styles out at the very beginning by the time they’re finished with our shopping experience, so we thought that would be a really cool thing,” Sholl said. “We have created hyper personalization that is driven by your customers’ actual engagement. It’s a competitive advantage for today, but absolutely a necessity for tomorrow.” Sholl likened Zelig’s potential to those of enterprise customer relationship management tools Snowflake and Salesforce, noting, “they’re basically just taking the data and putting it into reporting for tomorrow. We are willing to advance this technology into a visual reporting tool, and we think it’s just the wave of the future in the next decade.” Sholl and Freede privately funded Zelig for the past three years, however, now they announce $15 million in Series A funding that values the pre-revenue company at $100 million. Financial services firm Hilco Global led the funding round, joined by global luxury investor Bezikian Zareh. “Sandy Sholl and Adam Freede are innovators in the luxury fashion business with whom I’ve had success with on previous investments, and Hilco Global is proud to be partnering with them again,” Jeffrey Hecktman, CEO of Hilco Global, said in a written statement. “While many tech companies are building solutions for an industry they don’t know well, Zelig was founded by fashion experts with firsthand knowledge of how to solve the retail industry’s biggest challenges.” Zelig intends to deploy the capital into technology development around its personalization capabilities and to build out additional features. Sholl declined to name any brands with the launch of Zelig. However, with MadaLuxe repping merchandise from brands, including Versace, Gucci and Cartier, it’s probably not a stretch to suggest some of these retailers — or the large department stores where they are sold — are likely to sign on in the future. Advances in fit technology could minimize those onerous online returns Topics Adam Freede, Commerce, e-commerce, Hilco Global, Sandy Sholl, Startups, Venture, virtual try on, Zelig Christine Hall Senior Reporter Christine Hall wrote about enterprise/B2B, e-commerce, and foodtech for TechCrunch, and venture capital rounds for Crunchbase News. Based in Houston, Christine previously reported for the Houston Business Journal, the Texas Medical Center’s Pulse magazine, and Community Impact Newspaper. She has an underg",
  "wordCount": 1109,
  "author": "Christine Hall",
  "hash": "bdd8806312240fab"
}