{
  "url": "https://techcrunch.com/2025/06/20/startups-weekly-fast-and-furious/",
  "title": "Startups Weekly: Fast and furious | TechCrunch",
  "snippet": "... Amazon, where he worked on large-scale commerce and AI systems. ... Some, he added, view the startup as a kind of Shopify for AI-powered commerce.",
  "domain": "techcrunch.com",
  "publishedDate": "2025-06-20T10:30:00-07:00",
  "extractedText": "Welcome to Startups Weekly — your weekly recap of everything you can’t miss from the world of startups. Want it in your inbox every Friday? Sign up here. Some startups accrued value at lightning speed this week, and we got confirmation that defense tech is red hot. Most interesting startup stories from the week Image Credits:Kelly Sullivan / Getty Images Many startup stories this week occurred in Y Combinator’s orbit in some way. Also, Israel once again lived up to its “Start-Up Nation” reputation. That was fast: No-code website-building platform Wix acquired 6-month-old, bootstrapped vibe-coding startup Base44 — both Israeli companies — for $80 million in cash. That was fast, too: In just three months, Ramp’s valuation jumped to $16 billion following its Series E, up from $13 billion when the spend management startup did a secondary sale earlier this year. Friends and foes: New details emerged on Meta’s $14.3 billion deal to acquire 49% of startup Scale AI, including a potential dividend payout. We also learned that OpenAI was dropping Scale AI as a data provider following the deal. Frenemies: The U.S. Department of Defense awarded a contract worth up to $200 million directly to OpenAI, which could further strain the startup’s relationship with Microsoft. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW ICYMI: Out of all the teams presenting at YC’s recent Spring 2025 Demo Day, here are 11 startups that investors have been talking about. Didn’t happen: People are also still talking about the police shutting down the YC Demo Day after-party that controversial AI startup Cluely tried to throw; or as its CEO told TechCrunch, “the most legendary party that never happened.” Most interesting VC and funding news this week HelsingImage Credits:Helsing Most funding news was driven by either defense tech, AI, or both, but there were also some surprises. Plus, one VC firm is aiming high for its next fund. Good intuition: Applied Intuition, a company making software for autonomous vehicles, secured a $600 million Series F and tender offer at a $15 billion valuation. New tune: Munich-based defense tech startup Helsing closed a €600 million investment led by Prima Materia, the VC firm of Spotify’s founder Daniel Ek, which valued Helsing at €12 billion. New unicorn: Israeli observability startup Coralogix became a unicorn after raising a $115 million Series E, which it will use to double its headcount in India, where 100 of its 550 employees are currently based. Toldja: Mach Industries, a 2-year-old defense tech startup, confirmed having raised a $100 million round of funding led by Khosla Ventures and Bedrock at a $470 million valuation. Money flows: Aspora, a startup formerly known as Vance and focused on facilitating remittances from the Indian diaspora, closed a $50 million Series B co-led by Sequoia and Greylock at a $500 million valuation. Change of heart: Sword Health, an AI-powered digital health startup that began as a virtual physical therapy solution, locked in $40 million at a $4 billion valuation in a funding round led by returning investor General Catalyst. It also pushed back its IPO plans to at least 2028. Multiplier effect: Multiplier Holdings announced having raised $27.5 million across seed and Series A rounds after joining the growing trend of buying legacy service businesses — in its case, accounting firms — and scaling them with AI. Stock where you shop: Grifin, a startup whose app helps users buy stock from brands they shop at, such as Walmart, secured $11 million in a Series A round. Out of Sweden: Polar, a payment infrastructure platform for developers and AI-first businesses, raised a $10 million seed round led by Accel. Its CEO previously co-founded Tictail, which was acquired by Shopify in 2018. Bullish: Global VC Endeavor Catalyst is seeking to raise $300 million for its fifth fund. This would be its largest yet, as it looks to deepen its bet on fast-growing startups in emerging markets. Last but not least Image Credits:Alexa von Tobel An early investor in Chime, founder-turned-VC Alexa von Tobel is r",
  "wordCount": 1145,
  "author": "Anna Heim",
  "hash": "c140daf68127f349"
}