{
  "url": "https://techcrunch.com/2023/04/03/zyod-funding-lightspeed/",
  "title": "Lightspeed backs Indian startup Zyod aiming to make apparel manufacturing more efficient | TechCrunch",
  "snippet": "Zyod is not alone in helping solve supply chain constraints for fashion brands in the market. ... The AI system does market trend analysis",
  "domain": "techcrunch.com",
  "publishedDate": "2023-04-03T22:30:26-07:00",
  "extractedText": "Zyod, an Indian startup offering apparel sourcing and manufacturing services to fashion brands globally, has raised $3.5 million in a seed round led by Lightspeed Venture India Partners. As the e-commerce sector makes inroads, consumers are finding increasing convenience in purchasing clothes online. However, fashion brands continue to grapple with the challenges of sourcing and producing garments in order to meet the fast-growing demands of the industry. These brands contend with inventory risk as they strive to stay in sync with trends and consumer preferences, which can lead to inventory write-offs and threaten profitability. Enter Zyod, a technology startup aiming to tackle these issues. The Gurugram-based startup claims it can disrupt the apparel industry by delivering a new product range in a mere 21 days, with a minimum order quantity of just 50 pieces. This stands in stark contrast to the traditional supply chain’s 180-day lead time and 2,000-piece minimum order, said Zyod co-founder Ankit Jaipuria in an interview. He said the startup’s end-to-end service enables fashion brands to reduce their inventory, which is a crucial strategy for success in today’s market. Jaipuria started Zyod with co-founder Ritesh Khandelwal earlier this year, and since its inception, the startup has served a roster of over 150 clients across 13 countries. He refrained from disclosing specific brand names, but revealed the three major customer archetypes to which Zyod caters. One category consists of smaller direct-to-consumer (D2C) brands lacking alternatives in the current market landscape. The second would be international importers and wholesalers who have traditionally relied on Chinese suppliers are now seeking alternatives as businesses adopt the China-plus-one strategy to lessen their dependence on manufacturing in the country. Lastly, Jaipuria noted that large brands seeking to expand their product range and adopt a more demand-driven approach also make up a significant portion of Zyod’s clientele. Zyod is not alone in helping solve supply chain constraints for fashion brands in the market. However, other players are operating as aggregators of supply in the market: working on floating out queries they get from brands to all the suppliers they have in their networks, according to Jaipuria. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW “They are merely aggregating different suppliers and serving the brand, whereas where we are different is we are actually going deep into the manufacturing,” he said. Zyod is leveraging India’s unique cluster-based supply chain, which spans beyond metropolitan areas and tier-1 cities, to bring its solutions to a larger cohort. By training local apparel manufacturers with proprietary technology, the startup lets manufacturers create products that can appeal to international brands. Furthermore, Zyod employs AI to power a design recommendation engine for brands. This approach, Zyod says, lets it deliver a more personalized experience to its clientele while enhancing the efficiency of the design process. The AI system does market trend analysis, brand profiling and iterative feedback loops based on the order history of its customers to create different style recommendations. “For a new brand, it could be on the basis of the market analysis and basic profiling once the brand gets on board. But as you grow with us, we will have an iterative feedback loop. Let’s say I offered you 100 styles out of which you selected 20 styles. I will know the attributes of the 20 styles you selected. So, the next offering that I will give you would be based on the attributes of the selected 20 styles,” the co-founder explained. The seed funding round also saw participation from FJ Labs, Panthera Peak Capital and angels such as Tracxn co-founder Abhishek Goyal and Oyo global COO Abhinav Sinha. Zyod plans to deploy the fresh funds to refine its solutions. This includes enhancing the efficiency of its design recommendation engine and advancing its technology to create a fully-automated supply chain. The startup is a",
  "wordCount": 1154,
  "author": "Jagmeet Singh",
  "hash": "c194c1af83ed788e"
}