{
  "url": "https://techcrunch.com/2025/12/04/nexus-isnt-going-all-in-on-ai-keeping-its-new-700m-fund-balanced-with-india-bets/",
  "title": "Nexus isn't going all in on AI, keeping half of its new $700M fund for India startups | TechCrunch",
  "snippet": "Companies like Google, Amazon, Walmart, and OpenAI have been releasing new standards and products to infuse AI into every bit of shopping, both",
  "domain": "techcrunch.com",
  "publishedDate": "2025-12-04T03:00:00-08:00",
  "extractedText": "While many venture firms seem to only have eyes for AI these days, Nexus Venture Partners is deliberately splitting its focus for its new $700 million fund. The firm will back AI startups and seek out India-focused startups in consumer, fintech, and digital infrastructure. AI has soaked up most of the venture capital raised globally and the 20-year-old VC firm also sees AI as a defining technological shift. But it argues crowding into a single, overheated category carries its own risks. India’s digital economy provides a counterbalance: an expanding market where AI adoption is rising and opportunities remain more diverse. For Nexus, that balance is rooted in its origins. The Delaware-headquartered firm, with offices in Menlo Park, Mumbai, and Bengaluru, has operated as a single fund and an integrated U.S.–India team since its founding in 2006. It backs early-stage software and India-focused startups from the same pool of capital. Over time, its cross-border software bets have encompassed a range from infrastructure and developer tools to AI agent startups. U.S. portfolio includes companies such as Postman, Apollo, MinIO, Giga, and Firecrawl, which have become widely adopted in developer tooling and AI infrastructure. Meanwhile, its India portfolio has broadened across consumer, fintech, logistics, and digital infrastructure. Some of its bets there include Zepto, Delhivery, Rapido, Turtlemint, and Infra.Market. “AI is a huge inflection point, and we are anchoring on that,” Jishnu Bhattacharjee, a managing partner at Nexus Venture Partners in the U.S., told TechCrunch in an interview. “But we are also seeing that many of these AI innovations are actually getting used to serve the masses better.” Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Nexus manages $3.2 billion in capital across its funds and has invested in more than 130 companies over the years. The firm has recorded more than 30 exits to date, including several IPOs, underscoring the depth of its early-stage, long-horizon approach. Abhishek Sharma, a managing partner at Nexus Venture Partners in the U.S., told TechCrunch the firm’s sweet spot remains inception to seed and Series A, often beginning with checks as small as a few hundred thousand dollars or around $1 million. Nexus, which operates with an eight-member investment team, began with a $100 million fund and has kept its fund size at $700 million since launching Fund VII in 2023. It typically raises every 2.5 to 3 years. Bhattacharjee said the reason for keeping the eighth fund the same size was the firm believes $700 million is the right amount for its early-stage strategy. “We don’t want to raise money for the sake of raising,” he noted. Even though India’s AI journey is not as advanced as the U.S.’s in many areas, Nexus believes India could leapfrog in several parts of the AI ecosystem. Bhattacharjee underlined the country’s large talent pool, rising digital infrastructure, and demand for localized models that support India’s many languages and service needs. These dynamics, he said, are pushing Indian startups to build AI applications and agents faster, often atop open source tools and emerging domestic AI infrastructure companies. The partners pointed to companies backed by Nexus, such as Zepto and Neysa, to illustrate how AI is taking shape in India. They said Zepto, the quick-commerce platform, uses AI extensively across its operations — from customer support to routing and fulfillment — demonstrating how consumer businesses are becoming deeply AI-native. Besides, infrastructure players like Neysa are emerging to address India-specific needs, including sovereign AI workloads, localized data handling, and support for the country’s many languages. Nexus did not share fund metrics. The partners said its funds have been realizing significant enough returns over the years to largely fill this fund from returning limited partners. The firm’s LP base spans the U.S., Europe, the Middle East, Southeast Asia, and Japan. Topics AI, Enterprise, Fintech, India, Nexus Venture Partners, Startups, United St",
  "wordCount": 970,
  "author": "Jagmeet Singh",
  "hash": "c43df40080e08d31"
}