{
  "url": "https://techcrunch.com/2025/10/23/amazons-new-ai-shopping-tool-tells-you-why-you-should-buy-a-recommended-product/",
  "title": "Amazon's new AI shopping tool tells you why you should buy a recommended product | TechCrunch",
  "snippet": "Amazon's new Help Me Decide tool will show you a personalized recommendation for a particular category and list reasons why you should buy",
  "domain": "techcrunch.com",
  "publishedDate": "2025-10-23T06:00:00-07:00",
  "extractedText": "Amazon has been stuffing AI features into its shopping experience for the past few years now. Today, the company unveiled a new feature called “Help me decide,” which takes into account your searches, browsing, and shopping history on Amazon to suggest products and describe why a particular product is right for you. For example, if you’re shopping for a camping tent and have looked at sleeping bags for four people and stoves, and have bought camping boots, Help me decide would suggest an all-season, four-person warm tent. The tool will initially stick to the price range you’re currently browsing, but it can also suggest cheaper or more expensive items if you choose to see more options. Amazon says the “Help me decide” button will show up after a user has browsed through many similar listings. The button is also located under the “Keep shopping for” option at the top of the homepage. Image Credits:Amazon “Help Me Decide saves you time by using AI to provide product recommendations tailored to your needs after you’ve been browsing several similar items, giving you confidence in your purchase decision,” Daniel Lloyd, vice president of personalization at Amazon, said in a statement. Amazon said it is using large language models along with AWS’ generative AI app service, Bedrock, search service OpenSearch, and recommendation service SageMaker for the tool. The feature will be available to consumers in the U.S. on the Amazon Shopping app on iOS and Android, and on the web. Image Credits:Amazon Over the past year, the e-commerce company has implemented multiple shopping tools to drive more purchases. Last year, it introduced its AI assistant Rufus, which sought to help answer user questions about products. Then in October 2024, it added AI-powered shopping guides for over 100 categories, and this year, it started providing audio product and review summaries. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW And then in September, it debuted Lens Live, which lets users point their phone camera at things around them in the world and get product suggestions on Amazon. Google, OpenAI, and Perplexity have also been investing in AI-powered shopping tools to drive more sales. Topics AI, AI shopping assistant, Amazon, Commerce, shopping Ivan Mehta Ivan covers global consumer tech developments at TechCrunch. He is based out of India and has previously worked at publications including Huffington Post and The Next Web. You can contact or verify outreach from Ivan by emailing im@ivanmehta.com or via encrypted message at ivan.42 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker This is Uber’s new robotaxi from Lucid and Nuro Sean O'Kane Lego Smart Bricks introduce a new way to build — and they don’t require screens Amanda Silberling Hacktivist deletes white supremacist websites live onstage during hacker conference Lorenzo Franceschi-Bicchierai",
  "wordCount": 705,
  "author": "Ivan Mehta",
  "hash": "d3dbfba022416c15"
}