{
  "url": "https://techcrunch.com/2022/05/17/zmo-ai-generate-human-8-million/",
  "title": "ZMO.ai secures $8M led by Hillhouse to create AI generated fashion models | TechCrunch",
  "snippet": "ZMO.ai secures $8M led by Hillhouse to create AI generated fashion models. With breakthroughs in machine learning, it's no longer uncommon to",
  "domain": "techcrunch.com",
  "publishedDate": "2022-05-17T18:45:24-07:00",
  "extractedText": "With breakthroughs in machine learning, it’s no longer uncommon to see algorithmically generated bodies that can move and talk authentically like real humans. The question is now down to whether startups offering such products can achieve a sustainable business model. Some of them have demonstrated that potential and attracted investors. ZMO.ai, founded by a team of Chinese entrepreneurs who have spent years studying and working abroad, just closed an $8 million Series A financing round led by GL Ventures. GGV Capital and GSR Ventures also participated in the round. The startup has found a healthy demand from fashion e-commerce companies that are struggling to hire and afford models due to their growing number of stock-keeping units (SKUs), or styles, as consumer tastes become more changeable. Using the generative adversarial network (GAN), ZMO has created a piece of software to help them create virtual full bodies of models by defining simple parameters like face, height, skin color, body shape and pose. “Traditionally, the entire cycle of garment manufacturing may take two to three months, from design, fabric selection, pattern making, modeling, to actually hitting the shelves,” says Ella Zhang, ZMO’s CEO and co-founder, a former engineer at Google and Apple. “We are flipping and shortening that process. [Customers] can now test a piece of clothing by putting it on a virtual model, which can go on the website. Once orders come in, the e-commerce customer can start manufacturing,” she tells TechCrunch. “They can also test what type of people would suit a certain product by trying it out on different virtual models.” It’s unsurprising that fashion e-commerce operators would find ZMO and its likes a cost-saving tool. Zhang says her company is in early discussion with fast-fashion giant Shein, which rolls out 2,000-3,000 new products per day, about potential collaborations. Screen capture of ZMO’s AI-generated video. Image Credits: ZMO We previously covered Surreal, a Sequoia-backed, Shenzhen-based startup also working on synthetic media to replace humans in lifestyle photos and other commercial scenarios. The business attracted a surge in interest as the COVID-19 pandemic hit China’s e-commerce exporters, who were having a hard time finding foreign models as the country went into strict border controls. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Going forward, ZMO is also planning to apply GPT-3, which uses big data and deep learning to imitate the natural language patterns of humans, to create speeches for models. As spooky as it may sound, the feature would make it breezy for e-commerce companies to churn out TikTok videos quickly and cheaply for product promotion. On average, e-commerce companies spend around 3%-5% of their annual gross merchandise value (a rough metric measuring sales, usually excluding returns and refunds) on photoshoots, according to Roger Yin, who worked at Evernote and ran his own cross-border e-commerce business before co-founding ZMO with Zhang. “Images play a big role in driving e-commerce sales. The problem is that the [sales] cycle is short but the cost of images is high,” Yin observes, adding that costs can be even higher for fashion companies with a quick turnover of styles. The goal of ZMO is to reduce the costs of photoshoots to 1% of GMV. Right now, 80% of ZMO’s customers are based in China, but it’s working to attract more overseas users this year using its new financial infusion. Operating with a team of 30 staff, the startup boasts 30 “medium and large-sized” customers, including Tencent-backed Chicv, one of Shein’s numerous challengers, and over 100 “small and medium” customers, such as dropshipping sellers. ZMO’s other co-founders include Ma Liqian, a Ph.D. in computer vision who graduated from Belgium’s KU Leuven, and Yang Han, who previously worked on AI-powered styling at Tencent and SenseTime. Updated name of lead investor. Topics AI, Artificial Intelligence (AI), Asia, China, cross-border e-commerce, e-commerce, Evernote, GAN, ggv capital, GSR Ventures, Hillhouse Cap",
  "wordCount": 1174,
  "author": "Rita Liao",
  "hash": "d61a50547ca5e287"
}