{
  "url": "https://techcrunch.com/category/artificial-intelligence/",
  "title": "AI News & Artificial Intelligence | TechCrunch",
  "snippet": "* [Government & Policy](https://techcrunch.com/category/government-policy/). + [Anthony Ha](https://techcrunch.com/author/anthony-ha/). * [Commerce](https://techcrunch.com/category/commerce/). + [Ivan Mehta](https://techcrunch.com/author/ivan-mehta/). + [Anthony Ha](https://techcrunch.com/author/ant",
  "domain": "techcrunch.com",
  "publishedDate": "2026-01-11T09:56:41-08:00",
  "extractedText": "AI News coverage on artificial intelligence and machine learning tech, the companies building them, and the ethical issues AI raises today. This encompasses generative AI, including large language models, text-to-image and text-to-video models; speech recognition and generation; and predictive analytics. Headlines Only Load More AI Google removes AI Overviews for certain medical queries Anthony Ha 4 hours ago Government & Policy Indonesia and Malaysia block Grok over non-consensual, sexualized deepfakes Anthony Ha 6 hours ago Commerce Google announces a new protocol to facilitate commerce using AI agents Ivan Mehta 6 hours ago In Brief OpenAI is reportedly asking contractors to upload real work from past jobs Anthony Ha 1 day ago AI CES 2026: Everything revealed, from Nvidia’s debuts to AMD’s new chips to Razer’s AI oddities Morgan Little 2 days ago Hardware How the Sleepbuds maker, Ozlo, is building a platform for sleep data Sarah Perez 2 days ago Startups CES 2026 was all about ‘physical AI’ and robots, robots, robots Theresa Loconsolo Anthony Ha Kirsten Korosec Sean O'Kane 2 days ago AI CES 2026: Follow live for the best, weirdest, most interesting tech as this robot and AI-heavy event wraps up 97 Stories 2 days ago Climate Meta signs deals with three nuclear companies for 6-plus GW of power Tim De Chant 2 days ago In Brief X restricts Grok’s image generation to paying subscribers only after drawing the world’s ire Ram Iyer 2 days ago Enterprise Anthropic adds Allianz to growing list of enterprise wins Rebecca Szkutak 3 days ago AI Governments grapple with the flood of non-consensual nudity on X Russell Brandom 3 days ago AI OpenAI to acquire the team behind executive coaching AI tool Convogo Rebecca Bellan 3 days ago Gadgets The most bizarre tech announced so far at CES 2026 Lauren Forristal 3 days ago In Brief Nvidia’s reportedly asking Chinese customers to pay upfront for its H200 AI chips Kate Park 3 days ago Enterprise Snowflake announces its intent to buy observability platform Observe Rebecca Szkutak 3 days ago AI Elon Musk’s lawsuit against OpenAI will face a jury in March Rebecca Bellan 3 days ago Startups Why this VC thinks 2026 will be ‘the year of the consumer’ Rebecca Bellan 3 days ago AI Gmail debuts a personalized AI Inbox, AI Overviews in search, and more Aisha Malik 3 days ago AI Former Bolt CEO Maju Kuruvilla’s startup triples to $100M valuation Jagmeet Singh 3 days ago In Brief Google and Character.AI negotiate first major settlements in teen chatbot death cases Connie Loizos 4 days ago Transportation Ford has an AI assistant and new hands-free BlueCruise tech on the way Sean O'Kane 4 days ago AI OpenAI unveils ChatGPT Health, says 230 million users ask about health each week Amanda Silberling 4 days ago Startups Where VCs think AI startups can win, even with OpenAI in the game Theresa Loconsolo 4 days ago 29 min In Brief Anthropic reportedly raising $10B at $350B valuation Rebecca Bellan 4 days ago Startups VC predicts the consumer AI products OpenAI ‘won’t want to kill’ Rebecca Bellan Theresa Loconsolo 4 days ago Apps Skylight debuts Calendar 2 to keep your family organized Sarah Perez 4 days ago AI Google Classroom’s new tool uses Gemini to transform lessons into podcast episodes Lauren Forristal 4 days ago AI Caterpillar taps Nvidia to bring AI to its construction equipment Rebecca Szkutak 4 days ago AI Intel spinout Articul8 raises more than half of $70M round at $500M valuation Jagmeet Singh 4 days ago Next Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker This is Uber’s new robotaxi from Lucid and Nuro Sean O'Kane Lego Smart Bricks introduce a new way to build — and they don’t require screens Amanda Silberling Hacktivist deletes white supremacist websites live onstage during hacker conference Lorenzo Franceschi-Bicchierai",
  "wordCount": 728,
  "hash": "d91b1a307571d77e"
}