{
  "url": "https://techcrunch.com/2023/11/21/off-script-launches-ai-app/",
  "title": "Off/Script launches an app to create and buy AI-designed fashion | TechCrunch",
  "snippet": "Founders of a new community-powered product creation platform, Off/Script, are making a huge bet on AI-designed merchandise.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-11-21T09:31:10-08:00",
  "extractedText": "Founders of a new community-powered product creation platform, Off/Script, are making a huge bet on AI-designed merchandise. Created by Jonathan Brun and Justine Massicotte, the company today announced the official launch of its mobile app, allowing anyone to conceptualize, share and monetize product mock-ups for a chance to make the concept a reality. Creators can design anything from clothing, high-end handbags and other accessories to decor, furniture, electronics and more. Users vote on their favorites, and the Montreal-based startup leads the funding, manufacturing and shipping for the most popular designs. A product design must have at least 100 votes to be considered, we’re told. Off/Script also evaluates the complexity of the project, cost of production and how much inventory to order based on demand. Off/Script’s generative AI design studio helps anyone produce product mock-ups, regardless of whether they are an expert designer or not. Off/Script’s studio leverages the generative AI model Stable Diffusion, which the company has tailored for poses, variations and scalability. It also uses ControlNet — an open network protocol to control image generation in Stable Diffusion — to show 360-degree images of the items. Creators can either enter a custom prompt into the generator or select from premade product templates to be customized to their liking. Off/Script has created a library of customizable clothing and accessories from its network of manufacturers, including trousers, knitted sweaters, raincoats, hoodies, t-shirts, swimsuits, duffle bags, bucket hats and more. This gives creators a starting point that is actually feasible to make because it’s already been done before. AI-generated fashion has existed for years and has since become a popular tool among designers. Design and production tool CALA — which has been around since 2016 — recently implemented OpenAI’s DALL-E API. Off/Script aims to be among the first companies to bridge the gap between generative AI, user-generated designs and tangible products. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW “The studio is optional,” said Massicotte. “Experienced designers can submit concepts created on platforms like Photoshop and others if they prefer. We see the Studio as a great tool for idea exploration and helping creators across skill levels share their ideas with the world in a beautiful way.” Image Credits: Off/Script Off/Script works with an ecosystem of over 1,000 manufacturers to bring the concepts to life, including a company called Crease Group that works with brands such as Kevin Hart’s Gran Coramino tequila, Pure Barre, Rumble Boxing and Club Pilates. “A long-term vision is we might enable [manufacturers] to take on projects themselves directly from the portal. This way, more creators see their things being built,” Brun revealed to us. He also said that Off/Script wants to find local manufacturers so creators can create and sell in their own country to “promote the local economy.” Creators take home 20% of the sales, along with a $500 upfront fee. They can also sell the item on their own website or online marketplace like Shopify. There are currently 30 beta-phase products for sale on Off/Script’s website and app. Items range from clothing and sneakers to athleisure and luxury items made by popular designers such as AI artists Field Skjellerup (@ai_clothingdaily) and Alycia Rainaud (@maalavidaa), as well as famous MMA coach Firas Zahabi. “In just a few months, and prior to even having the app live, we’ve helped our creators earn thousands of dollars from their concepts,” Brun claimed. Off/Script says it wants to be the highest-paying app ever for its creator community. Puffer Jacket design by Maalavidaa. Image Credits: Off/Script Despite the controversy toward AI art, Off/Script believes there are some AI artists who have their own style and original concepts. “[Saying] there is no creativity or it’s copying is disconnected from the reality of it when you look at the AI art and what some people aren’t capable of doing with their own touch and ",
  "wordCount": 1357,
  "author": "Lauren Forristal",
  "hash": "da022bd5bb03c0f6"
}