{
  "url": "https://techcrunch.com/2022/05/25/amazon-flexes-its-retail-muscle-with-a-brick-and-mortar-clothing-store/",
  "title": "Amazon flexes retail muscle with physical clothing store",
  "snippet": "Our advanced machine learning algorithms continually refine to find looks just for you based on your preferences.” Fitting rooms are",
  "domain": "techcrunch.com",
  "publishedDate": "2022-05-25T09:43:44-07:00",
  "extractedText": "Signaling its ambitions to make a dent in the apparel market, Amazon today opened its first physical clothing store, Amazon Style, in the Greater Los Angeles Area. Offering a twist on the traditional experience, visitors to the Glendale, California shop at The Americana At Brand use an app to scan codes on displayed items from Steve Madden, Levi’s, Lacoste and other brands to send them directly to a fitting room or pickup counter. As TechCrunch previously reported, Amazon Style features hundreds of brands chosen by “fashion creators” and “feedback provided by millions of customers shopping on Amazon.com.” Scanning the QR code next to an item pops up a selector for sizes and colors, as well as details such as customer ratings and adds the item to a list for later perusing. Amazon Style doesn’t use the cashierless “Just Walk Out” tech found in Amazon Fresh and Whole Foods locations, instead opting for Amazon’s controversial Amazon One palm recognition service. But there is an AI element. As Amazon explains on the store’s webpage: “We’re bringing more looks and less clutter to in-store shopping. Our advanced machine learning algorithms continually refine to find looks just for you based on your preferences.” Fitting rooms are unlocked using the app and sport touchscreens that let shoppers continue requesting items to try on. Items found in the store can be bought online or in-store and, either way, returned in-store. Window shopping the Amazon way. Image Credits: Amazon Amazon has spent years experimenting with technology in the fashion space, notably with Echo Look, a since-discontinued connected camera that combined human and machine intelligence to recommend styles, color-filter clothes and keep track of what’s in customers’ wardrobes. The Echo Look tied into Prime Wardrobe, a program akin to those offered by Stitch Fix and Trunk Club that let users try on clothes and send back what they don’t want to buy. In March 2021, Amazon passed Walmart as the top apparel retailer in the U.S. partly due to the pandemic-linked boom in online ordering, Wells Fargo reported. Analysts at the bank estimated that domestic sales of apparel and footwear on Amazon last year exceeded $41 billion, including sales through third-party sellers. Amazon has been less successful where it concerns brick-and-mortar, having recently announced that it would close dozens of physical bookstores and mall pop-up kiosks to focus on other areas of the retail business. Still, Amazon’s physical stores generated roughly $4.68 billion in Q4 2021 as bets like Just Walk Out — and perhaps even barbershops — begin to gain traction. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Topics AI, AI, Amazon, App, apparel, brick-and-mortar, Cloud Computing, eCommerce, Fashion, Media & Entertainment, retail, shopping, store, style Kyle Wiggers AI Editor Kyle Wiggers was TechCrunch’s AI Editor until June 2025. His writing has appeared in VentureBeat and Digital Trends, as well as a range of gadget blogs including Android Police, Android Authority, Droid-Life, and XDA-Developers. He lives in Manhattan with his partner, a music therapist. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod ",
  "wordCount": 946,
  "author": "Kyle Wiggers",
  "hash": "df96f86eda9f7c13"
}