{
  "url": "https://ketnergroup.com/2024/01/09/ai-upended-the-retail-tech-landscape-in-2023-whats-ahead-in-2024/",
  "title": "AI Upended the Retail Tech Landscape in 2023. What’s Ahead in 2024? - Ketner Group Communications",
  "snippet": "AI was the biggest technology trend of 2023 and will impact every area of retail tech in 2024. Here are our predictions for 2024.",
  "domain": "ketnergroup.com",
  "publishedDate": "2024-01-09T14:16:36+00:00",
  "extractedText": "AI Upended the Retail Tech Landscape in 2023. What’s Ahead in 2024? Posted on January 9, 2024 | by Jeff Ketner AI’s breakthrough year in 2023 was the retail technology equivalent of Taylor Swift’s Eras tour – a once-in-a-generation event that changes everything. If Swiftmania is the biggest musical sensation since The Beatles, then Generative AI is easily the most revolutionary technology since the iPhone. AI is quickly becoming a pervasive technology, dividing the timeline for tech advancements into “before” and “after” AI. AI will dominate the 2024 retail tech industry Dan Berthiume, senior technology editor of Chain Store Age, summed up the impact of AI in a recent Q&A with Ketner Group: “AI is the most dominant technology I’ve seen in the last 15 years. It will be an important component in every technology system and every part of the enterprise, and like mobile and omnichannel commerce, it will be a constant feature (not just in retail) and will just be assumed.” It’s a safe bet that AI will be the #1 tech topic at next week’s NRF 2024. And while AI will continue to dominate the retail technology landscape 2024, the conversations have shifted from the technology itself to all the different ways that AI impacts retail: from product creation to assortment planning, forecasting, supply chain management, pricing, PIM, marketing and every other area of the complex retail ecosystem. Along the way, we’re also starting to see some data emerge about the financial impact of AI in retail. Last month our friends at IHL Group released their Retail AI Readiness Profiles that measure the potential financial impact that AI can bring to retailers and restaurant chains. As always, IHL quantified its findings with an impressive real-world analogy: according to IHL, Macy’s alone could see $7.5B in business gains from AI in the next 5 years. What are some of the AI-driven tech trends to watch for in 2024? Here are just a few of the things we’re tracking; they’re just a small sampling of all the ways that AI will impact retail in 2024. Personalization continues to get more personal Retail is moving from personalization to hyper-personalization, delivering shopping experiences that “dazzle each shopper at scale,” according to Adobe’s annual research report, 2023 Digital Trends: Retail in Focus. Currently, only 16% of retailers can personalize experiences based on customers’ interaction history, while only 9% provide personalized experiences based on shopper intent. There’s massive room for improvement, and AI is the critical technology that makes this possible. AI helps combat retail’s labor shortage Employee turnover in retail reached record highs in 2023, but a combination of AI, robotics, computer vision and other technologies can help retailers offset the impact of labor shortages by automating routine tasks. For example, autonomous inventory robots can provide 24×7 inventory updates and help retailers keep their shelves stocked, reducing out-of-stocks and increasing sales. Retail supply chains become more resilient with AI One of the biggest technology lessons from the COVID-19 pandemic was that retail supply chains weren’t resilient enough to handle sudden supply chain shocks, from factory closings to rapid changes in consumer demand and the need for new fulfillment models. AI is quickly helping change that. A recent Business Insider article notes, “Robots are helping fulfillment-center workers sort through large volumes of products, artificial intelligence is predicting the most energy-efficient delivery routes, and modern data-collection and analysis methods are helping retail stores optimize stock management. Retail-technology experts say that without these innovations, supply chains would struggle to function in the face of fast-changing customer expectations and turbulent economic times.” Retail tech spending will increase in 2024 The examples above are just the tip of the iceberg when it comes to AI innovation in retail. And given the furious pace of AI innovation, it’s no surprise that Gartner predicts that 57% of retailers plan to spend more on software in 2024. AI will certainly be a major driver in this trend, especially as retailers look at AI’s tremendous financial upside (IHL estimates that the overall economic impact for the top 212 North American retailers and restaurants will be $1.5 trillion for the next 5 years). Ketner Group is fortunate to have a number of clients that are on the forefront of AI innovation, and we’re looking forward to exciting press announcements at next week’s NRF Show. 2024 will be a pivotal year for AI in retail technology, and Ketner Group clients will be a big part of the story! Looking to make an impact with PR in 2024? The Ketner Group team would love to connect! Download our Retail Tech PR Handbook to learn more about our best-practice approach to retail technology PR or schedule some time with us! Posted in Media Relations, Retail, Technology",
  "wordCount": 791,
  "author": "Jeff Ketner",
  "hash": "e0a3734e97d28856"
}