{
  "url": "https://techcrunch.com/2023/10/25/jellibeans-fashion-design-trend-aggregator-collaboration/",
  "title": "Coach's knitwear supplier bets $1M on Jellibeans' fashion prediction tech | TechCrunch",
  "snippet": "California-based Jellibeans has built a set of software that analyzes fashion trends and tells users where their designs stand on the market.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-10-25T06:00:53-07:00",
  "extractedText": "In fashion design, success is often determined by talent, hard work and a sprinkle of luck. In the era of big and artificial intelligence, however, fashion design has become somewhat more predictable. Leveraging both realms of technologies, California-based Jellibeans has built a set of software that analyzes fashion trends and tells users where their designs stand on the market; it also offers a platform for various stakeholders in the design process to exchange ideas anywhere in the world. Jellibeans’ suite of products has garnered the attention of high-street knitwear supplier Aussco, which recently invested $1 million in the five-year-old startup. The traditional fashion design process can be manual, slow and bound by geographical location. To disrupt the old regime, Jellibeans created a combination of Slack and Trello for designers, buyers and merchandisers to collaborate remotely. Rather than sitting in the same meeting room, the buyer and merchandiser working with the designer can see the works through Jellibeans’ interactive design platform and leave comments. Collections that used to take two to three months to develop can now be done in just a few weeks, Joanne Chow, CEO and co-founder of Jellibeans, told TechCrunch. Atop the collaboration tool are Jellibeans’ three main analytical features — trend forecasting, which gathers market insight and data from retailers, social media and other relevant channels about fashion brands to predict future trends like the popularity or decline of predetermined styles, for example, the minute details of what material or color is trending; a benchmarking tool, which uses AI and historical data to look at competing brands’ pricing strategies or similar-looking products; and lastly, generative AI, which is meant to assist designers in decision-making rather than substitute their originality, which has led to an ongoing debate in the creative industry. “A lot of people will criticize generative AI for not being original, so instead of using it for creation of this new product itself, I actually encourage people to use it to cross-check their work to see whether there’s any plagiarism,” Chow said. For instance, a designer developing a green turtleneck can upload their design to Jellibeans’ platform, called jelli.studio, and see the other green turtlenecks carried by other brands through the startup’s database, which keeps an evolving library of over 10 million fashion retail products. If the design strikes as too similar to an existing product, the designer can use Jellibeans’ Stable Diffusion-based AI tool to tweak the sweater. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Image: Jellibeans Jellibeans has an instant appeal to up-and-coming designers. Even before a designer puts down their first sketch, they can check through Jellibeans what sort of turtlenecks have done well historically. TikTok influencers who run their own collections can also benefit from Jellibeans’ generative AI features, Chow reckoned, as the startup’s goal is to “help designers become independent by using data.” But the startup is also eyeing bigger clients. Its investor Aussco, which is also its user, has supplied knitwear to The Kooples, Kate Spade, Coach, Alexander Wang, Ted Baker, Maje and North Face among others. “Democratizing design and enabling all stakeholders to collaborate on the design-to-production workflow within a single platform like jelli.studio enables even larger operations like ours to radically improve efficiency by saving us much needed time and money amid today’s voracious appetite for new designs, all the while reducing waste,” Grant J.E. Philips, senior vice president at Aussco, said in a statement. “When I present this product [to big brands], I don’t work on the AI part,” said Chow. “I explained to a lot of people on the C suite level that it provides a lot of the business analysis that you may usually have to pay a consultant for, but you can have it by pressing the button because we know how to create these reports.” Deep Agency shows the perils of applying AI to the fa",
  "wordCount": 1173,
  "author": "Rita Liao",
  "hash": "e1ebf0e441bb269b"
}