{
  "url": "https://techcrunch.com/2023/09/28/blend-uses-generative-ai-to-give-you-a-personalized-clothing-guide/",
  "title": "Blend uses generative AI to give you a personalized clothing guide | TechCrunch",
  "snippet": "A UK-based startup that is using AI to cut through the noise and help shoppers find personalized product recommendations to suit their style, budget and size.",
  "domain": "techcrunch.com",
  "publishedDate": "2023-09-28T06:30:39-07:00",
  "extractedText": "Shopping for clothing online has liberated us from the need to brave the endless aisles, fluorescent lights and sale-hungry crowds of the brick-and-mortar retail inferno. But anyone who has found themselves two hours deep into a fashion rabbit hole, with nothing to show for it but 15 open tabs, four full shopping carts, an earful of YouTube clothing haul reviews and the gnawing anxiety of the overwhelmed, shopping online can feel like a chore. Enter Blend, a U.K.-based startup that is using AI to cut through the noise and help shoppers find personalized product recommendations to suit their style, budget and size. “The vast majority of retailers do absolutely no personalization, and in the instances when they do, they only personalize according to historic purchase data,” Blend co-founder Jemima Bunbury told TechCrunch. “When trends are changing relatively quickly, and people’s style does change over the course of their lives, it doesn’t stay relevant for a user to have such historic recommendations.” Blend participated in TechCrunch Disrupt 2023 as one of the Startup Battlefield 200 companies. At the event, the startup launched its MVP — an app that will slowly open to the 2,000 users on Blend’s waiting list. After raising angel investment in April, Blend is now on the hunt to secure investors for its seed round. The startup will use those funds to build out additional features on the app and push for a full-scale launch. Blend has already signed on over 250 retailers, including Net-a-Porter, a luxury retailer. The startup’s go-to-market strategy targets users aged 18 to 34, “very digital, native mobile-first shoppers” who are starting to define their personal style as they accrue disposable income. Blend is launching in the U.K. first and then hopes to move into the U.S. market. “We hope that by attracting first the very fashion-forward, trendsetting crowd, we can then move more mainstream from there, but it’s much more difficult to go the other way round,” said Bunbury. “Ultimately, the vision is really to be the front door for every online shopping experience, and therefore, to be the largest-scale retailer because of that ability to personalize and only present people with the 1% of the internet that is most relevant to them.” Generative AI we can get behind Blend co-founders Bella Levin (left), Jemima Bunbury (middle) and Eva Piskova (right). Image Credits: Blend The fashion industry has tapped the generative AI frenzy in a range of ways. Some companies are using natural language processing algorithms to improve the customer service experience. Others are using image generation to create new designs. There are also applications in production improvement, trend forecasting, inventory management and virtual try-ons. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Blend’s approach centers around transformer technology and recommendation algorithms, powered in large part by user interaction data. Transformer technology, which makes up the tech stack of popular generative AI models like ChatGPT, is a model for teaching computers how to understand and generate human language. In the world of fashion, this means it can better understand user preferences and make tailored clothing recommendations. “The main thing that’s always important when it comes to AI is what data you are actually putting into [the model],” said Bunbury, noting that the founding team decided on an app rather than a web page in part because it’s easier to track a user’s data that way. When the user opens the app, they’ll scroll through a feed that is a mix of product imagery and descriptions that have been pulled from different retail and e-commerce sites. Their feed will also feature short-form videos and product curations from influencers who can earn an affiliate commission on any sales they generate. As the user scrolls, Blend collects data on how they interact with the app, whether they’re liking products, saving them, sharing with a friend, “or simply how long you’re looking at one product,” according to Bunbury. Blend uses all of that data",
  "wordCount": 1874,
  "author": "Rebecca Bellan",
  "hash": "e3eb9d742b66d8e1"
}