{
  "url": "https://techcrunch.com/2025/09/28/the-ai-services-transformation-may-be-harder-than-vcs-think/",
  "title": "The AI services transformation may be harder than VCs think | TechCrunch",
  "snippet": "The strategy involves acquiring mature professional services firms, implementing AI to automate tasks, then using the improved cash flow to roll up more companies. Solo investor Elad Gil has been pursuing a similar strategy for three years, backing companies that acquire mature businesses and transf",
  "domain": "techcrunch.com",
  "publishedDate": "2025-09-28T18:20:12-07:00",
  "extractedText": "Venture capitalists have convinced themselves they’ve found the next big investing edge: using AI to wring software-like margins out of traditionally labor-intensive services businesses. The strategy involves acquiring mature professional services firms, implementing AI to automate tasks, then using the improved cash flow to roll up more companies. Leading the charge is General Catalyst (GC), which has dedicated $1.5 billion of its latest fundraise to what it calls a “creation” strategy that’s focused on incubating AI-native software companies in specific verticals, then using those companies as acquisition vehicles to buy established firms — and their customers — in the same sectors. GC has placed bets across seven industries, from legal services to IT management, with plans to expand to up to 20 sectors altogether. “Services globally is a $16 trillion revenue a year globally,” said Marc Bhargava, who leads GC’s related efforts, in a recent interview with TechCrunch. “In comparison, software is only $1 trillion globally,” he noted, adding that the allure of software investing has always been its higher margins. “As you get software to scale, there’s very little marginal cost and there’s a great deal of marginal revenue.” If you can automate services business, too, he said — tackling 30% to 50% of those companies with AI, and even automating up to 70% of those core tasks in the case of call centers — the math begins to look irresistible. The game plan seems to be working right now. Take Titan MSP, one of GC’s portfolio companies. The investment firm provided $74 million over two tranches to help the company develop AI tools for managed service providers, then it acquired RFA, a well-known IT services firm. Through pilot programs, says Bhargava, Titan demonstrated it could automate 38% of typical MSP tasks. The company now plans to use its improved margins to acquire additional MSPs in a classic roll-up strategy. Similarly, the firm incubated Eudia, which focuses on in-house legal departments rather than law firms. Eudia has signed up Fortune 100 clients including Cargill, Del Monte, and Stripe, offering fixed-fee legal services powered by AI rather than traditional hourly billing. The company recently acquired Johnson Hana, an alternative legal service provider, to expand its reach. GC looks to double — at least — the EBITDA margin of those companies that it’s acquiring, Bhargava explained. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW The powerhouse firm isn’t alone in its thinking. The venture firm Mayfield has carved out $100 million specifically for “AI teammates” investments, including Gruve, an IT consulting startup that acquired a $5 million security consulting company, then grew it to $15 million in revenue within six months while achieving an 80% gross margin, according to its founders. “If 80% of the work will be done by AI, it can have an 80% to 90% gross margin,” Navin Chaddha, Mayfield’s managing director, told TechCrunch this summer. “You could have blended margins of 60% to 70% and produce 20% to 30% net income.” Solo investor Elad Gil has been pursuing a similar strategy for three years, backing companies that acquire mature businesses and transform them with AI. “If you own the asset, you can [transform it] much more rapidly than if you’re just selling software as a vendor,” Gil said in an interview with TechCrunch this spring. But early warning signs suggest this whole services-industry metamorphosis may be more complicated than VCs anticipate. A recent study by researchers at Stanford Social Media Lab and BetterUp Labs that surveyed 1,150 full-time employees across industries found that 40% of those employees are having to shoulder more work because of what the researchers call “workslop” — AI-generated work that appears polished but lacks substance, creating more work (and headaches) for colleagues. The trend is taking a toll on the organizations. Employees involved in the survey say they’re spending an average of nearly two hours dealing with each instance of workslop, including to first deci",
  "wordCount": 1545,
  "author": "Connie Loizos",
  "hash": "e98f5de1cea303da"
}