{
  "url": "https://techcrunch.com/2025/10/01/google-reveals-its-gemini-powered-smart-home-lineup-and-ai-strategy/",
  "title": "Google reveals its Gemini-powered smart home lineup and AI strategy | TechCrunch",
  "snippet": "Google reveals its Gemini-powered smart home lineup and AI strategy ... past weeks, and what factors could be disturbing their rest. This",
  "domain": "techcrunch.com",
  "publishedDate": "2025-10-01T05:59:00-07:00",
  "extractedText": "Just a day after Amazon introduced its new AI-powered Echo devices, Google debuted its refreshed lineup of Google Home and Nest devices, designed to showcase its AI assistant Gemini AI. The company also took the wraps off its revamped Google Home software platform and its new business strategy for the AI era. While the company still plans to compete on hardware, it also wants to make Gemini accessible to other manufacturers and businesses. It’s similar to how Google offers its own flagship Android devices with its Pixel line but allows other companies that make products compatible with Google’s platform to build their own Android smartphones with different form factors and price points. “We’re going to build flagship hardware in certain categories where we think there’s a lot of room to showcase innovation and push the boundaries of what’s possible with Gemini,” said Anish Kattukaran, chief product officer at Google Home and Nest, in a press briefing ahead of Wednesday’s announcement. “And then we’re going to complement that with the second part, which is, we don’t think that Gemini should be constrained to one set of devices from one OEM, at one set of price points that may make it accessible or inaccessible to a certain group of people,” he said. Image Credits:Google To demonstrate what that means, Google unveiled an overhauled lineup of Nest devices, including the Nest Cam Outdoor, the Nest Cam Indoor, and the Nest Doorbell, which take advantage of Gemini. It also teased an upgraded version of its Google Home speaker, due out in spring 2026, and a low-cost camera and doorbell sold in partnership with Walmart. However, the company decided to first bring Gemini to its existing device owners, provided they have certain hardware capabilities like sufficient processing power. (See list below.) This approach is intentional. Google doesn’t want to require people to buy new devices to access the power of its AI when it already has over 800 million devices in its ecosystem — both its own and those from third parties. Those devices are connected through the company’s Google Home Cloud-to-Cloud APIs and the smart home standard Matter, an industry protocol that allows devices from different manufacturers to work together. Plus, the company needs time to test the Gemini features and performance with existing customers before launching them on new flagship devices, like the upgraded Google Home smart speaker due out next year. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Image Credits:Google Meanwhile, Google is offering its “Works with Google Home” partners, a toolkit for building AI cameras, a new reference hardware design, recommendations about system-on-chips (SoCs, the main processors that power smart devices), a new Google Camera embedded SDK, and more. Walmart is Google’s first partner and is launching an affordable indoor camera and doorbell under the retailer’s onn brand. Talk to your Home With Gemini, the idea is to offer AI-powered devices that you can converse with in more natural ways, whether that’s interrupting or adding details after an initial inquiry, or asking more complex questions. Image Credits:Google For instance, if you said, “Play that song from that movie with Ben Affleck where he’s on a rocket and going off to like an asteroid or something,” the device could play an Aerosmith song from the movie “Armageddon.” As it streams the music, you could ask what the lyrics mean, and when it finishes, you could ask for other songs with a similar theme. You could also ask for a podcast featuring a specific person without having to remember the name of the show or the episode. Or you could ask Gemini to make up an interactive bedtime story for the kids where they help create the characters. In terms of household coordination, Gemini will be able to handle things like calendars, lists, timers, reminders, and other things that make your life easier at home. Image Credits:Google For instance, instead of telling the smart speaker to add individual recipe ingredients to a shopping list, you could just tell it you ",
  "wordCount": 1683,
  "author": "Sarah Perez",
  "hash": "eb2b9d1fde86dcf1"
}