{
  "url": "https://techcrunch.com/2025/11/28/how-openai-and-google-see-ai-changing-go-to-market-strategies/",
  "title": "How OpenAI and Google see AI changing go-to-market strategies | TechCrunch",
  "snippet": "# How OpenAI and Google see AI changing go-to-market strategies. But as with so many things, AI is changing how companies prepare to go to market. I think it’s still necessary that you have a general understanding of how and why certain things work in marketing,” Altschuler said. “You certainly need",
  "domain": "techcrunch.com",
  "publishedDate": "2025-11-28T08:00:00-08:00",
  "extractedText": "For years, when it was time for startups to start selling their product, they could turn to any number of traditional playbooks. But as with so many things, AI is changing how companies prepare to go to market. “You can do more with less than ever before,” Max Altschuler, general partner at GTMfund, told the audience at TechCrunch Disrupt last month. The challenge for founders and operators, though, will be threading the needle. While there has been some chatter of startups hiring developers more versed and loosing them on typical GTM problems, he said, there’s still a need for more specific domain expertise. “When you have great advisors around, you can learn some of the tried-and-true playbooks. Those things haven’t gone out the window. I think it’s still necessary that you have a general understanding of how and why certain things work in marketing,” Altschuler said. Alison Wagonfeld, vice president of marketing at Google Cloud, said the craft of marketing is still very much required. “You certainly need the AI knowledge, the AI curiosity, the technologists, but also understanding what the purpose of marketing is, to understand customer insights, to do research, to see what great creative is like,” Wagonfeld said. Teams that adopt AI, though, can move more quickly. “You can just get out there with so many more messages faster, and then you can think more holistically about what metrics am I driving for,” she added. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Marc Manara, head of startups at OpenAI, has found many startups have embraced AI in their GTM strategy, though it’s not necessarily with the sole focus of minimizing how many resources they put toward it. “There’s a movement of, yes, you can do more with less, but you can also be very focused with how you do it,” he said. “The degree of personalization and signal following that you can do with AI is differentiated now.” Specifically, he said there are tools that help build leads that are much more sophisticated than in the past. Rather than just a simple query of a database, AI prompts can help startups find prospective customers that fit a very specific set of requirements. Inbound marketing has changed, too, he added, by using the results of those prompts to qualify and score inbound leads “with a lot more precision could have been in the past.” When it comes time for a startup to begin crafting its go-to-market strategy, Wagonfeld said it’s important to consider what qualities it might want in a GTM team. “It’s a change in hiring perspective, where in the past it was more about hiring specialists, people who really knew, sometimes even like a sub-specialty within marketing or within sales. And now it’s hiring for a sense of curiosity and understanding,” she said. “It’s almost the top thing to hire for now.” Topics AI, Google, google cloud, GTMfund, OpenAI, Startups, TechCrunch Disrupt, TechCrunch Disrupt 2025 Tim De Chant Senior Reporter, Climate Tim De Chant is a senior climate reporter at TechCrunch. He has written for a wide range of publications, including Wired magazine, the Chicago Tribune, Ars Technica, The Wire China, and NOVA Next, where he was founding editor. De Chant is also a lecturer in MIT’s Graduate Program in Science Writing, and he was awarded a Knight Science Journalism Fellowship at MIT in 2018, during which time he studied climate technologies and explored new business models for journalism. He received his PhD in environmental science, policy, and management from the University of California, Berkeley, and his BA degree in environmental studies, English, and biology from St. Olaf College. You can contact or verify outreach from Tim by emailing tim.dechant@techcrunch.com. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far a",
  "wordCount": 907,
  "author": "Tim De Chant",
  "hash": "efb77de657f08be4"
}