{
  "url": "https://techcrunch.com/2025/12/29/vcs-predict-strong-enterprise-ai-adoption-next-year-again/",
  "title": "VCs predict strong enterprise AI adoption next year — again | TechCrunch",
  "snippet": "Competitors like Meta and Shopify have been exploring AI-powered tools for businesses for customer support and outreach. The search giant also",
  "domain": "techcrunch.com",
  "publishedDate": "2025-12-29T06:00:00-08:00",
  "extractedText": "It’s been three years since OpenAI released ChatGPT and kicked off a surge in innovation and attention on AI. Since then, optimists have regularly claimed that AI will become a critical part of the enterprise software industry, and so enterprise AI startups mushroomed on the back of immense amounts of investment. But enterprises are still struggling to see the benefit of adopting these new AI tools. An MIT survey in August found that 95% of enterprises weren’t getting a meaningful return on their investments in AI. So when will businesses start seeing real benefits from using and integrating AI? TechCrunch surveyed 24 enterprise-focused VCs, and they overwhelmingly think 2026 will be the year when enterprises start to meaningfully adopt AI, see value from it, and increase their budgets for the tech. Enterprise VCs have been saying that for three years now. Will 2026 actually be different? Let’s hear what they have to say: What enterprise-related trends do you expect to take off in 2026? Kirby Winfield, founding general partner, Ascend: Enterprises are realizing that LLMs are not a silver bullet for most problems. Just because Starbucks can use Claude to write their own CRM software doesn’t mean they should. We’ll focus on custom models, fine tuning, evals, observability, orchestration, and data sovereignty. Molly Alter, partner, Northzone: A subset of enterprise AI companies will shift from product businesses to AI consulting. These companies may start with a specific product, such as AI customer support or AI coding agents. But once they have enough customer workflows running off their platform, they can replicate the forward-deployed engineer model with their own team to build additional use cases for customers. In other words, many specialized AI product companies will become generalist AI implementers. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Marcie Vu, partner, Greycroft: We’re very excited about the opportunity in voice AI. Voice is a far more natural, efficient, and expressive way for people to communicate with each other and with machines. We’ve spent decades typing on computers and staring at screens, but speech is how we engage in the real world. I am eager to see how builders reimagine products, experiences, and interfaces with voice as the primary mode of interaction with intelligence. Alexa von Tobel, founder and managing partner, Inspired Capital: 2026 will be the year AI reshapes the physical world — especially in infrastructure, manufacturing, and climate monitoring. We are moving from a reactive world to a predictive one, where physical systems can sense problems before they become failures. Lonne Jaffe, managing director, Insight Partners: We’re watching how frontier labs approach the application layer. A lot of people assumed labs would just train models and hand them off for others to build on, but that doesn’t seem to be how they are thinking about it. We may see frontier labs shipping more turnkey applications directly into production in domains like finance, law, healthcare, and education than people expect. Tom Henriksson, general partner, OpenOcean: If I had to pick one word for quantum in 2026, it’s momentum. Trust in quantum advantage is building fast, with companies publishing roadmaps to demystify the tech. But don’t expect major software breakthroughs yet; we still need more hardware performance to cross that threshold. Which areas are you looking to invest in? Emily Zhao, principal, Salesforce Ventures: We are targeting two distinct frontiers — AI entering the physical world and the next evolution of model research. Michael Stewart, managing partner, M12: Future datacenter technology. For the last year or so, we’ve been standing up a few new investments that signal our interest in future “token factory” technology, with an eye towards what can really advance how efficiently and cleanly they run. This is going to continue in 2026 and beyond, in categories that include everything within the walls of the data center: cooling, compute, memory, and networking within and between site",
  "wordCount": 3155,
  "author": "Rebecca Szkutak",
  "hash": "f2967087dc1e9142"
}