{
  "url": "https://techcrunch.com/2025/08/08/pinterest-ceo-says-agentic-shopping-is-still-a-long-way-out/",
  "title": "Pinterest CEO says agentic shopping is still a long way out | TechCrunch",
  "snippet": "Investors are likely concerned that if AI began to understand users' interests, they could preemptively direct users to shop from their own",
  "domain": "techcrunch.com",
  "publishedDate": "2025-08-08T09:33:18-07:00",
  "extractedText": "Pinterest CEO Bill Ready told investors on the company’s second-quarter earnings call that the social app and inspirational bookmarking site could be considered an “AI-enabled shopping assistant.” However, he thinks that the agentic web, where AI agents shop on users’ behalf, is still far in the future. The remarks were made in response to a question about the agentic web, which could impact the search funnel and businesses like Pinterest, which positions itself at the early stages of the shopping journey — around the time when users are seeking ideas that could later turn into purchases. Investors are likely concerned that if AI began to understand users’ interests, they could preemptively direct users to shop from their own personalized recommendations instead of using platforms like Pinterest. “I think this notion of an agent just going and buying all the things for you without you doing anything …” Ready said on the Q2 earnings call. “I think that’s going to be a very, very long cycle for that to play out, both in terms of how the users think about it, where the users are going to be ready to just let something go run off and do everything for them, save for maybe some very utilitarian journeys,” he noted. Still, he pushed for Pinterest to be thought of as an AI-enabled shopping assistant, saying that the company doesn’t talk about it that way, usually, because it’s not how users think of it. “But when users say things like ‘Pinterest just gets me,’ it’s because they can open the app and the app is going to make recommendations to them proactively on things that they’re really interested in, that align with their taste and their style, the way that a really great personal shopping assistant would,” he said. The company referred to this moment in time, when businesses are exploring all the ways to create new, AI-driven experiences, as a “Cambrian moment,” and touched on the various ways it had put AI to work already. This included AI-powered recommendation and personalization systems, the use of proprietary AI models (including multimodal AI that combines text and images), visual search experiences, conversational search, and AI-powered advertising efficiencies. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Not addressed were the growing user concerns that too much of Pinterest is now filled with AI-generated, low-quality content. The situation became so bad that Pinterest earlier this year had to launch a new set of tools to fight this invasion, like labels for AI-generated images and controls for users to filter out generative AI pins. The discussion also omitted mention of mass user bans, which users believe stem from an overreliance on poorly designed AI moderation systems. (Pinterest wouldn’t say if that’s the case, only chalking them up to an internal error. However, similar problems are cropping up across social media, including on Facebook, Instagram, and Tumblr.) On the call, Ready also spoke about how Pinterest aims to compete in the war for AI talent, saying that people who want to work there care about AI that’s used for good and used “responsibly.” “On the mission side, I think we really, really punch above our weight,” the exec explained. “Both in terms of what we’re doing with tuning AI for positivity, creating a more positive alternative to what’s happening in the rest of social media,” he said. Pinterest stock dropped after earnings, as the company reported a beat on sales, with revenue of $998 million, but earnings per share at 33 cents (adjusted) fell short of the 35 cents analysts expected. The company also noted that over half its monthly users were Gen Z, and male users were up 95% year-over-year. Topics agentic ai, AI, Apps, bill ready, Commerce, Pinterest Sarah Perez Consumer News Editor Sarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software. You can contact or verify o",
  "wordCount": 984,
  "author": "Sarah Perez",
  "hash": "f29c45eeea6717fe"
}