{
  "url": "https://techcrunch.com/2025/11/13/google-expands-ai-shopping-with-conversational-search-agentic-checkout-and-an-ai-that-calls-stores-for-you/",
  "title": "Google augments AI shopping with conversational search, agentic checkout and an AI that calls stores for you | TechCrunch",
  "snippet": "Google is expanding AI shopping with conversational search, agentic checkout, and an AI that calls stores for you about local inventory.",
  "domain": "techcrunch.com",
  "publishedDate": "2025-11-13T06:00:00-08:00",
  "extractedText": "Google is rolling out a suite of AI shopping updates just ahead of the holiday season. The company on Thursday unveiled a host of new tools and features, including conversational shopping in Google Search, new shopping features within its Gemini app, agentic checkout, and even an AI tool that can call local stores to find out if a product you want is available. The company believes the additions will help improve the online shopping experience, which can still today involve a lot of drudgery, explained Vidhya Srinivasan, VP and GM of ads and commerce at Google, in a press briefing ahead of the launch. “We feel it really shouldn’t be so tedious, and shopping should feel — and can feel — a lot more natural and easy,” she said. “The idea here is we want to hold on to all the fun parts of shopping, like the browsing, like the serendipitous discovery, and things like that, but then skip all the tedious, hard parts.” Image Credits:Google One update will allow consumers to ask shopping questions in AI Mode, Google’s conversational search feature that lets you use natural language queries in a chatbot-style interface. The responses will be tailored to your question, and the chatbot will provide images when you need visual inspiration, alongside other details like price, reviews, and available inventory. So if you were looking for cozy sweaters in autumn colors, you’d see photos of the options available to you. But if you were comparing items, like skin care products, Google may instead return insights in a comparison table. Image Credits:Google Google noted that AI Mode is powered by its Shopping Graph, which includes over 50 billion product listings, 2 billion of which are updated every hour, and said the inventory information you see is usually up-to-date. Another shopping update will enable the Gemini app to provide fleshed-out ideas as responses, instead of just text suggestions in response to shopping-related questions. This is only available to users in the U.S. currently. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW The company confirmed that consumers using AI Mode will see sponsored listings, but as the features are still experimental, these ads won’t appear in the Gemini mobile app just yet. Notably, Google is rolling out agentic checkout within Google Search in the U.S., including in AI Mode. The feature is currently compatible with merchants like Wayfair, Chewy, Quince, and select Shopify stores. Image Credits:Google To use agentic checkout, you can begin by tracking an item’s price to be notified if the price drops to fall within your budget. You can then opt to have Google purchase the item for you on the merchant’s website using Google Pay. The company says it will always ask your permission first, and will have you confirm your purchase and shipping details. “This is helpful for shoppers, because they don’t have to constantly check to see if the item they want is on sale. And it’s great for retailers because it brings back the customer who might otherwise have moved on,” said Lilian Rincon, VP of product management for Google Shopping, during the briefing. “Agentic checkout is built on Google’s trusted shopping graph and also G Pay, so you can rest assured that you’re seeing accurate results and that your payment information is secure,” she noted. Image Credits:Google Another AI feature can call businesses on your behalf to find out if a store carries a product, how much it costs, and whether there are any promotions. The feature is built on Google’s Duplex technology, introduced back in 2018, as well as its Shopping Graph and payments infrastructure. After you’ve provided information about the product you’re looking for, the AI will call local stores and make inquiries about the product, then come back to you with a summary of its findings. This feature is rolling out now in the U.S. for specific categories like toys, health and beauty products, and electronics. To use this feature, you can search for products “near me,” then use the option “Let Google Call.” The AI will then walk you through questions ",
  "wordCount": 1167,
  "author": "Sarah Perez",
  "hash": "f300327db5903635"
}