{
  "url": "https://techcrunch.com/2024/01/08/amazon-turns-to-ai-to-help-customers-find-clothes-that-fit-when-shopping-online/",
  "title": "Amazon turns to AI to help customers find clothes that fit when shopping online | TechCrunch",
  "snippet": "Amazon has introduced AI into the online shopping experience in four ways: in personalized size recommendations, a “Fit Insights” tool for sellers, AI-powered",
  "domain": "techcrunch.com",
  "publishedDate": "2024-01-08T07:42:36-08:00",
  "extractedText": "After recently turning to generative AI to enhance its product reviews, e-commerce giant Amazon today shared how it’s now using AI technology to help customers shop for apparel online. The company explains it’s now using large language models, generative AI and machine learning to power four AI-powered features that will help customers find clothing that fits — an ongoing challenge when shopping online and the leading cause for apparel returns. According to a study by Coresight Research, the average return rate for clothing ordered online is 24.4%, which is eight percentage points higher than the overall online return rate. In addition, retailers and brands said online returns had grown over the past two years. Often, that’s in part because today’s consumers will buy an item in multiple sizes or colors and then return those that don’t work out, as the process of home try-ons and shipping items back has become easier. To address this challenge, Amazon has introduced AI into the online shopping experience in four ways: in personalized size recommendations, a “Fit Insights” tool for sellers, AI-powered highlights from fit reviews left by other customers and reimagined size charts. With the personalized size recommendations, Amazon Fashion used AI to develop a deep learning algorithm that will help customers find their best-fitting size across a variety of styles. This system works by considering the size relationship between brands’ size systems, the product’s reviews and the customer’s own fit preferences. The information is combined in real-time to make suggestions of the best-fitting size for a customer and adapts as the customer’s size needs change. The company also uses AI to help them discover the styles that fit them best. However, this feature can be imperfect if a family member regularly shops for another — like their teen son or daughter — as it confuses the system as to what size the customer is versus the child. (Amazon says this would not occur if the customer was browsing a children’s department versus an adult’s; it also notes that customers can create separate profiles for fit preferences through the “find your size” feature.) Image Credits: Amazon Another new feature, “Fit Review Highlights,” could help combat that problem, however. This feature is an extension of the newly added AI-generated Customer Review Highlights introduced in August 2023, which provide a short paragraph summary that details the customer sentiment and product features, as well as provides key product attributes as clickable buttons. Image Credits: Amazon With the Fit Review Highlights, Amazon extracts information about the apparel’s fit from the customer reviews, including things like size accuracy, garment fit on specific body areas and fabric stretch. Large language models extract details from the customer reviews and then AI summarizes the findings into an easy-to-read highlight personalized to the user, Amazon explains. This could help save users time as they wouldn’t have to read through hundreds of reviews to get a sense of the item’s fit. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW The retailer is also now leveraging AI to improve size charts across the site. With large language models, Amazon Fashion is extracting and cleaning product size charts from multiple sources and then transforming the data into standardized sizes. This process will remove duplicate information and auto-correct missing or incorrect measurements, leading to more accurate charts — and therefore, fit. Image Credits: Amazon Sellers, too, will gain access to AI-powered insights. With a Fit Insights Tool from Amazon Fashion, sellers are provided with an understanding of a customer’s fit needs so they can improve how they communicate sizing to customers — e.g. “true to size,” or if an item runs smaller or larger, for instance. This information can also be used to guide their future manufacturing efforts, Amazon notes. In this case, large language models are used to extract and aggregate customer feedback on fit, style and fabric in addition to retur",
  "wordCount": 1285,
  "author": "Sarah Perez",
  "hash": "f789c16ffe9eda82"
}