{
  "url": "https://techcrunch.com/2025/08/28/how-a-16-year-old-company-is-easing-small-businesses-into-ai/",
  "title": "How a 16-year-old company is easing small businesses into AI | TechCrunch",
  "snippet": "It recently rolled out a generative AI-powered tool called the “Opportunity Engine” that slots into its existing customer dashboard. The tool",
  "domain": "techcrunch.com",
  "publishedDate": "2025-08-28T05:30:00-07:00",
  "extractedText": "Amid all the “is this a bubble?” talk about artificial intelligence, the supply chain and logistics industries have become breeding grounds for seemingly genuine uses of the technology. Flexport, Uber Freight, and dozens of startups are developing different applications and winning blue-chip customers. But while AI helps Fortune 500s pad their bottom line (and justify the next layoff to Wall Street), the right use of the tech is proving useful to smaller businesses. Netstock, an inventory management software company founded in 2009, is working on just that. It recently rolled out a generative AI-powered tool called the “Opportunity Engine” that slots into its existing customer dashboard. The tool pulls info from a customer’s Enterprise Resource Planning software and uses that information to make regular, real-time recommendations. Netstock claims the tool is saving those businesses thousands. On Thursday, the company announced it has served up 1 million recommendations to date, and that 75% of its customers have received an Opportunity Engine suggestion valued at $50,000 or more. While tantalizing, one of those customers — Bargreen Ellingson, a family-run 65-year-old restaurant supply company — was initially apprehensive about using an artificial intelligence product. “Old family companies don’t trust blind change a lot,” chief innovation officer Jacob Moody told TechCrunch. “I could not have gone into our warehouse and said, ‘Hey, this black box is going to start managing.’” Instead, Moody pitched Netstock’s AI internally as a tool that warehouse managers could “either choose to use, or not use” — a process he describes as “eagerly, but cautiously dipping our toes” into AI. Techcrunch event Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. Join the Disrupt 2026 Waitlist Add yourself to the Disrupt 2026 waitlist to be first in line when Early Bird tickets drop. Past Disrupts have brought Google Cloud, Netflix, Microsoft, Box, Phia, a16z, ElevenLabs, Wayve, Hugging Face, Elad Gil, and Vinod Khosla to the stages — part of 250+ industry leaders driving 200+ sessions built to fuel your growth and sharpen your edge. Plus, meet the hundreds of startups innovating across every sector. San Francisco | October 13-15, 2026 WAITLIST NOW Moody says it’s helping avoid mistakes, in part because it’s sifting through myriad reports his staff uses to make inventory decisions. He acknowledged the AI summaries of this info are not 100% accurate, but said it “helps create signals from the noise” quickly, especially during off-hours. Image Credits:Netstock The “more profound” change Moody noticed is the software made some of Bargreen Ellingson’s less-senior warehouse staff “more effective.” He highlighted an employee in one of Bargreen’s 25 warehouses who has worked there for two years. The employee has a high school diploma but no college degree. Training this employee to understand all of the inventory management tools and the forecasting information Bargreen uses to plan inventory levels will take time, he said. “But he knows our customers, he knows what he’s putting on the truck every day, so for him, he can look at the system and have this prosaic AI-driven insight and very quickly understand whether it makes sense or doesn’t make sense,” he said. “So he feels empowered.” Netstock co-founder Barry Kukkuk told TechCrunch that he understands the hesitancy around new technologies — especially because so many products are essentially mediocre chatbots attached to existing software. He attributes the early success of Netstock’s Opportunity Engine to a few things. The company has more than a decade’s worth of data from working with retailers, distributors, and light manufacturers. That data is tightly protected to adhere to ISO frameworks, but it’s what powers the models that make the recommendations. (He said Netstock is using a combination of AI tech from the open source community and private companies.) Each recommendation can be rated with a thumbs up or thumbs down, but the models also get reinforced by whether the customer takes the suggested action or not. While that kind of reinforcement learning can lead to weird, sometimes harmful results when applied to things like social media, Kukkuk said he’s chasing different incentives. “I don’t really care about eyeballs, you know?” he said. “Facebook and Instagram care about eyeballs, so they want you to look at their stuff. We care about: ‘what is the outcome for the customer?’” Kukkuk’s wary of expanding those interactions due to the limitations of current generative AI tech. While it mi",
  "wordCount": 1356,
  "author": "Sean O'Kane",
  "hash": "f8998820e0dda8a4"
}