{
  "url": "https://techcrunch.com/2025/07/28/google-chrome-adds-ai-powered-store-summaries-to-help-u-s-shoppers/",
  "title": "Google Chrome adds AI-powered store summaries to help US shoppers | TechCrunch",
  "snippet": "Google on Monday announced an update to its Chrome web browser that will introduce AI-generated store reviews to U.S. shoppers with the aim",
  "domain": "techcrunch.com",
  "publishedDate": "2025-07-28T10:00:00-07:00",
  "extractedText": "Google on Monday announced an update to its Chrome web browser that will introduce AI-generated store reviews to U.S. shoppers with the aim of helping to determine the best places to make a purchase. The feature, which will be available by clicking an icon just to the left of the web address in the browser, will display a pop-up that informs consumers about the store’s reputation for things like product quality, shopping, pricing, customer service, and returns. The feature, which is currently available only in English, will generate the summaries based on reviews from partners, including Bazaarvoice, Bizrate Insights, Reputation.com, Reseller Ratings, ScamAdviser, Trustpilot, TurnTo, Yotpo, Verified Reviews, and others. The feature will initially be available to Chrome on the desktop. When reached for comment, Google could not confirm if or when AI summaries would come to mobile devices. Image Credits:Google Google says the goal with the summaries is to provide a safer and more efficient shopping experience. However, the feature also helps Google better compete with other AI features rolled out by retail giant Amazon, which has been using the new technology to summarize product ratings and reviews, help customers find clothes that fit, get product recommendations and comparisons, and more. The changes arrive as Google, for the first time in many years, is facing a potential competitive threat to Chrome’s dominance in the global browser market. New AI-powered browsers like Perplexity’s Comet, The Browser Company’s Dia, Opera Neon, and perhaps a challenger from OpenAI have the search giant thinking about how to infuse AI more directly into its own web browser. For example, Google is developing an AI agent that would be able to take control of Chrome for you to take actions on your behalf. Plus, the company recently added support for its Gemini AI assistant in Chrome for Gemini subscribers. The move is also part of a broader initiative underway at Google to make it more of a modern-day shopping platform for consumers. Already, the company has tapped AI to help customers locate the products they’re interested in, get personalized product recommendations, and virtually try on clothes, and it has been developing tools for better price tracking, shopping in Google’s AI Mode, and AI-powered agentic checkout. (The latter two were announced at this year’s Google I/O developer conference. Google recently announced that getting outfit and room inspiration in AI Mode would roll out this fall.) Topics AI, Commerce, Google, shopping Sarah Perez Consumer News Editor Sarah has worked as a reporter for TechCrunch since August 2011. She joined the company after having previously spent over three years at ReadWriteWeb. Prior to her work as a reporter, Sarah worked in I.T. across a number of industries, including banking, retail and software. You can contact or verify outreach from Sarah by emailing sarahp@techcrunch.com or via encrypted message at sarahperez.01 on Signal. View Bio Dates TBD Locations TBA Plan ahead for the 2026 StrictlyVC events. Hear straight-from-the-source candid insights in on-stage fireside sessions and meet the builders and backers shaping the industry. Join the waitlist to get first access to the lowest-priced tickets and important updates. Waitlist Now Most Popular The most bizarre tech announced so far at CES 2026 Lauren Forristal How Quilt solved the heat pump’s biggest challenge Tim De Chant A viral Reddit post alleging fraud from a food delivery app turned out to be AI-generated Amanda Silberling Founder of spyware maker pcTattletale pleads guilty to hacking and advertising surveillance software Zack Whittaker This is Uber’s new robotaxi from Lucid and Nuro Sean O'Kane Lego Smart Bricks introduce a new way to build — and they don’t require screens Amanda Silberling Hacktivist deletes white supremacist websites live onstage during hacker conference Lorenzo Franceschi-Bicchierai",
  "wordCount": 617,
  "author": "Sarah Perez",
  "hash": "fbfb52c099b10b47"
}