{
  "url": "https://ww.fashionnetwork.com/news/Frasers-group-dives-headfirst-into-agentic-commerce-with-commercetools-link-up,1774285.html",
  "title": "Frasers Group dives headfirst into agentic commerce with Commercetools link-up - FashionNetwork",
  "snippet": "# Frasers Group dives headfirst into agentic commerce with Commercetools link-up. Frasers Group on Thursday announced a deal that means shoppers will be able to “discover and purchase products from Frasers Group’s retail ecosystem directly within AI shopping channels such as ChatGPT” via the Agentic",
  "domain": "ww.fashionnetwork.com",
  "extractedText": "By Sandra Halliday Published October 16, 2025 Reading time 2 minutes Download Print Text size aA+ aA- Frasers Group dives headfirst into agentic commerce with Commercetools link-up By Sandra Halliday Published October 16, 2025 Frasers Group on Thursday announced a deal that means shoppers will be able to “discover and purchase products from Frasers Group’s retail ecosystem directly within AI shopping channels such as ChatGPT” via the Agentic Commerce Protocol (ACP). CommercetoolsIt’s linking up in an exclusive European retail partnership for agentic commerce with Commercetools and becomes the first European retailer to deploy the firm’s full agentic commerce suite. For those who’ve not heard of it, Commercetools is a major AI-first commerce platform for global enterprises.It means shoppers of retail brands such as Sports Direct, Flannels and Frasers get a variety of benefits, including “richer personalisation” and being able to complete purchase via ChatGPT.And the company said it makes it a sector leader in AI-first shopping with the link-up forming “a key part of Frasers Group’s broader AI strategy to reimagine the customer journey across its brand and retail ecosystems”.“The digital customer ecosystem is evolving faster than ever before, and so are customers’ expectations,” said David Clark, chief customer officer at Frasers Group. “With this partnership, [we’re] now at the forefront of this evolution to deliver enhanced customer experiences across ChatGPT, Gemini and Perplexity – including native checkout in ChatGPT. This marks a shift in our digital capabilities, delivering an even more intuitive and personalised shopping experience for our consumers. Crucially, it builds on our group-wide investment into cutting-edge MACH Architecture to lead the group into a new era of seamless agentic commerce.”And Commercetools CEO Andrew Burton added that “the future of commerce is agentic, and it’s arriving faster than most retailers realise. Frasers Group understands that when customers start delegating shopping to agents or doing their shopping through an LLM, the retailers who will win will be those ready to deliver seamless, trusted, consistent experiences through those agents. As our exclusive European retail launch partner, [it’s] setting the standard for how established retailers can move at the speed of this transformation—preparing to deploy agentic commerce responsibly, securely, and at scale across a diverse brand portfolio.” Copyright © 2026 FashionNetwork.com All rights reserved. Tags : Fashion Luxury Beauty Fashion Luxury Beauty Retail Innovations",
  "wordCount": 383,
  "author": "\n                                                                                            \n                                                \n                                                                                        Sandra Halliday\n                                        ",
  "hash": "0a0dede3b5dd5840"
}