{
  "url": "https://mosaicdatascience.com/2023/01/23/maximizing-revenue-with-machine-learning-for-retail-pricing/",
  "title": "Machine Learning for Retail Pricing to Maximize Revenue from Mosaic",
  "snippet": "Machine learning techniques produce accurate predictive models of demand-price elasticity, which can help retailers stay competitive and",
  "domain": "mosaicdatascience.com",
  "publishedDate": "2023-01-23T10:39:18-05:00",
  "extractedText": "Summary Mosaic helped a nationwide retailer model the price elasticity of demand across their product catalog, empowering them to optimize prices and maximize SKU revenue. Take Our Content to Go Introduction For retailers across the nation, predicting the effect that a change in sales price will have on demand is vital to optimizing prices and maximizing sales revenue. Without a reliable model, retailers rely on gut feel and Excel-based tools to answer critical questions such as: How much will sales increase if I drop my price by X% to get inventory out the door? How much will sales decrease if I increase my price by X% to avoid stock-outs? According to McKinsey, effectively and profitably linking pricing and promotions together using machine learning for retail pricing can increase revenue and profiles by three to five percentage points overall. In addition, companies that efficiently implement this approach often achieve improved customer satisfaction and loyalty. Mosaic helped a nationwide retailer answer these questions across their product catalog, a critical first step for their pricing team to optimize and standardize pricing across several thousand SKUs. The retailer was struggling with finding the right processes and tools to guide decisions on pricing. Mosaic matched the proper analytics tool and technique with their specific use case, delivering actionable predictive and prescriptive analytics regardless of the company’s level of analytics maturity. At every phase during the project, Mosaic acted as a true partner, collaborating effectively with the retailer to make sense of the observations uncovered in the data and the implications that certain estimates might have on the business. Mosaic interchanged data scientists with the team as requirements shifted, helping the firm set profitable prices while maintaining a consistent customer experience. Mosaic was critical in enabling the retailer to design & deploy machine learning for retail pricing. Price Elasticity of Demand The key economic law underpinning this modeling effort is the price elasticity of demand. This is a measurement of the estimated change in demand in relation to a change in price. If the price changes by X%, the elasticity coefficient is the percentage by which we expect demand to change as a response. Here is how the price elasticity of demand is expressed mathematically: Where the elasticity coefficient θ is equal to the change in demand q divided by the change in price p. For example: If price increases by 20% and demand drops by 10%, elasticity coefficient is -10/20 = -0.50 If price decreases by 20% and demand increases by 10%, elasticity is also -0.50 Economists assume that elasticity is linear and that the coefficient is constant across all price changes. Elasticity coefficients are typically negative values and will vary depending on the product in question. Some products are more elastic than others. For example, a grande triple pumpkin spice soy macchiato is more elastic than gas because when inflation goes up, gas is more essential. Examples of factors that affect the price elasticity of demand for a product are: Necessity: The more necessary a product is, the lower the elasticity. This implies that even large increases in price will result in small decreases in demand. Substitutability: Elasticity will be higher if more substitutes are available. For example, large increases in price will result in large decreases in demand because consumers have other options. Brand loyalty: Where consumers are attached to a particular brand, elasticity tends to be lower because consumers are still willing to buy a product even if the price increases. Duration: If a higher price holds for a long time, consumers tend to accept the new price, resulting in less elastic demand. Income effect: The higher the percentage of a consumer’s income relative to a product’s price, the higher the elasticity typically is. The more negligible the price change is relative to income, the less elastic it is. Breadth of definition: The broader the definition of a good or service, the lower the elasticity tends to be. For example, food in general is not very elastic, while specific types of food may be more elastic (e.g. seafood) because consumers have other options. Addictiveness: Goods that are more addictive tend to be less elastic. This relates to necessity because consumers who are addicted to cigarettes treat them as necessary. Payer: When the consumer does not directly pay for a good (e.g. corporate expense accounts), demand is typically less elastic. For example, a price hike at a high-end restaurant will be negligible if the consumer pays for the meal with a company card. Price Elasticity of Demand Modeling Mosaic engaged with a nationwide retailer to deliver models using machine learning for retail pricing that would determine price elasticity of demand across their product catalog. Here we describe the high-level approach taken to develop these",
  "wordCount": 1720,
  "author": "Published by Sel Gerosa on January 23, 2023 January 8, 2024\n",
  "hash": "0ebaa178165ba023"
}