{
  "url": "https://blog.google/products/ads-commerce/agentic-commerce-ai-tools-protocol-retailers-platforms/",
  "title": "New tech and tools for retailers to succeed in an agentic shopping era",
  "snippet": "[Skip to Main Content](https://blog.google/products/ads-commerce/agentic-commerce-ai-tools-protocol-retailers-platforms/#jump-content). [Share](https://blog.google/products/ads-commerce/agentic-commerce-ai-tools-protocol-retailers-platforms/). [x.com](https://twitter.com/intent/tweet?text=New%20tech",
  "domain": "blog.google",
  "publishedDate": "2026-01-11",
  "extractedText": "Google Ads New tech and tools for retailers to succeed in an agentic shopping era Jan 11, 2026 · Share x.com Facebook LinkedIn Mail Copy link We’re announcing a new open standard for agentic commerce and AI tools to help retailers connect with high-intent shoppers and drive sales. Vidhya Srinivasan VP/GM Ads and Commerce Read AI-generated summary Bullet points \"New Tech and Tools for Retailers\" discusses AI's role in agentic shopping and retail growth. The Universal Commerce Protocol (UCP) is a new open standard for agentic commerce across platforms. Business Agent lets shoppers chat with brands directly on Search, like a virtual sales associate. New Merchant Center data attributes help retailers get discovered in conversational commerce. Direct Offers in Google Ads let retailers present exclusive discounts to shoppers ready to buy. Summaries were generated by Google AI. Generative AI is experimental. Share x.com Facebook LinkedIn Mail Copy link The pace of innovation in retail is incredible, and agentic commerce — where AI completes tasks on people’s behalf — is evolving from a concept to reality. Last year, we introduced agentic tools for shoppers and made agent-led payments seamless and secure with our Agent Payments Protocol (AP2). We believe in an agentic commerce future that is open, collaborative and built for everyone to succeed. Partnering with leading retailers and platforms, we’re sharing several announcements today that are an important step in that journey.Unlock retail growth with a new open standardToday, we’re launching the Universal Commerce Protocol (UCP), a new open standard for agentic commerce that works across the entire shopping journey — from discovery and buying to post-purchase support. UCP establishes a common language for agents and systems to operate together across consumer surfaces, businesses and payment providers. So instead of requiring unique connections for every individual agent, UCP enables all agents to interact easily. UCP is built to work across verticals and is compatible with existing industry protocols like Agent2Agent (A2A), Agent Payments Protocol (AP2) and Model Context Protocol (MCP).UCP was co-developed with industry leaders including Shopify, Etsy, Wayfair, Target and Walmart, and endorsed by more than 20 others across the ecosystem like Adyen, American Express, Best Buy, Flipkart, Macy’s Inc., Mastercard, Stripe, The Home Depot, Visa and Zalando. Support of the Universal Commerce Protocol from across the ecosystem. To start, UCP will soon power a new checkout feature on eligible Google product listings in AI Mode in Search and the Gemini app, allowing shoppers to check out from eligible U.S. retailers right as they’re researching on Google. The feature is built with security at its core: shoppers can buy confidently with Google Pay using payment methods and shipping info already saved in Google Wallet and soon, will be able to make a purchase with PayPal. Retailers remain the seller of record, with the ability to customize the integration to their specific needs, all while helping to capture sales and avoid abandoned carts. In the coming months, we’ll work with retailers to expand globally and add more capabilities — like discovering related products, applying loyalty rewards, and powering custom shopping experiences on Google. Buy directly from eligible retailers on Google’s AI surfaces. Connect with customers using a branded AI agentWe’re also launching Business Agent, a new way for shoppers to chat with brands, right on Search. It’s like a virtual sales associate that can answer product questions in a brand’s voice, enabling retailers to connect with consumers during critical shopping moments and help drive sales.Business Agent is live starting tomorrow with retailers like Lowe’s, Michael’s, Poshmark, Reebok and others. Eligible U.S. retailers can choose to activate and customize this branded agent in Merchant Center. In the coming months, they’ll be able to train the agent based on their data, access new customer insights, provide offers for related products and enable direct purchases — including agentic checkout — within the experience. Shoppers can chat with eligible retailers directly on Search. Optimize your presence in the conversational commerce eraThe way people shop is changing, but our goal remains the same: to help retailers get discovered. That’s why we’re announcing dozens of new data attributes in Merchant Center designed for easy discovery in the conversational commerce era, on surfaces like AI Mode, Gemini and Business Agent. These new attributes complement retailers’ existing data feeds and go beyond traditional keywords to include things like answers to common product questions, compatible accessories or substitutes. We will be rolling these out with a small group of retailers soon and expanding to more in the coming months.Introducing Direct OffersAs shoppers turn to AI for discovery, retailers need smarter ways to deliver value. That",
  "wordCount": 1028,
  "hash": "12267c017287fdf7"
}