{
  "url": "https://www.retaildive.com/news/walmart-ai-shopping-strategy-tinkering-transformation/809556/",
  "title": "Walmart: This year, AI tinkering ‘becomes transformation’ | Retail Dive",
  "snippet": "Walmart's customer AI agent, Sparky, can already recognize if a specific shopper buys the same items every week and suggest a new order to that",
  "domain": "retaildive.com",
  "extractedText": "An article from Walmart: This year, AI tinkering ‘becomes transformation’ A year from now, customers will look back and realize just how much has changed about the shopping experience, Walmart’s Daniel Danker predicts. Published Jan. 15, 2026 Cara Salpini Senior Editor Share Copy link Email LinkedIn X/Twitter Facebook Print License Add us on Google Walmart's Sparky AI agent is already fielding customer service questions and encouraging shoppers to place a regular order. Courtesy of Walmart Listen to the article 5 min This audio is auto-generated. Please let us know if you have feedback. ORLANDO, Fla. — Walmart hasn’t been shy about its AI ambitions. The retail giant announced an AI framework centered around four super agents over the summer, enabled purchases within ChatGPT this fall and over the weekend announced a new partnership with Google’s Gemini. If it sounds like Walmart is moving fast, that’s intentional. “For the last year or two, we’ve been tinkering with it,” Daniel Danker, executive vice president of AI acceleration, product and design at Walmart, said at the ICR Conference on Tuesday. “This is the year where tinkering becomes transformation. This is the year where we’ve built a level of mastery around that and we’ll start building things that deeply address customer problems.” Danker has many examples of how AI could improve the Walmart shopping experience. For one thing, he sees repeat grocery purchases transitioning to a more automated model, with AI understanding how frequently to replenish items. For another, he envisions customers scrolling through AI-generated photos of themselves wearing the clothes they’re considering buying, or asking AI for recommendations based on what’s already in their closet. “I think of us all as carpenters, and we’ve all been using screwdrivers and suddenly someone shows up with a drill,” Danker said. “There are things you couldn’t build without power tools that you can with power tools. AI is a power tool for us.” Danker also envisions shoppers doing a lot less scrolling across the board, thanks to the new level of personalization AI offers. That shift includes Walmart learning which products a customer wants to splurge on and which they prefer value offerings for; it includes narrowing a shopper’s search results to a specific product that might best fit their needs and suggesting others that complement their purchases. “By the time you have the tomato paste and the ground beef and mozzarella, we're pretty sure you're making lasagna — and we don't need you to search eight times and scroll through many, many pages just to add the basil and the tomato sauce and the ricotta,” Danker said. “Those experiences are going to become more human, more connected. They'll understand your intent, and they'll serve it up to you much more easily.” Walmart’s customer AI agent, Sparky, can already recognize if a specific shopper buys the same items every week and suggest a new order to that customer when they enter the app. It can field customer service questions and answer questions like, “What do I use to get this wine stain out of my carpet?” It can remind shoppers that they have an appointment at Walmart’s auto care center and also a prescription to pick up. Long-term, Danker believes that the Sparky chat interface and Walmart’s traditional search bar will collapse into one search system. But for now, the two exist separately. “It's not going to happen overnight. It's also not going to happen all at once, but I do think this is a year where we will be delivering transformative experiences in commerce,” Danker said. “So you will definitely look back a year from now and say ‘Gosh, that's quite different than how I used to use Walmart. That's quite different than the expectations I used to bring when I opened an app.’” What Danker is most excited about is the potential for Walmart to enter the chat as shoppers ask services like Chat GPT and Gemini questions that aren’t directly related to shopping. Customers who are unsure of their needs may ask these services about what type of TV would fit in their space, how to get that wine stain out or how to handle a new challenge that’s emerged with their newborn baby. Those, Danker argues, are questions that may not start with the intent to purchase, but could end up that way if Walmart is showing up in those spaces. The big-box retailer’s integration with Gemini allows users to benefit from their membership perks with Walmart even if they order through the AI platform and it can also add items ordered with Gemini to a customer’s live Walmart shopping cart online, so they don’t have to place orders from multiple locations. Of course, Walmart doesn’t have direct control over whether its product offerings show up in a Chat GPT or Gemini search, but Danker sees the big-box retailer as well-positioned for the algorithms. Specifically, Walmart’s focus on price and speed will give it a leg up if AI agents are making selections for shoppers, ",
  "wordCount": 1010,
  "author": "Cara Salpini",
  "hash": "13d91d8abd44b79c"
}