{
  "url": "https://arxiv.org/html/2512.24968v2",
  "title": "The Impact of LLMs on Online News Consumption and Production",
  "snippet": "Large language models (LLMs) change how consumers acquire information online; their bots also crawl news publishers' websites for training",
  "domain": "arxiv.org",
  "extractedText": "The Impact of LLMs on Online News Consumption and Production Hangcheng Zhao Rutgers Business School. hangcheng.zhao@rutgers.edu Ron Berman The Wharton School of the University of Pennsylvania. ronber@wharton.upenn.edu (December 2025 ) Abstract Large language models (LLMs) change how consumers acquire information online; their bots also crawl news publishers’ websites for training data and to answer consumer queries; and they provide tools that can lower the cost of content creation. These changes lead to predictions of adverse impact on news publishers in the form of lowered consumer demand, reduced demand for newsroom employees, and an increase in news “slop.” Consequently, some publishers strategically responded by blocking LLM access to their websites using the robots.txt file standard. Using high-frequency granular data, we document four effects related to the predicted shifts in news publishing following the introduction of generative AI (GenAI). First, we find a moderate decline in traffic to news publishers occurring after August 2024. Second, using a difference-in-differences approach, we find that blocking GenAI bots can be associated with a reduction of total website traffic to large publishers compared to not blocking. Third, on the hiring side, we do not find evidence that LLMs are replacing editorial or content-production jobs yet. The share of new editorial and content-production job listings increases over time. Fourth, regarding content production, we find no evidence that large publishers increased text volume; instead, they significantly increased rich content and use more advertising and targeting technologies. Together, these findings provide early evidence of some unforeseen impacts of the introduction of LLMs on news production and consumption. Keywords: Large language models, Generative AI, News production, News consumption, Online News Publishers, Staggered Difference-in-Differences, Synthetic Difference-in-Differences, Labor demand, AI Slop, Digital Media 1 Introduction Generative AI (GenAI) and large language models (LLMs) are reshaping how consumers discover and consume information online. Unlike search-based discovery intermediaries (e.g., Google) that primarily redirect users to publishers through links, LLM-mediated interfaces can directly provide answers and summaries, potentially substituting away from click-through visits.111The Economist, “AI is killing the web. Can anything save it?” https://www.economist.com/business/2025/07/14/ai-is-killing-the-web-can-anything-save-it, accessed Dec 18, 2025. Recent evidence shows that LLM adoption reduces traditional search activity and downstream browsing to smaller sites, and users click external links less often when AI summaries appear in search results.222Pew Research Center 2025, “Google users are less likely to click on links when an AI summary appears in the results,” https://www.pewresearch.org/short-reads/2025/07/22/google-users-are-less-likely-to-click-on-links-when-an-ai-summary-appears-in-the-results/, accessed Dec 18, 2025. These developments raise a few interesting questions: (1) to what extent does generative AI function as a substitute for publisher traffic and monetization? (2) how do publishers respond? and (3) is this response effective? News publishers have been at the center of the debate about the impact of LLMs because LLMs use news content to improve their model training and also to answer user queries. Since the business model of news publishers depends heavily on discovery and referral from intermediaries, some publishers have been quick to respond by blocking LLM access to their websites using the robots.txt standard.333RFC 9309 https://www.rfc-editor.org/rfc/rfc9309.html, accessed Dec 18, 2025. The impact of this blocking can be three-fold: it can reduce bot traffic from LLMs used to scan the websites to train models; it can reduce bot traffic by LLMs used to answer user queries; and it can reduce referral traffic by LLMs sending users to visit the news publisher. Publishers can also try to respond by lowering headcount which would save costs, or by increasing content production using LLMs to attract more consumers. Given these different potential effects, it remains less understood (1) what the overall impact of LLMs on publisher traffic is; (2) whether blocking access is an effective strategic response; and (3) how LLM tools affect the supply of news content by publishers through hiring decisions and changes in the quantity and format of content they produce. We address these questions by constructing a high-frequency, publisher panel that links daily traffic to strategic blocking rules for LLM crawlers, publishers’ page structure, and publishers’ hiring. We combine daily domain-level visits from SimilarWeb with historical robots.txt files and HTML snapshots from the HTTP Archive and employer-linked job postings from Revelio. To separate total visits to publishers (which may include bot and crawler traffic",
  "wordCount": 8501,
  "hash": "16ca45a79ecd3e36"
}