{
  "url": "https://jumbogroup.com/media-press-releases-post/e-commerce_platform",
  "title": "Jumbo Group",
  "snippet": "Jumbo Electronics, the UAE's leading omnichannel consumer electronics retailer, has launched a new e-commerce platform that makes it convenient for consumers.",
  "domain": "jumbogroup.com",
  "extractedText": "600-532395 customer.care@jumbo.ae العربية Toggle navigation Home About Us Legacy Governance Management Structure Milestones Our Partners Our Businesses Jumbo OmniChannel Retail Jumbo Distribution Jumbo Enterprise Jumbo 3D Manufacturing Jumbo Serve Jumbo Unwired Jumbo Force Jumbo Logistics Media Centre Press Releases Jumbo News Success Stories Careers Contact Us Shop Online Press Releases Home Media Press Releases Jumbo Electronics launches its new e-commerce platform Dec 27, 2022 Dubai, UAE, 27 December 2022: Jumbo Electronics, the UAE’s leading omnichannel consumer electronics retailer, has launched a new e-commerce platform that makes it convenient for consumers in the UAE and across the region to shop for the latest products from popular tech brands. The new platform can be accessed at jumbo.ae and not only features a faster, sleeker user interface but is also mobile friendly, enabling consumers to order their product at their convenience. For a secure online shopping experience, the latest version also has superior safety features for protecting data and information, whilst supporting various modes of payment. Vikas Chadha, Jumbo Group, CEO, said: “With DSF underway and e-commerce thriving in this region, this is an exciting time for us to launch the platform. While consumer experience was always top of mind when we embarked on this project, it will go a long way in making our Omnichannel retail experience even more wholesome.” Pankaj Kumar, Jumbo Group, Head of Omni-channel Retail, said: “Jumbo Electronics is always pushing the boundaries to deliver the best services to customers and brand partners alike. The new platform with its clean interface and intuitive search features provides the best showcase for the brands. With features like deals and best-selling products, it will help boost sales of brand partners.” Built on Adobe’s Magneto platform, jumbo.ae brings a whole new level of capability to Jumbo Electronics' online shopping experience. Consumers can now browse through a far bigger assortment of products than before. A one-stop checkout function allows for a seamless shopping experience and gives shoppers the option of collecting their product in 30 minutes or having it express delivered in four hours. Visitors to the new platform can view and purchase an extensive range of products ranging from audio and television equipment to smartphones, gaming consoles and much more from world-famous brands such as Sony, Dyson, Hisense and Apple. DOWNLOAD Featured Articles Jumbo Electronics Signs Partnership with Admiral to Bring High-Quality Home Appliances to UAE Market Sep 24, 2024 Jumbo Group’s Commitment to Diversity Shines on Emirati Women’s Day Aug 29, 2024 A carnival of savings at Jumbo this Autumn Oct 17, 2023 Emirati student wins AED 25,000 from Jumbo Electronics for higher education Sep 22, 2023 Jumbo Serve expands operations across the GCC region Aug 08, 2023 Jumbo Electronics offers one lucky student a chance to win AED 25,000 in school fees Aug 07, 2023 Jumbo Enterprise takes innovation program to schools across UAE Jun 19, 2023 Jumbo Electronics re-opens Dubai Mall store May 22, 2023 Jumbo donates AED 1 million to Dubai Cares Apr 06, 2023 Jumbo announces 1 kilo of gold in prizes during DSF Dec 20, 2022 Jumbo Serve signs service agreement with Consumer Business Group UAE Nov 23, 2022 Jumbo Electronics donates Dh1 million Apr 09, 2022 The Future of Retail Delivery and E-commerce Mar 08, 2022 Shop Now, Pay Later: Jumbo Electronics Offers Payment Plan for In-Store Purchases with Spotii Sep 06, 2021 Jumbo Electronics Brings Revolutionary Fitness Equipment to UAE with Power Plate Partnership Aug 01, 2021 Jumbo Group partners with SAWA Life to bring sustainable fashion-tech to UAE Mar 07, 2021 Jumbo Distribution partners with Weber to bring the best in outdoor-grilling to the GCC Dec 07, 2020 Jumbo Group extends support to People of Determination in the UAE amidst COVID-19 pandemic Sep 20, 2020 Jumbo Unwired offers Fully Automated Security solutions for UAE residents as the demand for safety precautions surge Aug 16, 2020 Fight against Covid-19: Jumbo powers UAE’s pioneering Tawasul 171 platform that enables remote access to government services May 05, 2020 Jumbo Distribution partners with Swiss brand Laurastar to bring top-of-the range ironing products in the UAE Jan 06, 2020 It’s Raining Gold @Jumbo at the 25th edition of Dubai Shopping Festival Dec 26, 2019 Jumbo Redefines Customer Experience with a fully revamped store at Mall of the Emirates Apr 27, 2015 2026 © Jumbo Electronics Company Ltd. All Rights Reserved.",
  "wordCount": 721,
  "author": "",
  "hash": "1d17a519440a5484"
}