{
  "url": "https://www.ey.com/en_us/insights/consumer-products/how-genai-changes-the-way-cpg-and-retail-operate-and-consumers-too",
  "title": "GenAI reshapes CPG, retail and consumer relationships | EY - US",
  "snippet": "Brands and retailers have a lot of reputation to protect, and some pulled back on their use of publicly available large language models (LLMs)",
  "domain": "ey.com",
  "extractedText": "How EY can help Artificial Intelligence EY.ai, a platform that unifies human capabilities and artificial intelligence to help you confidently adopt AI. Learn more. Read more The EY Strategy Edge platform identified over 277 AI-related deals in the consumer industry market between 2020 and 2023, amounting to investments of over US$8b. Although GenAI explicitly accounts for only 5% of these deals, don’t be fooled into thinking it’s not significant. Much of the excitement around GenAI has taken place in the last year. Its ability to improve and combine with other technologies means that it has progressed rapidly through its own hype cycle and become a key consideration in the consumer market. We are already seeing use cases cascade throughout consumer businesses, ranging from faster and cheaper marketing to highly automated contracting processes. A breakdown of the identified consumer AI-related M&A deals shows them spanning the entire enterprise, with one-third related to sourcing and procurement at one end of the value chain, and one-fifth helping drive sales and last-mile solutions at the other end. While current perceptions of GenAI typically see it as a functional toolset which can be leveraged to provide solutions to a range of individual business needs, the real power will be realized when organizations start to view it as an enterprise enabler for their own business transformation. This integration will help it deliver innovative experiences for customers and employees that can drive value across multiple functions at once.",
  "wordCount": 241,
  "author": "authorsalutation: |authorfirstname:John|authorlastname:Dubois|authorjobtitle:EY Americas AI Strategy Leader|authorurl:https://www.ey.com/en_us/people/john-dubois",
  "hash": "1e6ce8c2a8a88d00"
}