{
  "url": "https://competera.ai/company/events/future-of-pricing-research",
  "title": "AI Retail TransformationCompetera logo",
  "snippet": "... AI and ML (machine learning). When introducing AI-based pricing ... Best Buy: In Best Buy's earnings call for the quarter ended October",
  "domain": "competera.ai",
  "extractedText": "The Future of Pricing: How AI Is Transforming Price Planning in Retail March 18,2024 Executive Summary Pricing is a critical business decision that can determine business success (or lack thereof) as it directly impacts a retailer’s bottom line and, if done incorrectly, can hinder sales and erode margins. We explore the current landscape of artificial intelligence (AI) within pricing strategies, as well as the technology’s overarching advantages in regard to pricing. We aim to understand the principal obstacles encountered when harnessing AI within pricing strategies and propose strategies for retailers looking to mitigate these challenges. Our analysis is informed by a recent Coresight Research survey of 150 retail business decision-makers in the US, conducted by Coresight Research on February 1–2, 2024. Market Scale and Opportunity The global retail pricing optimization software market is poised for significant growth, reflecting the retail sector’s increased reliance on technology for product pricing amid economic volatility. Coresight Research estimates that the market will total $1.6 billion in 2024 and grow at a CAGR (compound annual growth rate) of 16.5% between 2023 and 2028. The US holds the largest market share, at 51.0% (as of 2023), and is set to grow at a significant 14.8% CAGR between 2023 and 2028, with its market share totaling $1.4 billion. Coresight Research Analysis Optimal Pricing Strategies Contribute to Success The global retail pricing optimization software market is poised for significant growth, reflecting the retail sector’s increased reliance on technology for product pricing amid economic volatility. Coresight Research estimates that the market will total $1.6 billion in 2024 and grow at a CAGR (compound annual growth rate) of 16.5% between 2023 and 2028. The US holds the largest market share, at 51.0% (as of 2023), and is set to grow at a significant 14.8% CAGR between 2023 and 2028, with its market share totaling $1.4 billion. AI-Informed Pricing Decisions Are Prevalent Among Retailers Our survey found that an overwhelming majority — 92% of respondents — stated that they use an AI-based pricing solution to inform their pricing decisions. We then asked those who are currently using an AI-based pricing solution whether they have benefited from that AI-based pricing solution and found that all respondents have benefited at least “slightly.” Leveraging AI Can Be Cumbersome and Challenging While AI is prevalently used in pricing strategies and its benefits are well-known, the level of sophistication and integration varies across organizations. It can be challenging for companies to leverage an advanced AI-based pricing solution primarily due to the inputs that the algorithm requires to produce robust results. The three most widely cited challenges in leveraging AI for pricing are: a lack of integration with key complementary business functions (e.g., promotion planning); a lack of trust around AI models; and limited integration capabilities with company-wide solutions. Integrated Business Functions and Real-Time Pricing Amplify AI-Based Pricing Benefits The current state of pricing strategies and the level of integration between pricing and complementary business functions underline the underutilization of technology and a lack of sophisticated tech use. Our survey revealed that, on average, only 41% of respondents stated they have “fully integrated” their price planning strategies with the five complementary business functions we surveyed about. Examining the data by company size reveals that the opportunity is even more pressing for retailers earning less than $1 billion in total sales — only 37% of respondents from this group, on average, cited full integration across key business functions. We asked those respondents currently leveraging an AI-based pricing solution about the method they are using to inform pricing decisions and found real-time pricing has huge growth potential, with only 56% of respondents currently using real-time pricing. Outlook on AI Usage and Investments Reveals Upbeat Retailer Sentiment We asked those currently leveraging AI-based pricing solutions whether they plan to increase investments in AI-based pricing solutions in the coming 12 months: 97% of respondents stated that they plan to increase those investments in the coming year. We then asked respondents about which differentiators would cause them to pick one AI-based pricing solution over another. Our results found that the most influential differentiators were those that supported retailers’ integration goals — especially integration with key complementary business functions and with company-wide solutions. What We Think An effective pricing strategy can often be a leading driver of profits and provide an edge over the competition. Currently, there is prevalent use of AI-based pricing software in the US market and various major retailers, including Best Buy, Kroger and Macy’s, have recently highlig",
  "wordCount": 4758,
  "hash": "221b00f1e9aef80a",
  "topic": "AI_and_Strategy"
}