{
  "url": "https://hbr.org/2023/11/a-step-by-step-guide-to-real-time-pricing",
  "title": "A Step-by-Step Guide to Real-Time PricingHarvard Business Review LogoHarvard Business Review LogoHarvard Business Review LogoHarvard Business Review Logo",
  "snippet": "Pricing strategy|A Step-by-Step Guide to Real-Time Pricing. # A Step-by-Step Guide to Real-Time Pricing. by Marshall Fisher, Santiago Gallino and Jun Li. From the Magazine (November–December 2023). For digital retailers, the ability to revise prices swiftly and on a large scale has emerged as a deci",
  "domain": "hbr.org",
  "publishedDate": "2023-11-01T04:00:00.000+00:00",
  "extractedText": "Harvard Business Review LogoPricing strategyA Step-by-Step Guide to Real-Time PricingAn advanced AI model considers much more than what competitors are charging. by Marshall Fisher, Santiago Gallino and Jun LiFrom the Magazine (November–December 2023)Butenkow/Getty ImagesSummary. Leer en españolLer em portuguêsPostPostShareSaveBuy CopiesPrintFor digital retailers, the ability to revise prices swiftly and on a large scale has emerged as a decisive differentiator—especially during periods of inflation, when prices fluctuate more frequently. Many retailers scrape rivals’ websites for price information and use it to set their own prices manually or automatically, often using a strategy of charging X dollars or X percent less than the lowest-price competitor. However, retailers that use such simple heuristics miss significant opportunities because they fail to tailor their responses to product availability and demand, among other factors.Read more on Pricing strategy or related topics AI and machine learning, Algorithms, Strategy, Experimentation, Consumer behavior and Retail and consumer goodsA version of this article appeared in the November–December 2023 issue of Harvard Business Review.MFMarshall Fisher is the UPS Professor in the Operations, Information, and Decisions Department of the University of Pennsylvania’s Wharton School and a codirector of the school’s Fishman-Davidson Center for Service and Operations Management.Santiago Gallino is the Charles W. Evans Distinguished Faculty Scholar and an associate professor in the Operations, Information, and Decisions Department the University of Pennsylvania’s Wharton School and a codirector of the school’s Fishman-Davidson Center for Service and Operations Management.JLJun Li is the Michael R. and Mary Kay Hallman Fellow and an associate professor of technology and operations at the University of Michigan’s Ross School of Business.PostPostShareSaveBuy CopiesPrintRead more on Pricing strategy or related topics AI and machine learning, Algorithms, Strategy, Experimentation, Consumer behavior and Retail and consumer goods",
  "wordCount": 283,
  "hash": "229c4e6b232b8470"
}