{
  "url": "https://commercetools.com/blog/agentic-commerce-in-retail-the-very-groups-ai-journey",
  "title": "Agentic Commerce in Retail: The Very Group’s AI Journey",
  "snippet": "*UK retail powerhouse The Very Group is reimagining the customer journey in the age of AI. Muktar Mahama, Head of Digital Product, shares how the digital-first retailer is building an agentic commerce strategy — powered by composable tech and grounded in customer obsession.*. With our new Amplience ",
  "domain": "commercetools.com",
  "extractedText": "Menu Close Navigation Products Solutions Industries Customers Partners Resources About Us Support Careers Top 5 FAQs for our 60-day trial. Start Free Trial Latest commercetools Kicks Off NRF 2026 – including Updates on Stripe ACS, AI Hub, and Helping Enterprises Stay Discoverable and Shoppable in Agentic Commerce commercetools Unveils Preview Intelligent Search for Cora Powered by Google Cloud’s Vertex AI platform at NRF 2026 About Why commercetools Learn all the possibilities of how the commercetools platform can help you growth your business Support Documentation Merchant Center Training Tutorials Open Support Ticket System Status Careers Offices Jobs Hiring FAQ DEI & ESG Our Benefits Careers Free Trial Top 5 FAQs for our 60-day trial. Start Free Trial Back / Products For Business Core Products B2C Commerce B2B Commerce B2X Commerce Experiences Agentic Jumpstart AI Hub In-Store Frontend Cora AI Assistant Efficiency & Compliance Audit Log Premium Payment Hub For Developers Platform commercetools Platform Capabilities Agent Gateway Connect Security Services Premium Support Expert Services Back / Solutions By Use Case commercetools Foundry for B2C Retail Fast time to market with our pre-composed solution for B2C retail commercetools Foundry for B2B Manufacturing Fast time to market with our pre-composed solution for B2B manufacturing By Business Model For B2C commercetools solutions for any kind of B2C enterprise For B2B commercetools solutions for any kind of B2B enterprise For D2C commercetools solutions to power D2C businesses By Role For Business How commercetools accelerates business growth For IT How commercetools powers more innovation for tech teams For eCommerce How commercetools enables more conversions For Finance How commercetools drives more profitability Back / Industries Retail Next-level omnichannel shopping with commercetools Fashion & Lifestyle Personalized engagement with commercetools Food & Grocery Deliver loyalty-making customer experiences with commercetools Telecom Always stay ahead in this fast-paced industry with commercetools Automotive Drive your in-car commerce forward with commercetools Healthcare Innovate your healthcare digital platform with commercetools Back / Partners Find a Partner Overview Partners Solution Integrators & Agencies Solution Hub Become a Partner Partner Program Join the Partner Possibility Program Infrastructure Partners Google Cloud AWS MongoDB Existing Partners Visit our Partner Center → Back / Resources Resources Blog Analyst Reports Ebooks Global Webinars Webinars On-Demand White Papers All Resources Fundamentals Agentic Commerce Unified Commerce BFCM Commerce Replatforming Strategies B2B Digital Transformation and Maturity TCO and ROI MACH® Architecture Composable Commerce Omnichannel Commerce Inside The Product Compilations Innovation Studio Back / About Us Company About Us Leadership Compliance Newsroom Press Releases Newsletters Media Resources Meet us Events Contact Us ESG Our Vision Aspirations Supported Initiatives Achievements Back / Support Support Documentation Merchant Center Training Tutorials Open Support Ticket System Status Back / Careers Careers Offices Jobs Hiring FAQ DEI & ESG Our Benefits Careers Discover what commercetools can do... Popular search results Agentic AI Frontend Payment Hub Rethinking retail in the era of agentic commerce: The Very Group’s AI journey Muktar Mahama Head of Digital Product, The Very Group Published 18 December 2025 Estimated reading time minutes UK retail powerhouse The Very Group is reimagining the customer journey in the age of AI. Muktar Mahama, Head of Digital Product, shares how the digital-first retailer is building an agentic commerce strategy — powered by composable tech and grounded in customer obsession. At The Very Group, we’ve always stood at the intersection of great products, flexible payments and digital innovation. Our much-loved retail brands, Very and Littlewoods, offer customers everything from fashion and beauty to home and electricals — all under one digital roof.What really sets us apart is how we make those experiences flexible and accessible. The combination of amazing brands, rich product ranges and FCA-regulated flexible payment options, through Very Pay, helps us serve millions of families across the UK and Ireland. As a business without physical stores, our digital experience is our shopfront. That means every click, every scroll and every interaction has to feel effortless and personal. And while we’ve made great strides in this direction, we, like every other retailer, have to contend with a new player in the game: AI. Whether we like it or not, AI is here to stay — and it’s already changing our lives. It’s also fundamentally changing how customers search, browse and buy products. Even customers themselves are changing as AI agents enter the fold. This means the familiar conversion funnel the retail industry has worked around and towards (awareness → discovery → consideration →",
  "wordCount": 2685,
  "hash": "25494f01f366be59"
}