{
  "url": "https://www.businessoffashion.com/articles/technology/the-state-of-fashion-2026-report-agentic-generative-ai-shopping-commerce/",
  "title": "AI’s Transformation of Online Shopping Is Just Getting Started | BoF",
  "snippet": "Artificial intelligence made its presence felt across the industry, influencing how consumers shop, how brands create content and how fashion",
  "domain": "businessoffashion.com",
  "publishedDate": "2025-12-12T05:30:00Z",
  "extractedText": "While search engines remain dominant, driving around 80 percent of all search traffic, the rapid rise of AI-driven discovery highlights a fundamental change in how people find and evaluate products. Nearly a quarter of global consumers already rely on generative AI as their main starting point when shopping. As tools become more advanced and trusted across different use cases in everyday life, more consumers will adopt AI for shopping. 23 percent of consumers primarily use generative AI to discover products, while the majority still use traditional search.Though still comparatively small, shopping-related generative AI searches grew 4,700 percent between July 2024 and July 2025, with AI supporting inspiration and product comparison — especially helpful in the fashion category where choice abounds. This is impacting brands’ traffic sources. According to SimilarWeb, ChatGPT accounted for 16 percent of Zara’s and 8 percent of H&M and Aritzia’s inbound traffic between June and August 2025. 53 percent of US consumers who used generative AI for search inQ2 2025 also used it to help them shop.Unlike paid ads which are clearly sponsored, over 40 percent of consumers say AI responses feel more reliable, while only 15 percent consider them less reliable. Shoppers are therefore increasingly willing to make purchases from AI-based recommendations, as seen in the 84 percent growth in AI-driven revenue per visit on US retail sites between January and July 2025. 41 percent of consumers say they trust generative AI search results more than paid search ads.Technical improvements, such as reduced hallucinations (where a model generates incorrect, misleading or nonsensical information), combined with access to consumer behavioural data are making generative AI more reliable and user-friendly. These models provide more relevant recommendations, reduce search friction and build consumer confidence as the algorithm learns and improves over time. 85 percent of US consumers that use generative AI for shopping say they have a better experience than traditional methods.ADVERTISEMENTGenerative engine optimisation is becoming an essential add-on to search engine optimisationGenerative engine optimisation (GEO) is fast becoming a critical counterpart to search engine optimisation (SEO) as AI’s role in product discovery continues to grow.GEO ensures content is visible to and optimised for generative AI models. Large language models (LLMs) like ChatGPT, Claude, Perplexity and Gemini respond to consumer search queries by providing conversational, synthesised and structured answers rather than ranked lists of links. To appear in answers, website content must be easily read, contextualised and considered credible by the AI. GEO focuses on optimising content such as products listings to be just that, with early movers like Estée Lauder Companies, L’Oréal and Mejuri experimenting with GEO.Bettered-structured content is more likely to be surfaced by AI. Making content visible and easy to pick up means showing up in more places (different channels, languages, platforms) and making sure the basics are done right — like clear product titles, descriptions and metadata tags (descriptive data labels that help AI tools understand and surface products). Reviews, blogs and partnerships are also powerful signals that AI tools use to judge trustworthiness that brands should amplify.Brands and retailers should tackle GEO alongside SEO. Traditional search, including paid and organic, still drives most search traffic. (Bing alone accounts for 4 percent of global search volume, more than all generative AI platforms combined.) Overlooking either GEO or SEO risks leaving critical gaps in visibility.In the years ahead, consumers could rely on autonomous AI agents to help them shopAdvances in AI are opening the door to autonomous agents that act on behalf of consumers and businesses. These agents could streamline journeys by condensing multiple steps into a single action.While still nascent, agentic AI has the potential to fundamentally transform digital commerce, taking on the role of intermediary between brand and consumer, like retailers and marketplaces today. With AI simplifying product comparisons, brand loyalty will become even more important in purchase decisions. Brands should double down on retention tactics to build the emotional resonance that will influence consumers’ choices.The technologies that would allow agents to transact on someone’s behalf remain in development. As they mature, agentic AI models may either integrate into existing e-commerce ecosystems or create entirely new channels of discovery and purchase, reshaping how brands both market and sell their products.Some AI players are already testing these models. For example, OpenAI struck deals with Shopify and Etsy to let shoppers buy products from those platforms directly in ChatGPT, while Amazon’s “Buy for Me” lets consumers buy from third-party platforms within the Amazon app.ADVERTISE",
  "wordCount": 1517,
  "hash": "3cdb19bb821e5083"
}