{
  "url": "https://www.modernretail.co/technology/walmart-says-open-partnerships-are-central-to-its-ai-strategy-while-amazon-goes-it-alone/",
  "title": "Walmart says 'open partnerships' are central to its AI strategy",
  "snippet": "In October, Walmart inked a partnership with Gemini competitor OpenAI to let shoppers buy products directly inside ChatGPT. Walmart has also",
  "domain": "modernretail.co",
  "publishedDate": "2026-01-13T05:00:00+00:00",
  "extractedText": "The Marketplace Boom // January 13, 2026Walmart says ‘open partnerships’ are central to its AI strategy, while Amazon goes it alone By Allison Smith LinkedIn Facebook X Ivy Liu Six years ago, independent technology analyst Ben Thompson, who authors the Stratechery newsletter, wrote, “Everyone in commerce is, whether they realize it or not, in the Anti-Amazon Alliance.” At the time, he was describing how retailers and tech companies were increasingly banding together to give merchants and shoppers ways to sell and buy online without relying entirely on Amazon. Today, it also captures Walmart’s latest push into artificial intelligence, as the retailer leans into partnerships, while its biggest rival, Amazon, takes a more closed approach. On Sunday, Walmart and Google announced a partnership that brings the retailer’s shopping experience inside Google’s AI assistant, Gemini. Customers will be able to search for products, assemble a basket and check out directly within the chat interface using Google Pay. The partnership, unveiled during a keynote speech at the National Retail Federation’s Big Show industry conference in New York at the Javits Center, will utilize Walmart’s and Sam’s Club’s product selections, pricing and delivery capabilities. The companies said the experience will initially roll out in the U.S., though a launch date was not shared, and then expand internationally. In a separate NRF panel moderated by CNBC’s Jon Fortt, Walmart Executive Vice President and U.S. Chief Technology Officer Hari Vasudev said collaboration was a key part of the company’s approach to AI. “That approach of open partnerships is something that we strongly believe in,” Vasudev said. “What you’re able to do very effectively is serve the customer the best, so we are always going to be very open to partnering.” By partnering with Google, Walmart is building on earlier efforts to prepare for a future in which customers will increasingly use AI chatbots to make purchases. In October, Walmart inked a partnership with Gemini competitor OpenAI to let shoppers buy products directly inside ChatGPT. Walmart has also developed four of its own “super agents,” including the consumer-facing AI chatbot called Sparky, to deepen its AI push, according to the company. Walmart’s propensity to form partnerships with AI and tech companies to scale its AI ambitions sets it apart from its biggest rival, Amazon, which has largely forgone any such deals in favor of investing in its own AI tools. “Walmart seems to be willing to try many of them,” said Juozas Kaziukėnas, an independent e-commerce analyst, referring to the retailer’s work with outside AI companies. “It’s part of OpenAI’s initiative. It’s part of Google. It’s the opposite strategy of Amazon, which, to this day, remains missing from all those partnerships.” The Gemini integration is one of the first major retail implementations of Google’s new Universal Commerce Protocol, or UCP, an open standard designed to let AI agents complete checkout across platforms. Google announced the protocol at NRF alongside more than two dozen partners, including Shopify, Target and Etsy. Amazon was noticeably absent from the list. Industry analysts say the contrast with Amazon has become more pronounced in recent weeks. Amazon has been testing its own agentic features, including “Buy For Me,” which allows customers to purchase items from third-party websites without leaving Amazon’s app. But the rollout has drawn criticism from brands that say their products appeared on Amazon without permission. Against that backdrop, Walmart’s willingness to plug into open standards stands out. Other companies, like e-commerce platform Shopify, are also taking a collaborative approach when it comes to AI. Shopify has partnered with OpenAI, but it also co-developed Google’s UCP. In turn, Shopify merchants will be able to sell their wares within AI Mode in Google and the Gemini app. Shopify has also introduced an “agentic plan” that will let non-Shopify merchants sell through AI channels — including ChatGPT, GoogleAI Mode and Gemini, Copilot and Perplexity — as well as the Shop app and future partners. The plan lets merchants add their product data to the “Shopify Catalog,” a database of all the products sold by stores on Shopify, to appear in AI chat platforms. Prospective merchants can join a waitlist to participate in the program. “While everyone is forming these multi-dozen company partnerships and building integration protocols, Amazon seems to have limited itself to a very basic approach,” according to Juozas Kaziukėnas, an independent e-commerce analyst. For its part, Amazon has focused on building its own AI tools. In addition to “Buy for Me,” the Seattle-based e-commerce company has rolled out features like “Auto Buy,” which automatically purchases items for customers when prices drop. Amazon says shoppers who use its chatbot Rufus are 60% more likely to finish a purchase, and it expects the agent to generate mor",
  "wordCount": 1047,
  "author": " By Allison Smith",
  "hash": "3d9899c9b75c520a"
}