{
  "url": "https://www.vogue.com/article/generative-ai-hits-a-fashion-acceleration-point",
  "title": "Generative AI hits a fashion acceleration point | VogueSearchAccountMenuMenuExpandChevronExpandExpandExpandExpandExpandSearchSave StorySave StoryFacebookXPinterestInstagramTiktokLargeChevron",
  "snippet": "This presents an opportunity for global retailers from luxury to fast fashion to embrace open-source AI to enhance trend prediction,",
  "domain": "vogue.com",
  "publishedDate": "2025-02-25T05:30:00-05:00",
  "extractedText": "TechnologyGenerative AI hits a fashion acceleration pointThe buzzy tech has moved beyond its 2024 hype cycle into real-world implementation. We spoke to retailers who are seeing results.By Amanda CoffeeFebruary 25, 2025Photo: Noor-u-NisaSave StorySave this storySave StorySave this storyGenerative AI has dominated the retail tech hype cycle in the past year. But does it have staying power as a strategy to drive sales in a slowdown?Aggressive investment in AI has trickled all the way up to the executive branch. President Trump signed an executive order in late January removing barriers to American AI innovation, allowing companies to develop and deploy AI without regulatory restrictions. A hands-off approach has set up the playing field for an intense race among retailers to integrate AI rapidly and maintain a competitive edge.Benjamin Fels, CEO and co-founder of AI supply chain firm Pendulum, notes that Trump’s $500 billion AI infrastructure investment could help US retailers compete with foreign e-commerce giants by enabling faster supply chains and predictive analytics. US retailers struggle to match Shein’s 30-day inventory turnover and 6,000 daily product launches, as well as mitigate the $1.5 trillion in global annual losses from supply-demand disconnects. Fels describes this as a global “algorithmic warfare”, where brands are racing to implement more AI-powered algorithms and personalised merchandising strategies to compete with Chinese retailers.The same week as that executive order, China released DeepSeek-R1, a high-performance generative AI model built for roughly $5.5 million — far less than the tens of billions spent by Microsoft, Meta and Google on similar models, or the $500 billion invested by OpenAI and SoftBank. Rather than relying on expensive high-end chips, DeepSeek was developed using young engineering talent, making it a cost-effective alternative. Unlike TikTok, DeepSeek is open-source, making it nearly impossible for the US government to ban it, as users can freely download and distribute its data.DeepSeek’s early success suggests that Chinese AI development could accelerate even faster than anticipated with technology on par with US AI. This presents an opportunity for global retailers from luxury to fast fashion to embrace open-source AI to enhance trend prediction, personalisation and customer experiences — potentially widening their competitive edge.In 2024, 70 per cent of retail executives planned to implement generative AI, Carrie Tharp, VP of industries at Google Cloud, previously told Vogue Business. However, most brands were still in the ideation phase, exploring possibilities without major investments. Although many retailers have stated that they plan to implement AI, the investment to build in-house AI tools or purchase from partners is a costly multi-year endeavour. It’s yet to be seen if retailers commit to these investments long enough to see lasting results for customer engagement and sales.“2024 was a year of AI exploration in retail, but 2025 is when we’re seeing innovations deliver measurable results,” says Ali Furman, consumer markets industry leader at PwC US. “Retailers are increasingly using AI to turn customer behaviour, preferences and purchase history into actionable insights that enhance operations, personalise marketing and optimise inventory decisions.” Furman noted that AI-driven personalised experiences are particularly crucial for targeting Gen Z shoppers, who adopt new fashion trends faster than older consumers.Redefining personalisationVictoria’s Secret has transformed its email marketing strategy using AI personalisation. Previously, the brand sent the same daily emails to all customers based on product and brand priorities rather than individual preferences, according to Lindsay Massey, vice president of marketing. Now, marketing emails are customised to each customer type, leading to double-digit increases in revenue per email, click-through rates and conversion rates. For example, Gen Z customers might receive promotions for logo bralettes, while millennials who previously purchased shapewear see recommendations for smoothing strapless bras.Victoria’s Secret marketing emails are customised to each customer type. Gen Z customers might receive promotions for logo bralettes while millennials see recommendations for smoothing strapless bras. Photo: Courtesy of VS&CoSwarovski has established an AI Center of Excellence consisting of eight senior executives tasked with integrating AI across their full customer journey. A key focus has been enhancing search functionality with “searchandise”, a system that merges search and merchandising to personalise experiences. Swarovski collects customer data across e-commerce, mobile, and in-store interactions to tailor recommendations. AI now powers features like “recently browsed” and “complete your collection”.Guests shopping at a Swarovski store. Swarovski is using AI-powered customer service tools, which helps c",
  "wordCount": 1362,
  "author": "By Amanda Coffee",
  "hash": "480d48165cab1658"
}