{
  "url": "https://www.walmartconnect.com/resources/articles/2025/the-next-generation-of-ai-powered-retail-media",
  "title": "The Next Generation of AI-Powered Retail Media with Walmart Connect",
  "snippet": "AI-powered retail media will fuel the next generation of digital media innovation by combining first-party shopping signals, omnichannel scale,",
  "domain": "walmartconnect.com",
  "extractedText": "Help Center ↗ Contact Us Small Business Reach your goals Build your brand Boost your sales​ Acquire new customers Explore our solutions Sponsored Products Sponsored Brands​ Sponsored Videos Onsite Display All solutions​ Discover insights Campaign optimization Always-on campaigns Get started Retail readiness Easy campaign setup​ Case Study Learn how Mr.Brands drove +60% sales with Sponsored Search Enterprise Reach your goals Build your brand Boost your sales Acquire new customers Explore our solutions Sponsored Search ​ Onsite Display​ Brand Shop and Shelf​ Offsite media​ Store ads All solutions Measure the impact Closed-loop measurement Integrated measurement solutions Case Study Learn how OREO engaged customers with an in-store campaign Partners Find a partner Partner solutions Partner directory Partner Awards Meet the winners of the 2025 Walmart Connect Partner Network Awards Learn Spark inspiration Case studies Articles Seasonal insights All resources Level up your skills Ad Certification Program Walmart Connect Academy Advertising Help Center Learn more About Walmart Connect Contact us Article See how full-funnel retail media leads to real results Help Center ↗ Contact Us Start advertising ↗ Resources Articles The Next Generation of AI-Powered ... The Next Generation of AI-Powered Retail Media January 06, 2026 By Khurrum Malik, Vice President, Business & Product Marketing, Walmart Connect 3 min read Share The advertising industry is entering an era defined by AI. This shift will fundamentally transform how brands reach customers, measure impact, and grow with new capabilities that can anticipate, recommend, and act. AI-powered retail media will fuel the next generation of digital media innovation by combining first-party shopping signals, omnichannel scale, and multi-format engagement—advantages Walmart Connect uniquely delivers. We’re building the future of AI-powered retail media—one that is more intelligent, more connected, and more accountable than ever before, powered by our unparalleled omnichannel scale, solutions, and signals. For advertisers, this means campaigns that adapt faster, perform smarter, and prove results with greater certainty. When marketers can spend less time troubleshooting and more time creating, it opens a future where AI and human creativity will work together to spark innovation, spark growth, and spark sales. And it’s already underway. How we’re using AI to make retail media smarter, simpler, and more effective Across the industry, marketers are asking the same question: “How will AI make my advertising better?” Our answer is clear: By removing friction, boosting performance, and connecting brands with customers in more relevant, predictive ways. For example: Connecting to agentic shopping experiences: In fall 2025, we tested our first advertising formats tied to Walmart’s Sparky agent, which we’ll continue this year. AI-first shopping experiences have the potential to transform how customers search and discover products. In fact, 81% of surveyed Walmart customers said they’d used Sparky to check product availability and review product specifications before making a purchase.1 Search remains the most popular entry point, but as customers adopt these new shopping behaviors—as with all new touchpoints—we are exploring ways to help brands continue to meet customers where they are.GenAI-powered performance insights: We’re using GenAI to turn omnichannel retail data into clear, actionable intelligence, such as with our end-of-campaign reports and path to conversion reports—coming to the Walmart Connect Ad Center in FY27.Scaling ad creative: GenAI is beginning to help advertisers of all sizes quickly produce ready-to-activate ad creatives in minutes, such as lifestyle backgrounds for a brand’s products in our Automated Brand Shop Builder. Our Automated Creative Generator can reduce creative production time by 80%.2More strategic support: Our teams are using newer forms of AI to efficiently scale and provide more strategic guidance to brands—from a research assistant that instantly synthesizes documents for faster insights, to automatically generating brand-specific insights newsletters powered by Walmart’s associate super agent. One of our biggest accomplishments this year is the rollout of our new advertising assistant, which will help power Walmart’s Marty super agent, first introduced in July 2025. Meet Marty advertising assistant: Where AI meets real advertiser value Our agentic advertising assistant helps brands of all sizes to run smarter, faster, and more effective campaigns. Users of any level of expertise can build, optimize, and troubleshoot campaigns with ease—like simplifying campaign setup through plain-language guidance, from strategy to execution. Now in beta for Sponsored Search campaigns, our advertising assistant provides clear answers and actionable recommendations via conversational chat—from bidding and keywords to billing—including personalized alerts. Curre",
  "wordCount": 1265,
  "hash": "490c8487a024abc0"
}