{
  "url": "https://retailtechinnovationhub.com/home/2023/10/25/amazon-becomes-number-three-ad-platform-for-uk-e-commerce-businesses-moving-ahead-of-tiktok",
  "title": "Amazon becomes number three ad platform for UK e-commerce businesses, moving ahead of TikTok — Retail Technology Innovation Hub",
  "snippet": "It saw a 7.4% increase in ad spend on its platform year on year, going from a 19.2% share of overall ad spend in Q3 2022 to 26.6% in Q3 2023.",
  "domain": "retailtechinnovationhub.com",
  "publishedDate": "2026-01-12",
  "extractedText": "Amazon becomes number three ad platform for UK e-commerce businesses, moving ahead of TikTok Research released by Juni, a financial platform built for digital commerce, reveals that Amazon’s ad share among UK e-commerce businesses jumped from 1.7% in Q2 2023 to 6.1% Q3 2023 - knocking TikTok from third to fourth place. Meta remains the dominant platform, securing 60.3% of total ad share in Q3. However, Google made the biggest long-term gains, increasing its ad share by 7.4% year on year, to 26.6% in total for Q3. Overall ad spend by online retailers has jumped 67% YoY as peak retail season approaches.Somewhat unsurprisingly, adoption of GenAI has also soared as online retailers increase their use of AI tools. 13% of UK e-commerce businesses who use Juni are now subscribed to ChatGPT in Q3 - up from just 3% in Q3. What do the founders of a $$$ global ecom brand obsess about every day? Learn what the brains behind Boxbollen focus on to win big and scale fast in our new series, Unscripted Growth 🚀 Watch the first episode here https://t.co/A7ZUtpQiOr pic.twitter.com/x7Rp53kseE— Juni (@GetJuni) October 24, 2023 “E-commerce businesses are gearing up for the peak retail season, with Black Friday and Cyber Monday on the horizon. It is interesting to see e-commerce businesses testing innovative and emerging platforms like ChatGPT and Amazon, which could potentially play a crucial role in preparing and boosting sales during this key period,\" says Samir El-Sabini, CEO and Co-Founder at Juni. \"Ad spend naturally increases in Q4 as businesses run more marketing campaigns, but a 67% increase YoY signals that businesses have to spend more to see results in this challenging climate. With a strong focus on delivering personalised customer experiences, e-commerce companies can strategically position themselves for success during the busiest time of the year.\"The launch of Amazon’s offsite ads programme took it head to head with Google and Meta, likely helping it to rapidly boost its market share. In one quarter, Amazon has raced ahead of Microsoft, TikTok and Snapchat as the third-ranked advertising platform, with ad share rising 3.5X from 1.7% in Q2 2023 to 6.1% in Q3 2022. This increase was primarily fuelled by consumer goods focused retailers, who spent the most on the platform, with food and beverage following second, and the consulting sector ranking third. Overall, Meta remains the dominant platform and is consolidating its place on the leaderboard with its market share rising steadily, from 52% in Q2 to 60% in Q3. Google came in second once again, but despite there remaining a sizeable gap to Meta, Google was the long-term winner. It saw a 7.4% increase in ad spend on its platform year on year, going from a 19.2% share of overall ad spend in Q3 2022 to 26.6% in Q3 2023. TikTok fell to fourth position with 3.2% of total ad budgets in Q3 2023, a notable drop from 5.56% in Q2 2023. Nonetheless, the UK market remains the top market for this platform, as the rest of Europe only allocated 2.3% of their budget to the mobile-first platform. Similarly, ad shares for SnapChat and Microsoft have also fallen from Q2 to Q3 but only incrementally as SnapChat’s share fell by 0.19% to 1% and Microsoft's by 0.25% to 1.5%. E-commerce businesses’ overall spend has jumped 42% year-on-year, with ad spend increasing by 67%. Quarter on quarter, UK e-commerce businesses have increased their spend on ads from 42% in Q2 2023 to 49% in Q3 2023. With peak retail season on the horizon, e-commerce businesses are shifting focus from inventory management to boosting sales around Black Friday and Cyber Monday through advertising. Featured Jan 12, 2026 RADAR brings in former PVH/lululemon exec Jonathan Aitken for RFID Excellence role Jan 12, 2026 Continue reading… Jan 12, 2026 Jan 12, 2026 Wing and Walmart set to expand drone delivery to 150 new stores across the USA Jan 12, 2026 Continue reading… Jan 12, 2026 Jan 12, 2026 Pacsun claims market first with launch of its social commerce app PS Community Hub Jan 12, 2026 Continue reading… Jan 12, 2026 Jan 12, 2026 TCS flags disconnect between importance of AI adoption and real-world roll-outs Jan 12, 2026 Continue reading… Jan 12, 2026 Jan 12, 2026 Otto Group boosts supply chain operations via NVIDIA and Reply robotics partnership Jan 12, 2026 Continue reading… Jan 12, 2026 Jan 12, 2026 Wesley Grisdale takes on Tech Director - Stores leadership role at Woolworths Group Jan 12, 2026 Continue reading… Jan 12, 2026 Jan 12, 2026 Adam Kirk exits Southeastern Grocers for store operations chief role at The Winn Dixie Company Jan 12, 2026 Continue reading… Jan 12, 2026 Jan 12, 2026 Tech Show London research: 2026 set to be a make or break year for getting AI strategy right Jan 12, 2026 Continue reading… Jan 12, 2026 Jan 12, 2026 Crave Retail brings smart fitting room and store wide platform to NRF 2026 Jan 12, 2026 Continue reading… Jan 12, 2026 Jan 12, 2026 Jacko Ungerer swaps NewStore for Universal Store Busin",
  "wordCount": 1005,
  "author": "Staff Writer",
  "hash": "5bdc2751a819f878"
}