{
  "url": "https://www.vogue.com/article/innovation-is-entering-a-new-era-and-luxury-is-following",
  "title": "Vogue Business Index: Innovation is entering a new era — and luxury is following | VogueSearchAccountMenuMenuExpandChevronExpandExpandExpandExpandExpandSearchSave StorySave StoryExpandFacebookXPinterestInstagramTiktokLargeChevron",
  "snippet": "AI offers the luxury industry new ways to conduct existing tasks, with the potential to enhance operations from clienteling and marketing, to",
  "domain": "vogue.com",
  "publishedDate": "2025-03-26T01:30:00-04:00",
  "extractedText": "TechnologyInnovation is entering a new era — and luxury is followingLooming DPP and AI legislation along with rising ethical standards are the guiding forces for innovation. But as the battle for consumer attention heats up, luxury brands bend budgets to stand out.By Vogue Business custom insights team in partnership with Phronesis PartnersMarch 26, 2025Artwork by Vogue BusinessSave StorySave this storySave StorySave this storyThis article is part of the Vogue Business Index: H1 2025, an bi-annual objective scorecard of the 60 top luxury fashion brands, based on revenue. Advanced Members can read the full Vogue Business Index here.Read the Vogue Business Index: H1 2025ExpandCollapseIconExpandBusinessVogue Business Index Top 10: Preppy Is Back and So Is Ralph LaurenBusinessJacquemus brings its sunkissed universe to the Vogue Business IndexAlongside fellow rookies Ami Paris and Maje, the indie brand joins the ranks as a creative overhaul and sustainability deadlines mark a milestone year for the luxury industry.BusinessDior Takes Gucci’s Groove and Louis Vuitton Keeps Its Hot StreakBusinessHow to Drive Footfall in a Retail FalloutBusinessInnovation is entering a new era — and luxury is followingLooming DPP and AI legislation along with rising ethical standards are the guiding forces for innovation. But as the battle for consumer attention heats up, luxury brands bend budgets to stand out.Innovation can be characterised by the consumer need for newness and utility. As the pillar that’s most susceptible to change, it is undeniable that even since the last Vogue Business Index in H2 2024, the hype cycle has roared on, ushering in — and out — some of the technologies that are key to luxury’s survival. From the continued wane of NFTs and the rise of digital twins, to the influx of digital product passports (DPPs) and the climbing industry demand for transparency, it is vital for brands to continuously recalibrate their innovation strategies to stay relevant, especially as legislation looms.During our data capture period for H1 2025, artificial intelligence was front of mind for consumers. And alongside struggling to prioritise innovation within tightened budgets, Index brands are grappling with how to ethically adopt and apply AI to their practices, too.Innovation moversIn this chapter, we dive into the innovations of Index brands, from their involvement in circular solutions such as rental and resale to their presence in gaming. Research is conducted via an audit of their long-term and point-in-time (past year) activations, with individual metrics weighted to consumer importance.Following movements among the top players in the last edition of the Vogue Business Index, shuffles in the innovation pillar continue, albeit more drastic. Gucci, which has held the top spot in innovation since its addition in H1 2022, drops for the first time in three years to third place, as Balenciaga (+5) and Burberry (+10) overtake.Balenciaga now follows in the footsteps of its sister brand Gucci in leading the way when it comes to innovation. As a pioneer of cryptocurrency payments, which it rolled out across limited boutiques in May 2022, Balenciaga has long innovated in interesting and unique ways, most recently launching its virtual runway for the Apple Vision Pro and collaborating with the Need For Speed mobile game to target a localised crowd. What sets Balenciaga apart from other luxury brands is the way it leans into innovation through subculture — something that ties into the brand’s inherent values of creativity and subverting the status quo. Balenciaga Music, for example, launched in May 2024, is a platform that aligns subculture with innovation, through curated playlists and NFC-chipped garments that offer exclusive access to tunes once scanned.An early adopter of all forms of innovation, Gucci has previously led in areas such as gaming, NFTs and resale, through its own initiatives and collaborations. As Gucci adopts a back-to-basics approach — first witnessed under the appointment of Sabato De Sarno in January 2023, and his more minimal approach to design — innovation has been somewhat scaled back. Gucci Arcade, first launched in 2019, has quietly been removed from the brand’s website navigation, with games including Gucci Gravity and Gucci Labyrinth no longer accessible. While Gucci-themed virtual world Gucci Town on gaming platform Roblox remains ongoing, activations within the space have stalled following the maison’s Spring/Summer 2024 Ancora show.Gaming isn’t the only area where Gucci is scaling back investment. Just one year after launching its proprietary resale platform Gucci Vintage, the secondhand offering has quietly shuttered alongside two other brand-led platforms: Hugo Boss Pre-Loved and Valentino Vintage. Now, just nine brands directly operate their resale platforms or white label solutions — down from a peak of 13 brands in the H1 2024 Vogue Business Index — and a further eight brands have partnerships wi",
  "wordCount": 2693,
  "author": "By Vogue Business custom insights team in partnership with Phronesis Partners",
  "hash": "5cb5b8dc355419a5"
}