{
  "url": "https://www.bain.com/insights/generative-ai-potential-to-improve-customer-experience/",
  "title": "Generative AI’s Potential to Improve Customer Experience | Bain & Company",
  "snippet": "Retailers are deploying AI-enhanced tools such as summaries of product reviews, chatbots, and shopping assistants in an effort to facilitate purchase decisions.",
  "domain": "bain.com",
  "publishedDate": "2024-11-13T14:00:00.0000000+00:00",
  "extractedText": "Brief Generative AI’s Potential to Improve Customer Experience Generative AI’s Potential to Improve Customer Experience Bain's research identifies five design principles for deploying generative AI in the customer journey. By Merritt Robinson, Mikey Vu, Arpan Sheth, Andre Tanaka, and Colleen Lin min read } Brief Generative AI’s Potential to Improve Customer Experience Progress: en At a Glance Retail customers are optimistic about generative AI: Bain’s research finds that about half of those surveyed see great potential in these new tools. Customers value passive generative AI features such as summarizing reviews integrated into their journeys—sometimes even more than they value standalone generative AI features. Online shoppers understand the potential for personalization with generative AI, and they seem more willing to share personal data than they might in other contexts. In retail, generative AI can help deliver great customer service more efficiently, especially in parts of the journey that have proven more difficult to reach. In retail, as in other industries, generative AI promises to change the customer experience. Retailers are deploying AI-enhanced tools such as summaries of product reviews, chatbots, and shopping assistants in an effort to facilitate purchase decisions, reduce friction, and increase conversion. While businesses are experimenting and assessing the impact of generative AI tools in the shopping journey, customers are still getting used to the new interactions and features impacting their online shopping experience—and as with everything about generative AI, we are finding their perceptions to be both the same as and different from what we’ve known in the past. To help retailers think about deploying generative AI in a customer-centric way, Bain surveyed more than 700 online shoppers in the United States about their knowledge of and experience with generative AI. Awareness of these tools is low among customers: 71% said they were not aware of having used generative AI in their online shopping even though most had shopped recently with retailers where they were likely to have encountered them. But despite low awareness, customers are optimistic about the impact of generative AI, with roughly half seeing significant or transformative potential. In addition to the survey, we interviewed online shoppers and compared traditional and new shopping experiences with different types of generative AI, taking into consideration customers’ expectations about personalization. We then mapped their perceptions over the entire purchasing journey—from awareness to purchase and beyond. This research has allowed us to define five design principles that cumulatively suggest that the most effective early use cases for generative AI may lie in designing experiences that enhance and expand the current retail journey rather than serving as a standalone platform for engagement. Five design principles for deploying GenAI in the customer journey 1. Enhance shopping habits with generative AI without disrupting customer preferences Customers said their top reasons for not using generative AI tools while shopping online are because they’re satisfied with current methods and don’t see the need for new tools, which is understandable: Online shopping has evolved its tools and experiences over decades, and solutions have been fine-tuned to customer needs (see Figure 1). Figure 1 Retail customers say they don’t need, don’t trust, or haven’t encountered generative AI tools Note: Includes respondents who have heard of generative AI tools for online shopping but have not used them (n=276) Source: Bain Generative AI Usage Survey, July 2024 (n=714) For example, in product walkthroughs of conversational shopping assistants, customers were often unclear about the difference between their current search methods and the newer generative AI tools for searching and exploring products. One customer was surprised that the conversational shopping assistant didn’t prioritize products she had bought in the past, a feature that the traditional search provided: “I might just go back up to the search bar … because I bought this product before.… And I literally just have to type it into the search bar, and it knows what I want.” While innovating requires a test-and-learn approach, our research suggests that retailers should frame these new generative AI experiments as such and strive for a complementary value proposition. Otherwise, there’s a risk that customers could be confused by having different tools available to achieve similar goals; there’s also a risk that they will require more significant re-familiarization in the future after early experiments make generative AI seem less attractive by comparison. Strategic implications Use generative AI to complement current flows. Standalone generative AI tools can serve some existing use cases, but they are more interesting to customers when they serve needs in new ways or bring something t",
  "wordCount": 2579,
  "author": "\n                Merritt Robinson\n        ",
  "hash": "5e3936aa5240b12f"
}