{
  "url": "https://medium.com/@dschonfeld/transforming-fashion-discovery-in-e-commerce-through-theme-based-categorization-with-genai-8c32aa0224e9",
  "title": "Transforming Fashion Discovery in E-Commerce through Theme-Based Categorization with GenAI | by Dan Schonfeld | Medium",
  "snippet": "We leveraged LLMs to revolutionize eBay's fashion recommendation system by providing a degree of customization and context sensitivity for product discovery.",
  "domain": "medium.com",
  "publishedDate": "2024-06-14T17:47:09.201Z",
  "extractedText": "Transforming Fashion Discovery in E-Commerce through Theme-Based Categorization with GenAIDan Schonfeld9 min read·May 22, 2024--1ListenShareBy Xingming Qu, Gaomin Wu, Dan Schonfeld and Jonathan GalsurkarWe leveraged LLMs to revolutionize eBay’s fashion recommendation system by providing a degree of customization and context sensitivity for product discovery, in turn greatly improving user engagement and conversion on eBay’s View Item page.IntroductionThe integration of Large Language Models (LLMs) into various sectors has marked a significant milestone in the evolution of artificial intelligence, bringing forth innovative solutions to enhance user interaction and satisfaction. In the realm of fashion, traditional brick and mortar stores benefit significantly from knowledgeable salespersons who engage in detailed discussions about style, occasion suitability, and guide customers to understand and refine their preferences, a nuance that online platforms struggle to replicate. To address this challenge, we harness the capabilities of LLMs to revolutionize eBay’s fashion recommendation system. Specifically, our approach utilizes LLMs to systematically categorize items into coherent pivot groups and subsequently generate deep learning embedding centers for these groups, offering a unique strategy for the organized presentation of candidate items within these well-defined themes. This approach not only facilitates a more streamlined product discovery process but also incorporates a degree of customization and context sensitivity that surpasses the capabilities of conventional recommendation algorithms.BackgroundIn the fast-paced world of online fashion shopping, the challenge of delivering customized and relevant product recommendations is particularly pronounced. Currently, when users browse through women’s fashion or fashion items in general, shown in Figure 1 below, they often seek specific styles of clothing suitable for particular occasions.Press enter or click to view image in full sizeFigure 1: Current “Similar sponsored items” on View Item PageHowever, this crucial information is not always clearly presented in the item titles or descriptions provided by sellers. In contrast to the traditional in-store shopping experience, where knowledgeable salespersons engage customers in detailed discussions about the style, occasion suitability, and guide them through similar pieces to better understand their preferences, we’re aiming to replicate and improve upon this personalized assistance for eBay fashion items.In physical stores, salespeople play a pivotal role in guiding customers through the intricacies of fashion. They discuss the style aesthetics of each piece, its suitability for various occasions, and show customers other similar pieces to help them better understand and refine their preferences. Our goal is to harness the power of LLM to recreate this personalized shopping experience online. Through this approach, we aim to not only assist buyers in finding the perfect fashion items but also recreate the sense of personalized guidance and expertise that one would typically experience in a physical store. Ultimately, we strive to make the fashion discovery process on eBay more engaging, informative, and satisfying for our users.ApproachWe crafted pivot groups, shown in Figure 2 as text pills, to be context and product-aware, enhancing eBay’s recommendation list by offering dynamic buttons that act as filters and allowing users to refine their search based on themes aligned with their interests. These pivot groups, generated by LLMs, provide a guide for users to a curated selection of products that resonate with their chosen context. By facilitating a more comprehensive exploration of eBay inventory, pivot groups increase the likelihood of conversion, making it easier for shoppers to find and purchase items that perfectly match their fashion sensibilities, thus making online browsing a more rewarding endeavor.Press enter or click to view image in full sizePress enter or click to view image in full sizeFigure 2: Pivot Group Examples for Women’s Dresses RecommendationsWe selected the women’s dress category for our study due to its dynamic nature and significant variation in styles and trends, making it an ideal domain to demonstrate the effectiveness and adaptability of our novel recommendation system. We generate the pivot groups in the preparatory offline phase; our methodology is to select the most popular items and their “Similar sponsored items” in the women’s fashion sector, ensuring our selections mirror the latest stylistic currents and consumer inclinations. By harnessing the analytical and reasoning prowess of LLMs, we meticulously categorized these fashion items into distinctive theme groups based on their inherent characteristics. This strategic categorization allowed for a nuanced understanding of how various items align within the thematic spectrum of women’s fashion. Following the delineation o",
  "wordCount": 2025,
  "author": "Dan Schonfeld",
  "hash": "71db9fdacd6e7b9d"
}