{
  "url": "https://www.nextglass.co/news/untappd-shop-netherlands-launch/",
  "title": "Next Glass Announces Launch of Untappd Shop eCommerce Platform in The Netherlands - Next Glass™",
  "snippet": "The Untappd Shop launched in select U.S. states in October 2023 and is now available in The Netherlands with aims to add additional U.S. states",
  "domain": "nextglass.co",
  "extractedText": "News & Press June 6, 2024Next Glass Announces Launch of Untappd Shop eCommerce Platform in The Netherlands Dutch consumers now able to buy beer via Untappd mobile app in The Netherlands, marking Untappd Shop’s entry into European market Next Glass, a leading global provider of software to the beverage alcohol industry, today announced, in partnership with Dare to Drink Different (part of Royal Swinkels), a leading eCommerce platform that is a one stop shop for craft beer drinkers, the launch of the Untappd Shop in-app B2C eCommerce experience in The Netherlands. The Untappd Shop, an independent platform which allows consumers using the award-winning Untappd app to buy beer for shipment to their doorsteps, launched in select states in the U.S. in October 2023. With today’s launch, customers in The Netherlands will now be able to purchase beer from leading breweries around the world, including from the United States, for home shipment. The Untappd Shop features curated boxes, bundles featuring select breweries, and singles from a wide range of breweries. To celebrate the launch, the Untappd Shop put on sale today the Untappd Limited Edition Launch Box: Best of the U.S. beer box featuring 18 top-rated beers from U.S. breweries, including Other Half, Equilibrium, Finback, and Parish, that have never previously been available in Europe. This limited edition box is only available in the Untappd app and the first of a recurring series of curated beer boxes the Untappd Shop will offer featuring highly-rated beers from around the world. The Untappd app is free to download via the App Store and Google Play. Untappd app users are also able to create custom boxes of beers based on previous ratings from their Untappd check-ins. Dare to Drink Different (“DtDD”), as part of Royal Swinkels, emerged with the aim of uniting various flavors and styles, offering craft beer enthusiasts an adventure through the diverse world of beer. DtDD is the ideal Untappd Shop procurement and fulfillment partner due to its ability and willingness to support brewers outside of its own portfolio, its reputation as a leader in innovation in alcohol eCommerce, and, with aims to expand Untappd Shop beyond The Netherlands into other European countries, its global logistics capabilities and footprint. “We are thrilled to launch the Untappd Shop to Dutch consumers. We have worked successfully with the DtDD team at Royal Swinkels for over a half-decade on various software, insights, and marketing initiatives and are thrilled to partner to bring the Untappd Shop to life for European consumers, beginning in The Netherlands,” said Trace Smith, CEO of Next Glass. “We feel DtDD’s approach to providing an open platform as well as the brewery’s eCommerce experience and infrastructure make it the perfect partner for our European B2C eCommerce expansion. The innovative team at DtDD also recognizes continued shifts in consumer behavior, with an increasing share of beer drinkers interested in discovery and exploration options made possible through eCommerce channels like Untappd Shop.” While DDtD maintains its own platform with its own portfolio of products, the Untappd Shop will feature its own custom catalog of products that is continuously expanding to feature new brands. “In line with the philosophy of Dare to Drink Different, we aim to assist beer enthusiasts in discovering more flavors and gaining access to beers they might not typically choose or have the opportunity to try. Untappd is the platform par excellence where all these experiences are shared, and we are proud to now partner to broaden the beer landscape for beer fans,” said Romke Swinkels, managing director Dutch market. He added, “We are delighted with the trust that Untappd has placed in us and look forward to supplying the most exceptional beers for the community!” The unveiling of the Untappd Shop into The Netherlands represents the latest in Next Glass’s expansion efforts in Europe, where the company’s Untappd for Business menu publication and promotional product and Ollie brewery management solution are already used by thousands of retailers and breweries. With the accelerated growth of craft beer share in Europe, nearly half of all Untappd app activity now occurs in Europe. Tom Maneschijn, Vice President, Europe at Next Glass added, “The Netherlands is the second most active country on Untappd, so it is fitting that we begin our European expansion with Untappd Shop here. We look forward to providing a great selection of the very best American and European beers to Dutch consumers.” About the Untappd Shop The Untappd Shop enables Untappd app users to search, discover, and buy beers from around the world for shipment to their front door. The Untappd Shop launched in select U.S. states in October 2023 and is now available in The Netherlands with aims to add additional U.S. states and European countries in 2024. The Untappd Shop is supported by partners committed to providing an independent ",
  "wordCount": 1172,
  "hash": "7a3c065c8e780de9",
  "topic": "Ecommerce_Retail_Tech"
}