{
  "url": "https://www.hcltech.com/blogs/from-agentic-commerce-to-vision-ai-in-retail",
  "title": "From Agentic Commerce to Vision AI in Retail | HCLTech",
  "snippet": "Explore how agentic commerce and vision AI are reshaping digital and physical retail, transforming customer journeys, operations,",
  "domain": "hcltech.com",
  "publishedDate": "2025-12-23T12:00:00Z",
  "extractedText": "From Commerce Agents to Vision AI - How customer journey is getting reshaped every step of the wayFrom automated to autonomous Commerce – Agents in CommerceDecember 23, 2025 7 min read AuthorDebraj Bhattacharya Senior Director, Industry Solutions, Retail and CPGDecember 23, 2025 7 min read Retail Share Facebook Twitter LinkedIn Copy link copied! Picture this. You are a customer surfing beach wear apparel for your impending year-end vacation at Hawaii on your popular retailer app. Flurried by the options available, you prefer to type in to ChatGPT around preferable options. Your past purchases – the ‘digital DNA’ to be precise – helps throw up a few tempting choices. All along, you are ‘voice assisted’ to select your option. You are then prompted if you want to buy it, and post entering your payment credentials, you have your favorite apparel bought – and delivered - without you lifting a finger!From automated to autonomous Commerce – Agents in CommerceWelcome to the world of autonomous commerce. OpenAI’s Agentic Commerce protocol is taking a lead in this, and it is reshaping customer shopping journey like never before. ChatGPT has traditionally been associated with responses to queries. A good 700 MN users harp on ChatGPT every week to get answers to their myriad queries – ranging from business to weather to politics! Well – no more just that. With a feature around Instant Checkout, OpenAI is aiding the shopping journey to not just help in recommendations, but buying and the ensuing commerce value chain too.The good part here is, merchants can keep using their existing systems to fulfil the order management process, payments, and fulfilment workstreams. The role of ChatGPT here is just like a digital shopping assistant for the user – acting as a conduit to pass information between user and merchant. While the monetization is primarily through merchants (they pay a small fee on completed purchases), it is free for users. The CX for the user/customer is thereby unchanged from how she experienced ChatGPT so far.This is already integrated with Stripe for payments. Shopify merchants can use the feature too, which means that merchants get the end-to-end backup from search to social media – to now agent assisted shopping! The recent tie-up with PayPal will also scale this ecosystem further – in transforming Retail AI agents from advisory tools to transactional assistants.Perplexity.ai is another leader in this space, in fact having a head start of a year over Open AI. In November of 2024, they launched ‘Buy with Pro’, that allowed search and commerce to happen via the same AI-powered agent.The entire trend of Agents in e-commerce has gained momentum phenomenally over last year in particular, where Gen AI and non-AI conversion rates are approaching parity.(Source: https://www.bcg.com/publications/2025/agentic-commerce-redefining-retail-how-to-respond)What next for Agentic Commerce in RetailThe space of autonomous commerce is evolving to a state where as the next stop, agents can manage the entire purchase process on its own with minimal humans-in-the-loop. From there on, we could think of an agent-to-agent scenario, where 3rd party AI agents talk directly to brand agents to complete purchases, making the entire cycle fully autonomous. We can visualize that state as the ‘north star’ of agentic commerce in Retail.(Source: https://www.bcg.com/publications/2025/agentic-commerce-redefining-retail-how-to-respond)Now for physical RetailSo much for digital retail assistants. With all the talk around digital, let us not forget that physical Retail still contributes ~ 70% of global retail sales. At the risk of leaving the habitual shoppers, who still ring in to the age-old concept of retail/in-store therapy behind, AI is making quantum advancements there too. Imagine you prefer to swing by your favorite retail store down the shopping arcade to serve the same purpose – grabbing beach wear for your upcoming vacation. The moment you step in, a store associate guides you to Aisle B that sports a vibrant assortment of your choice. While you are left wondering how she knew what you wanted, you pass through a store layout that seems to stack a much better collection from the last time you visited. Stroke of chance? Not quite – it is data science- backed visual merchandising and advanced planograming in action there! And some computer vision AI too.Vision AI in RetailOne prominent tailwind to the AI revolution that industries are witnessing worldwide is the phenomenal advancement of Physical AI and associated infrastructure. Just like good and clean data is a pre-requisite for desired AI output, the hardware side plays out via enhanced compute power, low latency, ability to process gigantic volumes of data, all the while adhering to sustainability guidelines. Firms like NVIDIA and DELL are taking a lead here. Take Vision AI as an example. With increased camera prowess for in-store and warehouse setups, firms like RealSense are provi",
  "wordCount": 1416,
  "hash": "7c176ba04d212534"
}