{
  "url": "https://blogs.lse.ac.uk/businessreview/2025/10/08/ai-is-changing-inflation-dynamics-and-challenging-central-banks/",
  "title": "AI is changing inflation dynamics and challenging central banks - LSE Business Review",
  "snippet": "When inflationary pressures stem from algorithmic pricing, interest rates are a blunt tool. Competition regulators can help by setting",
  "domain": "blogs.lse.ac.uk",
  "publishedDate": "2025-10-07T23:01:00+00:00",
  "extractedText": "Biagio Bossone October 8th, 2025 AI is changing inflation dynamics and challenging central banks 0 comments | 13 shares Estimated reading time: 5 minutes Biagio Bossone October 8th, 2025 AI is changing inflation dynamics and challenging central banks 0 comments | 13 shares Estimated reading time: 5 minutes 13 Shares Artificial intelligence causes contagious supply shocks that change inflation dynamics and challenges traditional monetary policy. In the past, central banks tended to assume these shocks were temporary and outside the reach of interest rate tools. Biagio Bossone writes that this is no longer the case. Central banks must rethink passive “look-through” strategies and build AI-aware frameworks to respond swiftly. Artificial intelligence is often celebrated for its potential to boost productivity. But AI may also bring a new kind of economic disruption: AI-propagated supply shocks. These shocks arise not only from technology itself but also because algorithms spread disruptions through pricing, labour markets and expectations in real time. This poses a challenge for monetary policy. For decades, central banks have often “looked through” supply shocks, assuming they are temporary and outside the reach of interest rate tools. But that doctrine is becoming harder to defend. As Bank of England’s Megan Greene recently argued, supply shocks today are not always short-lived. Firms tend to adjust prices more frequently when inflation is already high, amplifying the initial impact. Expectations also behave in nonlinear ways: once inflation crosses certain thresholds, households and businesses respond disproportionately. In such an environment, the neat separation between supply and demand disturbances breaks down. Sometimes the optimal policy is to act, not to wait. The latest research shows why this matters. If central banks treat a cost shock as temporary but it turns out to be persistent, holding rates steady can add fuel to inflation. By keeping real interest rates too low, policy inadvertently stimulates demand at the wrong time. In many models, simple rule-based responses or earlier action tend to outperform passive “look-through” strategies. Sign up here for our weekly newsletter Shock generator and amplifier AI makes these risks more pressing by altering both the origin and diffusion of shocks. Algorithmic pricing and markups. Firms now use AI systems to monitor demand, input costs, and competitors continuously. Prices can be adjusted automatically and in unison. This reduces the natural “stickiness” that once slowed the spread of shocks. A rise in energy costs in one sector can quickly lead to synchronized price hikes across many others, turning a relative price change into broad inflation pressure. Labor market disruptions. AI adoption often displaces workers, particularly in routine jobs. Re-entry into employment requires retraining, which takes time. During this adjustment, effective labor supply is constrained, pushing up unit labor costs and inflation. Over the longer run, AI boosts productivity, lowers costs, and raises potential output. But the transition is uneven, with inflationary effects up front and disinflationary gains later. Machine-mediated expectations. Expectations are no longer formed only by humans. Algorithms parse data and feed directly into pricing engines, investment bots, and consumption models. When inflation crosses certain thresholds, these systems can trigger rapid and synchronized repricing. Central bank communication loses traction in this world: algorithms respond to data consistency, not verbal assurances. Figure 1 maps the channels through which AI can amplify supply shocks — from synchronised pricing to labour disruptions and machine-mediated expectations. Figure 1. Channels of AI-propagated supply shocks Figure 2 illustrates how these dynamics play out over time: inflationary at first, persistent during transition, and ultimately disinflationary as productivity gains materialise. Figure 2. AI-driven supply shocks: from disruption to disinflation Notes: Phase 1 – Disruption and rapid repricing (inflationary); Phase 2 – Transition and bottlenecks (persistence risk); Phase 3 – Productivity gains (disinflationary). “Look-through” is riskier under AI Traditionally, central banks had time to assess whether a supply shock was temporary or persistent. Under AI-propagated supply shocks, that window narrows. Prices adjust faster, contagion spreads wider, and persistence is harder to judge. A passive stance is therefore riskier. The danger of misclassifying shocks is higher, and the cost of delay is steeper. AI-aware policy playbook What should central banks do? Five priorities stand out: Monitor algorithmic dynamics Monetary policy rules should incorporate high-frequency indicators of price changes, sectoral synchrony and online markups. These can serve as early warning signals of AI-driven inflationary bursts. Anchor credibility in data As algorithms parse numbers, not wo",
  "wordCount": 1211,
  "author": "\n  About the author\n\n      \n      \n        \n        Biagio Bossone\n      \n              \n          Biagio Bossone is an advisor to international financial institutions and national central banks. He is Contributing Editor at Central Banking. He has held senior positions at the IMF and World Bank, and has published widely on monetary policy, finance, and governance. \n        \n          \n  \n      \n    \n      Posted In: \n              Economics and Finance\n         |                       Technology\n                          \n  ",
  "hash": "7d62180d2e7c9f3a"
}