{
  "url": "https://arxiv.org/html/2509.04705v1",
  "title": "Transforming Fashion with AI: A Comparative Study of Large Language Models in Apparel Design",
  "snippet": "Monteresso et al examined how AI models contribute to the fashion design process highlighting how AI can optimize creation processes, improve operational efficiency and shorten development times without compromising the quality and creativity[1]. In this section, we present and analyze the LLM model",
  "domain": "arxiv.org",
  "extractedText": "Transforming Fashion with AI: A Comparative Study of Large Language Models in Apparel Design Nusrat Jahan Lamia1, Sadia Afrin Mim 2 1njlamia17@gmail.com 2safrinmi@gmu.edu 1Bangladesh University of Textiles 2 George Mason University Abstract Fashion has evolved from handcrafted designs to automated production over the years, where AI has added another dimension to it. Nowadays, practically every industry uses artificial models to automate their operations. To explore their role, we examined three prominent LLMs (OpenAI, GeminiAI, Deepseek) in multiple stages of textile manufacturing (e.g., sustainable choice, cost effectiveness, production planning, etc.). We assessed the models’ ability to replicate garment design using certain parameters (fabric construction, shade, weave, silhouette, etc.). We compared the models in terms of different body types and functional purposes (e.g., fashionwear, sportswear) so that designers could evaluate effectiveness before developing actual patterns, make necessary modifications, and conduct fashion forecasting beforehand. To facilitate deeper analysis, we created a custom dataset specifically for fabric image generation and classification. Our analysis revealed that, in terms of fabric construction, the OpenAI DALL-E model integrated with ChatGPT outperformed other models, achieving a lower LPIPS (Learned Perceptual Image Patch Similarity) score of approximately 0.20.2. In fabric classification from images, we found OpenAI offered the best results by breaking down certain factors (e.g., breathability, moisture-wicking, and tactile comfort), achieving approximately 80%80\\% accuracy for base construction and 55%55\\% for detailed construction. However, our results indicate that Deepseek faced significant challenges in generating and recognizing fabric images. Overall, all the models struggled to recognize complex fabric constructions and intricate designs from images, and relying too much on AI might hinder human creativity. We also observed that all three models performed effectively in providing recommendations and insights for fabric design in textual form. Index Terms: Apparel, Design, Fashion, Artificial Intelligence, LLM I Introduction 111This paper is accepted on 3rd International Conference on Textile Science and Engineering For a very long time, fashion has been an embodiment of craftsmanship, innovation and civilization. In the past, it required a lot of effort to design and manufacture garments which largely depended on skilled artisans who meticulously crafted each item by hand. With the advancement of technology, automation has entered the process and production is being streamlined by digital pattern making, advanced industrial sewing machines, and computer aided design (CAD) integration with computer aided manufacturing (CAM). However, the most recent change in the garment industry which is the adoption of Artificial intelligence (AI), is influencing the production process to a large extent from design selection to trend forecasting. Adopting AI in the garment industry could be greatly beneficial to streamline manufacturing, improve production efficiency and forecast fashion with greater accuracy. Large Language Models (LLMs) and Generative AI are automating critical stages, from material selection and style generation to production and trend analysis. This integration improves efficiency and sustainability, enabling personalized fashion solutions. Tools like DALL-E, Gemini, and Deepseek are streamlining processes, assisting with sample making, cost analysis, and virtual try-on. Designers are now collaborating with AI to predict trends and optimize fabric choices. While AI enhances productivity and innovation, questions persist about its capacity to fully replicate or surpass human creativity. The balance between AI’s analytical power and human artistic intuition remains a key consideration in the future of fashion. Several research studies have explored AI’s role in fashion. Monteresso et al examined how AI models contribute to the fashion design process highlighting how AI can optimize creation processes, improve operational efficiency and shorten development times without compromising the quality and creativity[1]. Preliminary analysis revealed that ChatGPT and The New Black AI are the most suited tools. Qianqian Chen et al introduced Fashion-GPT, a model suitable for fashion retrieval systems and compared its performance with ChatGPT, Gemini and Deepseek[2]. Their findings showed that Fashion-GPT outperformed general models like ChatGPT in fashion-specific tasks particularly multi-view, multi-modal matching in fashion queries. Wenda Shi provided an overview which discussed incorporation of GenAI into fashion-related tasks and applications, multi-modal fashion understanding and fashion synthesis of image[3] with 53 publicly available datasets suitable for training and benchmarking fashion-centric models. Han Liu et al focused on ”Sequential LLM Framework for ",
  "wordCount": 3318,
  "hash": "8b7ba9655886334a"
}