{
  "url": "https://www.reddit.com/r/ecommerce/comments/173zu3p/ecommerce_industry_news_recap_week_of_october_9th/",
  "title": "Reddit - The heart of the internet",
  "snippet": "At its annual Refresh event, Squarespace announced several new platform features. The standout feature added was Squarespace Payments, a",
  "domain": "reddit.com",
  "extractedText": "Go to ecommerce r/ecommerce • adventurepaul E-commerce Industry News Recap - Week of October 9th, 2023 Hi r/ecommerce - I'm Paul and I follow the e-commerce industry pretty closely for my Shopifreaks E-commerce Newsletter. Each week I post a summary recap of this week's top stories, which I cover in depth in the newsletter.. STAT OF THE WEEK: Adobe forecasts online holiday spending will exceed $221 billion this year. Mobile shopping is expected to make up more than half of that amount.. Uber is now offering return package shipping through UPS, FedEx, and USPS. Customers can send up to five packages at a time for a flat $5 fee or $3 for Uber One members, its $9.99/month subscription plan. In comparison, FedEx charges between $3-4 per package, UPS charges $13 for same-day pickup and $8 for future-day pickup, plus up to a $6.50 surcharge for picking up from a residence, and USPS offers free package pickup from your home or office. (USPS is amazing.). One of my favorite publications, Rest of the World, created a report that highlights 40 global companies that are outmaneuvering Silicon Valley for market share domination in their respective countries. Highlights include PhonePE (480M registered users, beating Google Pay and WhatsApp Pay), Nubank (largest digital bank in the world, based in Brazil), Grab (ride-hailing app that beat Uber in SEA), and BYD (Chinese-made EV about to overtake Tesla).. A redacted portion of the FTC's antitrust lawsuit against Amazon has come to light, offering more details about a secret pricing algorithm known as Project Nessie. Inside sources spoke to the WSJ and claimed that the algorithm was used to test how high Amazon could raise prices before being undercut, automatically return prices to their previous lower levels when rivals did not match their hikes, and discount goods if a competitor reduced prices -- which Amazon says is just normal retail behaviors.. At its annual Refresh event, Squarespace announced several new platform features. The standout feature added was Squarespace Payments, a native payment solution that will let business users collect money for goods and services without having to integrate an external payment processor. This is Squarespace's answer to Shop Pay and Woo Payments.. Flipkart launched Flipkart Commerce Cloud, a suite of retail tech solutions including Marketplace Technology Stack (helps retailers launch marketplaces), Retail Media Solution (ad engine that understands shopper intent), and Retail Pricing Manager (cloud-based SaaS pricing tool).. Flipkart launched its VIP subscription program in preparation for the festive season of sales, taking on Amazon's Prime membership in India. The membership will be priced at Rs 499 annually ($5.99/year), undercutting Amazon Prime in the country which is priced at Rs 1499 annually ($17.99/year). In response to the Flipkart VIP program, Amazon launched Prime Shopping Edition for Android, which gives users access to free shipping and one-day deliveries for Rs 399 ($4.79/year), but does not include access to Prime Video, Music, Reading, Gaming, or other offerings.. Google and Yahoo announced new email-sending policies that could impact e-commerce merchants. The policies require: E-mail Authentication via SPF, DKIM, and DMARC, Single-click unsubscribes when sending more than 5k e-mails a day, and Low complaint rates (reported Spam rates of less than 0.3%). Historically it's been recommended that companies authenticate their e-mails using the tools above, but now Google and Yahoo are making them requirements versus recommendations.. PayPal was hit with a class action lawsuit by consumers alleging that its anti-steering rules stifle competition against lower-cost payment platforms such as Stripe and Shopify. PayPal's rules say that if a retailer accepts PayPal or Venmo payments, they agree NOT to offer discounts or incentives to persuade consumers to use other payment options, tell customers that other payment options are more cost effective, or present other forms of payment earlier in the checkout process. The suit states that PayPal’s merchant agreement leads to consumers paying more to make purchases, which “if PayPal’s agreements were transparent, consumers would quickly see a price difference between PayPal and Venmo and its competitors.”. Pitney Bowes is evaluating if the company should sell off its global e-commerce business unit, which provides retailers with a parcel delivery and returns network and other fulfillment services. Last week the company's President and CEO Marc B. Lautenbach stepped down, effective immediately, after being pressured by a large investor to do so from both roles. He also resigned his seat on the company’s board. Jason Dies, who most recently served as the company’s executive VP and group president, was named interim CEO, while the company searches for a permanent successor.. WPP launched a strategic partnership with Shopify to jointly develop products with shared insights and pair",
  "wordCount": 1922,
  "hash": "8ce02fc4aa57fad1",
  "topic": "Ecommerce_Retail_Tech"
}