{
  "url": "https://www.thepacker.com/news/retail/walmart-and-openai-create-ai-first-shopping-experience",
  "title": "Walmart and OpenAI Create AI-First Shopping Experience - The Packer",
  "snippet": "Walmart and OpenAI Create AI-First Shopping Experience. Customers will be able to make purchases directly through ChatGPT, advancing a broader",
  "domain": "thepacker.com",
  "publishedDate": "2025-10-15T19:41:48.254",
  "extractedText": "The Packer/News/Retail Walmart and OpenAI Create AI-First Shopping Experience Customers will be able to make purchases directly through ChatGPT, advancing a broader strategy to use artificial intelligence for more personalized, predictive and seamless retail interactions. By Jill Dutton • October 15, 2025 02:39 PM Under the new partnership with OpenAI, Walmart says it will start by allowing customers and members to shop Walmart through ChatGPT using Instant Checkout.(Image courtesy of Walmart) Walmart’s new partnership with OpenAI integrates artificial intelligence-powered commerce directly into ChatGPT, a collaboration that marks what the company calls “AI-first shopping,” aiming to make retail more predictive, personal and effortless.Under the deal, Walmart says it will start by allowing customers and members to shop Walmart through ChatGPT using Instant Checkout. Whether planning meals, restocking household essentials or finding something new, customers can simply chat and buy, and Walmart will handle the rest, the company says.“For many years now, e-commerce shopping experiences have consisted of a search bar and a long list of item responses. That is about to change,” says Doug McMillon, president and CEO of Walmart. “There is a native AI experience coming that is multimedia, personalized and contextual. We are running towards that more enjoyable and convenient future with Sparky and through partnerships including this important step with OpenAI.” The initiative builds on Walmart’s broader AI strategy, which already extends across its entire ecosystem. The company and its warehouse club subsidiary, Sam’s Club, use AI to streamline product catalog creation, accelerate fashion production timelines by up to 18 weeks and improve customer care resolution times by as much as 40%.“We’re excited to partner with Walmart to make everyday purchases a little simpler,” says Sam Altman, co-founder and CEO of OpenAI. “It’s just one way AI will help people every day under our work together.”Walmart says its vision for “agentic commerce” moves retail beyond a reactive model. Instead of waiting for customers to search, the system will learn, plan, and predict — helping shoppers anticipate their needs before they even arise. Beyond customer-facing innovations, Walmart says it is also investing in its workforce through AI literacy and education. The company says it was one of the first to adopt OpenAI Certifications and has rolled out ChatGPT Enterprise to teams across its organization, giving associates access to advanced AI tools for greater efficiency and creativity. Industry News Produce Retail Produce Tech Related Stories Retail 7 Opportunities to Boost Produce Sales in 2026 From the surprising new power shopper to engaging Gen Z and millennials to redefining value in the produce department, The Packer’s Fresh Trends 2026 is packed with data and insights to help drive fruit and vegetable sales — starting with these seven opportunities. January 16, 2026 05:36 PM · Jennifer Strailey Retail How Retail Collaboration and Supply Strategies Drive Citrus Marketing Success Despite ongoing supply-side issues, the demand side of citrus is looking strong, with growing demand from a health-focused consumer audience, all it takes is thoughtful and creative strategies from suppliers and collaboration with retail. January 16, 2026 02:30 PM · Kerry Halladay Industry East Coast Produce Expo 2026 Rocks Hot Trends, Cool Produce and Olympic Gold From mushrooms to Persian limes to murasaki sweetpotatoes to microgreens and more, exhibitors at East Coast Produce Expo 2026 showcased some of the hottest trends in produce. January 16, 2026 02:21 PM · Jennifer Strailey Read Next Retail The Evolution of Value-Added Snacking in the Fresh Department By bridging the gap between “better-for-you” nutrition and the convenience of traditional CPG snacks, suppliers are unlocking new revenue streams through sophisticated merchandising and right-sized packaging. January 15, 2026 04:12 PM · Jill Dutton Industry Mission Produce to Acquire Calavo in $430M Deal, Creating Global Avocado Powerhouse January 15, 2026 02:48 AM · Christina Herrick Retail Marketing Gurus Share Strategies for Building Produce Brand Success Stories January 14, 2026 05:29 AM · Christina Herrick Retail Fresh Trends 2026: Defining the Fresh Produce Value Proposition January 13, 2026 06:00 AM · Jennifer Strailey Market Data Futures prices on grains, livestock, oil and more Farm Journal TV Trusted ag insights and real stories from rural America. Pro Farmer Check your current market positions against our recommendations to see if catch-up sales are needed.",
  "wordCount": 700,
  "hash": "8fa5148f3567a42e",
  "topic": "AI_and_Strategy"
}