{
  "url": "https://www.businessoffashion.com/articles/technology/best-of-2023-technology-ai-ecommerce-virtual-fashion/",
  "title": "The Best of BoF 2023: The AI Revolution | BoF",
  "snippet": "Soon, brands had started to use generative AI for design and marketing, retailers were unveiling conversational chatbots and technology",
  "domain": "businessoffashion.com",
  "publishedDate": "2023-12-30T05:27:00Z",
  "extractedText": "The technology that owned 2023 was undoubtedly AI. ChatGPT debuted just before the start of the year, kicking off a race among tech giants to integrate or match its capabilities. Soon, brands had started to use generative AI for design and marketing, retailers were unveiling conversational chatbots and technology providers introduced tools to speed up tasks like writing product descriptions.But it wasn’t the only technology to have an impact. NFT projects may have dried up, but the blockchain technology underlying them found new users. Nike launched one of the industry’s biggest web3 projects to date, releasing the first blockchain-based virtual goods under its name. It just didn’t call them NFTs. Brands also ramped up efforts to create digital product passports for their physical goods as coming EU regulations take shape.Technology played a variety of roles beyond these efforts. On the customer-facing front, brands leaned into virtual spaces like Roblox, while they sought better ways to track and manage inventory on the backend with RFID. Competition in fashion is as fierce as ever, and companies will keep looking to technology for any edge they can get.Top StoriesCase Study | The Complete Playbook for Generative AI in Fashion: From ChatGPT to Midjourney to Runway, the emerging technology is already showing why it could be one of the most consequential in decades for the fashion industry. Early adopters and experts unpack the opportunities and challenges of putting gen AI to use to design products, create campaigns and other content, and better connect with customers.ADVERTISEMENT(Casablanca) AI Takes on the Fashion Industry’s Counterfeit Problem: LVMH’s Patou has begun rolling out a new AI-powered authentication system with its technology partner Ordre, adding a new dimension in fashion’s effort to fight fakes using AI’s ability to spot patterns indiscernible to humans.(Patou) Millions of Luxury Products Now Come With Unique Digital Passports. Here’s What That Means.: Brands are starting to adopt the tags in large numbers as they prepare to meet major new EU regulations coming down the pipeline. They’re using the opportunity to build in customer-facing features that can appeal to shoppers, too.(Mugler) RFID’s ‘Quiet Revolution’ in Retail: Zara, Uniqlo and American Eagle are among those leaning on the technology for abilities like self-checkout and better inventory tracking, while more companies join the ‘cult of RFID’ each year.(Getty Images) Inside the Battle to Run Fashion’s E-Commerce: Shopify, Farfetch and other tech companies are vying for the multi-billion-dollar opportunity to handle the backend of brands’ online stores.(Supreme) Do Brands Need Chief Digital Officers?: The role is changing as fashion companies break “digital” responsibilities out of their siloes, leading some to rethink the position.(Jeremy Moeller/Getty Images) The BoF Podcast | How to Turn Our Fear of AI Into Optimism: Mo Gawdat, an artificial intelligence expert and former chief business officer of Google X, explains how humans have the power to turn AI into a positive force that benefits society.(Getty Images)",
  "wordCount": 481,
  "hash": "94760dfbd0f67a3d"
}