{
  "url": "https://yesplzfashion.medium.com/the-latest-generative-ai-in-fashion-news-2023-9185d3965cf1",
  "title": "The Latest Generative AI in Fashion News (2023) | by YesPlz.AI | Medium",
  "snippet": "Generative AI in fashion will have an enormous impact on the way we shop by making the experience more personalized, but also by automating repetitive work.",
  "domain": "yesplzfashion.medium.com",
  "publishedDate": "2023-07-19T18:27:21.649Z",
  "extractedText": "The Latest Generative AI in Fashion News (2023)YesPlz.AI6 min read·Jul 19, 2023--ListenSharePress enter or click to view image in full sizeIn 2023, generative AI for fashion has taken the industry by storm. Some brands are even using generative AI to generate their own product designs, while others are using it to offer a more personalized shopping experience.With the potential to “transform” the fashion industry, according to the latest news and research by McKinsey, we’re here to unlock what generative AI in fashion is all about.Is it just for fun, or does it truly have the potential to shake up the industry?Key points for this article:Generative AI will be most impactful in two areas: productivity improvements and creating better personalization experiences for shoppers.When combined with other AI technology, there’s the potential to transform the product discovery experience.ChatGPT was the talk of everyone from influencers to retailers in Spring 2023. While influencers showed off their ChatGPT-inspired outfits, retailers rushed to find a way to integrate the technology to improve their own search.Major generative AI launches from Google and Shopify show that generative AI is here to stay.Generative AI for Fashion: All Hype or the Future of Fashion?Generative AI gets its name from its ability to generate novel content from a prompt, making it easy for anyone to use. The output can include video, images, sound, and text.The ability to analyze large amounts of data means improvements in productivity in fashion.But, where generative AI for fashion really becomes interesting is when we look at the interesting applications for fashion eCommerce, when combined with other technology.Press enter or click to view image in full sizeWe believe that generative AI for fashion has the potential to change the conversation between shoppers and retailers.Because, right now, shoppers and retailers aren’t understanding each other.When a shopper types in a search query, she receives back a limited number of products matching her keyword, but isn’t seeing the entire product catalog.Enter Generative AI. When combined with other technology like computer vision, it has the potential to change the language of fashion between the shopper and retailer.How?The conversation can be more natural and fluid with tools like YesPlz’s ChatGPT Fashion Stylist.Press enter or click to view image in full sizeThe 2 Most Impactful Areas for Generative AI in Fashion:Generative AI in fashion will have an enormous impact on the way we shop by making the experience more personalized, but also by automating repetitive work and data management for retailers.1-Productivity ImprovementsAny repetitive work can be replaced by generative AI. However, this doesn’t replace the need for human intervention to guide the AI, and analyze the output to make sure it’s accurate.Here are some areas that generative AI in fashion can improve productivity for fashion:Creating content, from product descriptions to promotions, as well as ad campaigns. Sometimes the most difficult part of marketing campaigns is coming up with an initial concept. Generative AI helps start the brainstorming process.And, when it comes to product descriptions, AI can generate descriptions for a vast array of products using specific product attributes and information, in a much more efficient and cost-effective way than a human.Analyzing backlog data such as sales and inventory to make better predictions on future sales and inventory needs.Data management, such as product data mapping and clean upDesigning a new fashion collection at scale and quickly from a prompt. Fashion designers can quickly generate concepts or get initial ideas2-PersonalizationBy analyzing large amounts of data, it can generate personalized recommendations for shoppers.Use cases for personalization using generative AI include:Personal shopping assistant: Generative AI in fashion can easily improve difficult-to-use, unnatural chatbots, making shopping less like talking to a robot and more personalized. For example, if a shopper is logged in, generative AI can suggest the best size for a garment based on your profile.AI fashion stylist: When combined with other technology, generative AI can provide real, curated fashion products based on shoppers’ preferences. For example, YesPlz combines generative AI for fashion with computer vision and deep learning to provide shoppers with a curated product discovery experience.Dynamic pricing and offers: Customers can receive personalized offers, relevant to their shopping habits, demographics, or location.Virtual try-on: Shoppers want to see models that look like them, which can be challenging for brands. However, with generative AI for fashion, brands can generate different, diverse models.Key Moments in Generative AI for Fashion, Spring 2023:These are the key moments to keep an eye on, from this past spring:Google launches virtual-try on tool using generative artificial intelligenc",
  "wordCount": 1157,
  "author": "YesPlz.AI",
  "hash": "a73844d29e857b0f"
}