{
  "url": "https://corporate.walmart.com/news/2025/10/14/walmart-partners-with-openai-to-create-ai-first-shopping-experiences",
  "title": "Walmart Partners with OpenAI to Create AI-First Shopping Experiences",
  "snippet": "Walmart's new partnership with OpenAI will allow customers and members to shop with ChatGPT, creating an AI-first experience where shoppers",
  "domain": "corporate.walmart.com",
  "extractedText": "Home News Walmart Partners with OpenAI to Create AI-First Shopping Experiences Walmart Partners with OpenAI to Create AI-First Shopping Experiences From inspiration to purchase, Walmart and Sam’s Club are shaping the future of retail, connecting with customers and members at every step. Key Insights Partnership will allow customers and members to complete purchases from Walmart directly within ChatGPT.Through AI-first shopping, the retail experience shifts from reactive to proactive as it learns, plans and predicts, helping customers anticipate their needs before they do.This partnership builds on the multiple ways Walmart and Sam’s Club are already using AI, like enhancing product catalogs, improving customer care resolution times and promoting AI literacy among associates. Oct. 14, 2025 Innovation Copy link to clipboard Walmart is ushering in the next generation of retail by combining its huge assortment, everyday low prices and delivery speed with the power of AI. Today, the company announced a new partnership with OpenAI that will start with allowing customers and members to soon shop Walmart through ChatGPT using Instant Checkout. Whether planning meals, restocking household essentials, or finding something new, customers can simply chat and buy, and Walmart will handle the rest. “For many years now, eCommerce shopping experiences have consisted of a search bar and a long list of item responses. That is about to change. There is a native AI experience coming that is multi-media, personalized and contextual. We are running towards that more enjoyable and convenient future with Sparky and through partnerships including this important step with OpenAI,” said Doug McMillon, President and CEO, Walmart Inc. At the center of this transformation are the everyday moments that define how people shop. This is agentic commerce in action: where AI shifts from reactive to proactive, from static to dynamic. It learns, plans and predicts, helping customers anticipate their needs before they do. “We’re excited to partner with Walmart to make everyday purchases a little simpler. It’s just one way AI will help people every day under our work together.” Sam Altman, cofounder and CEO of OpenAI Today, Walmart and Sam’s Club leverage AI across every part of the business. It's not just about moving fast; it’s about moving smarter and with purpose. From enhancing the product catalog to reduce fashion production timelines by up to 18 weeks, to ensuring a more seamless shopping journey and cutting customer care resolution times by up to 40%, the company is applying AI so every shopping experience is more convenient and more rewarding. Walmart also is empowering its associates with AI tools and training, including promoting AI literacy across its workforce as one of the first partners to embrace OpenAI Certifications and rolling out ChatGPT Enterprise to teams across the company. As Walmart defines what’s next for retail, its approach remains the same: people-led and tech-powered, helping people save money and live better. The future of retail isn’t about replacing human connection with machines, it’s about using AI to remove friction and make everyday moments easier, smarter and more delightful. FAQs What is Walmart’s new partnership with OpenAI? Walmart has partnered with OpenAI to create AI-first shopping experiences, starting with allowing customers and members to soon shop Walmart through ChatGPT using Instant Checkout. This allows customers and Sam’s Club members to plan meals, restock essentials, or discover new products simply by chatting — Walmart will take care of the rest. How will this partnership change the way customers shop? This partnership moves beyond traditional eCommerce search bars toward personalized, contextual, and multi-media interactions. AI will learn and predict customers’ needs, turning shopping from a reactive experience into a proactive one — what Walmart calls agentic commerce. What did Walmart’s CEO and OpenAI say about the role of AI in retail? Doug McMillon, President and CEO of Walmart Inc., said: “For many years now, eCommerce shopping experiences have consisted of a search bar and a long list of item responses. That is about to change... We are running towards that more enjoyable and convenient future with Sparky and through partnerships including this important step with OpenAI.” “We’re excited to partner with Walmart to make everyday purchases a little simpler. It's just one way AI will help people every day under our work together,” said Sam Altman, cofounder and CEO of OpenAI. How is Walmart already using AI across its business? Walmart and Sam’s Club leverage AI in multiple ways — from enhancing product catalogs to cutting fashion production timelines by up to 18 weeks and improving customer care resolution times by up to 40%. These AI-driven efficiencies make shopping faster, smarter, and more rewarding. How is Walmart empowering its workforce through AI? Walmart is promoting AI literac",
  "wordCount": 913,
  "hash": "aaae326fed3bc6e3"
}