{
  "url": "https://www.mckinsey.com/industries/retail/our-insights/generative-ai-unlocking-the-future-of-fashion",
  "title": "Generative AI in fashion | McKinsey",
  "snippet": "By Holger Harreis, Theodora Koullias, Roger Roberts, and Kimberly Te. While still nascent, generative AI has the potential to help fashion businesses become more productive, get to market faster, and serve customers better. Instead of relying on trend reports and market analysis alone to inform desi",
  "domain": "mckinsey.com",
  "publishedDateInvalid": true,
  "extractedText": "Generative AI in fashion | McKinsey\n\n[Skip to main content](#skipToMain)\n\n# Generative AI: Unlocking the future of fashion\n\n| Article\n\nBy [Holger Harreis](/our-people/holger-harreis), Theodora Koullias, [Roger Roberts](/our-people/roger-roberts), and Kimberly Te\n\n[Print](#/print)\n\n[Save](#/save)\n\nWhile still nascent, generative AI has the potential to help fashion businesses become more productive, get to market faster, and serve customers better. The time to explore the technology is now.\n\n### DOWNLOADS\n\n[Article (7 pages)](#/download/%2F~%2Fmedia%2Fmckinsey%2Findustries%2Fretail%2Four%20insights%2Fgenerative%20ai%20unlocking%20the%20future%20of%20fashion%2Fgenerative-ai-unlocking-the-future-of-fashion.pdf%3FshouldIndex%3Dfalse)\n\n**As this season’s fashion weeks** wrap up in London, Milan, New York, and Paris, brands are working to produce and sell the designs they’ve just showcased on runways—and they’re starting next season’s collections. In the future, it’s entirely possible that those designs will blend the prowess of a creative director with the power of generative artificial intelligence (AI), helping to bring clothes and accessories to market faster, selling them more efficiently, and improving the customer experience.\n\n##### How relevant and useful is this article for you?\n\n### Most Popular Insights\n\n1. [**The agentic organization: Contours of the next paradigm for the AI era**](/capabilities/people-and-organizational-performance/our-insights/the-agentic-organization-contours-of-the-next-paradigm-for-the-ai-era)\n2. [**Global Banking Annual Review 2025: Why precision, not heft, defines the future of banking**](/industries/financial-services/our-insights/global-banking-annual-review)\n3. [**The economic potential of generative AI: The next productivity frontier**](/capabilities/tech-and-ai/our-insights/the-economic-potential-of-generative-ai-the-next-productivity-frontier)\n4. [**Deploying agentic AI with safety and security: A playbook for technology leaders**](/capabilities/risk-and-resilience/our-insights/deploying-agentic-ai-with-safety-and-security-a-playbook-for-technology-leaders)\n\nBy now, you’ve likely heard of OpenAI’s ChatGPT, the AI chatbot that became an overnight sensation and sparked a digital race to build and release competitors. ChatGPT is only one consumer-friendly example of generative AI, a technology comprising algorithms that can be used to create new content, including audio, code, images, text, simulations, and videos. Rather than simply identifying and classifying information, generative AI creates new information by leveraging foundation models, which are deep learning models that can handle multiple complex tasks at the same time. Examples include GPT-3.5 and DALL-E. (For more on generative AI and machine learning, see “[What is generative AI?](/featured-insights/mckinsey-explainers/what-is-generative-ai)”1“[What is generative AI?](/featured-insights/mckinsey-explainers/what-is-generative-ai)” McKinsey, January 19, 2023.  and “[Generative AI is here: How tools like ChatGPT could change your business](/capabilities/quantumblack/our-insights/generative-ai-is-here-how-tools-like-chatgpt-could-change-your-business).”2Michael Chui, Roger Roberts, and Lareina Yee, “[Generative AI is here: How tools like ChatGPT could change your business](/capabilities/quantumblack/our-insights/generative-ai-is-here-how-tools-like-chatgpt-could-change-your-business),” McKinsey, December 20, 2022.)\n\nWhile the fashion industry has experimented with basic AI and other frontier technologies—the metaverse, nonfungible tokens (NFTs), digital IDs, and augmented or virtual reality come to mind—it has so far had little experience with generative AI. True, this nascent technology became broadly available only recently and is still rife with worrisome kinks and bugs, but all indications are that it could improve at lightning speed and become a game changer in many aspects of business. In the next three to five years, generative AI could add $150 billion, conservatively, and up to $275 billion to the apparel, fashion, and luxury sectors’ operating profits, according to McKinsey analysis. From codesigning to speeding content development processes, generative AI creates new space for creativity. It can input all forms of “unstructured” data—raw text, images, and video—and output new forms of media, ranging from fully-written scripts to 3-D designs and realistic virtual models for video campaigns.\n\nThese are still early days, but some clear use cases for generative AI in fashion have already emerged. (Many of these use cases also apply to the adjacent beauty and luxury sectors.) Within product innovation, marketing, and sales and customer experience in particular, the technology can have significant outcomes and may be more feasible to implement in the short term compared with other areas in the fashion value chain. In this article, we outline some of the most promising use cases and offer steps executives can ta",
  "wordCount": 3262,
  "hash": "ae7f749628596b6e",
  "topic": "AI_and_Strategy",
  "discoveredAt": "2026-01-18T13:37:04.384Z",
  "sourceType": "consultancy"
}