{
  "url": "https://vator.tv/2023-02-28-the-majority-of-retailers-have-incorporated-ai-and-machine-learning/",
  "title": "The majority of retailers have incorporated AI and machine learning - VatorNews",
  "snippet": "That includes 41% of retail respondents who said there have been substantial benefits, and 32% saying they've seen modest benefits. Only 23%",
  "domain": "vator.tv",
  "publishedDate": "2023-02-28T14:30:00+00:00",
  "extractedText": "There’s been a noticeable shift towards manufacturers and retailers relying more and more on technology, like artificial intelligence and machine learning, and data to make their decisions on what to produce and what to sell in both long and short term forecasting. There are also a number of startups that are providing these types of tools to retailers and manufacturers, analyzing this data through the use of AI, such as Stylumia and MakerSights, and now a new survey from multicloud solutions provider Rackspace Technology on Tuesday underlines just how important these technological innovations have become, and will be going forward, to these retailers. The data, which was released exclusively to Chain Store Age, showed 71% of retail respondents saying that AI and ML currently leads their IT/business strategy. That includes 62% who use the technology to predict business performance and 61% who use it for data analysis, while 56% use it as a driver of innovation and 52% use it to improve speed and efficiency, as well as to reduce risk in the future. The survey polled 1,420 global IT decision-makers across industries that included retail, financial services, manufacturing, hospitality, government, and healthcare, in companies and organizations that have between 1,000 to 9,999 employees and an annual revenue between $50 million and $1 billion. Still, these technologies are relatively new for these organizations, as nearly half, 43%, said they only began using AI and ML within the last two years, and 25% within the last year. That might be why there’s still some trepidation when it comes to using artificial intelligence and machine learning: 55% said they encountered pushback or scrutiny about the penetration of AI/ML in their organization. Meanwhile, 30% said there are strongly enough checks and balances in place to avoid the negative consequences of AI/ML, and 47% said they there are only slightly enough checks and balances in place at the moment. Organizations also seem to be split on whether or not they trust the results they get from this technology, as 35% said they slightly trust them, and slightly less, 33%, said they strongly trust them. Despite all of that, they’re still using them, and for a good reason: these companies are already seeing the benefits of using these technologies. That includes 41% of retail respondents who said there have been substantial benefits, and 32% saying they’ve seen modest benefits. Only 23% said it’s too early to tell. Along those benefits were 73% who said faster time to profitability, increased productivity, increased revenue streams, operation cost reduction, and 72% who said it improved customer satisfaction, risk management. Another 69% said it increased innovation, personalized marketing, 66% said the technologies increased understanding of business/customers, 65% said they reduced cost of new product development, and 64% said they enhanced the company’s ability to hire/recruit new talent and increased sales. “As AI and machine learning mature and projects mature, we are seeing it expand out across the organization and become more ubiquitous, advancing in its importance, visibility, and usage,” said Jeff DeVerter, chief technology evangelist, Rackspace Technology, said in a statement. “The fact that more respondents began their AI/ML journey within the past year is striking, and points to the fact that these technologies are seen as they key to driving efficiencies in uncertain economic times. At the same time, the research makes clear that many organizations are still struggling to understand or realize the technologies’ full benefits of AI/ML, and many face internal resistance to adoption.” (Image source: coresight.com) Tags:aiartificial intelligenceretailsurvey Share This Story, Choose Your Platform! Steven Loeb All Author Posts Support VatorNews by Donating Donation Amount Read more from related categories 0 1000-Likes.com Celebrates 15 Years of Helping Creators Grow Organically 0 Why Gen Z Is Leaving Google for TikTok: What This Means for Brands in 2025 0 Trump rescinds Biden executive order on artificial intelligence Related News How data is helping the fashion industry predict purchases Over 70% of retailers are optimistic about 2023, though economic concerns loom",
  "wordCount": 663,
  "author": "Steven",
  "hash": "b814d69520612cd2"
}