{
  "url": "https://www.forbes.com/sites/garydrenik/2025/10/07/ai-becomes-a-core-strategy-for-retailers-facing-volatile-demand/",
  "title": "AI Becomes A Core Strategy For Retailers Facing Volatile Demand",
  "snippet": "According to a recent 7thonline survey, one-third of retail executives are already using AI to forecast and analyze demand, while 34% expect it",
  "domain": "forbes.com",
  "publishedDate": "2025-10-07",
  "extractedText": "LeadershipLeadership StrategiesAI Becomes A Core Strategy For Retailers Facing Volatile DemandByGary Drenik,Contributor.Forbes contributors publish independent expert analyses and insights. Gary Drenik is a writer covering AI, analytics and innovation.Follow AuthorOct 07, 2025, 10:00am EDTAI SystemsGetty Images - Issarawat TattongArtificial intelligence is quickly becoming the foundation of efficiency in the world of retail — from demand forecasting and sales analysis to localized allocation and personalization. The technology is arriving on the scene just in time, promoting agile strategies as shopping behaviors shift faster than ever. Consumer confidence fell in August amid anxiety around unemployment and inflationary price adjustments. In response, retailers are building more responsive planning strategies to meet shoppers where they are, with products they are looking for, and AI is becoming central to that effort. Using AI, retailers can more accurately forecast sales trends, quickly respond to shifting consumer behaviors and preserve loyalty.Why Chatbots Shouldn’t Be a Top Area of AI Spending for RetailersData from a recent Prosper Insights & Analytics survey, shows that one-third of people ages 18 and up have heard of generative AI and are already using it, including more than 40% each of Gen-Z and Millennials, a third of Gen-Xers and more than 20% of Baby Boomers. Prosper - Heard of Generative AIProsper Insights & AnalyticsGiven consumers’ familiarity with generative AI and the cost savings associated with using AI for customer service functions, some retailers are spending heavily on generative AI chatbots in an effort to increase personalization for online shopping experiences. The global AI for customer service market was estimated to be $13 billion in 2024 and is expected to reach $84 billion by 2033. MORE FOR YOU“Of course, this isn’t the only use case for AI in retail, nor is it necessarily the most effective use of budget; consumers are very familiar with AI, but that doesn’t mean they want to deal with it when shopping,” commented Max Ma, CEO and Founder of 7thonline. According to Prosper Insights & Analytics, more than 70% of Americans ages 18 and older would prefer to speak to a live person rather than a generative chat program. “Until sentiment around AI for customer service changes, spending may be better focused on optimizing inventory and supply chains or enhancing merchandising strategies. These are use cases that directly impact the bottom line. Many retail executives recognize the benefits and untapped potential of AI in these areas and are already investing,” said Ma.Prosper - Prefer to Communicate with for Online ShoppingProsper Insights & AnalyticsStaying Ahead of ShoppersAccording to a recent 7thonline survey, one-third of retail executives are already using AI to forecast and analyze demand, while 34% expect it to play a major role in sustaining or growing profits over the next two years. Retailers aim to use AI to stay ahead of shoppers by predicting and capturing emerging trends.Today’s fast-moving retail landscape is marred by turbulence as consumers doubt their continued employment and ability to pay for things. Thus, retail success has come to depend on AI tools that are able to identify exactly what shoppers are looking for, when they are looking for it. The ability to analyze mass amounts of historical and current data in real time down to style, color, size is invaluable to stay ahead of shoppers. This enables retailers to remain agile and meet their business goals. According to 7thonline, a growing share of executives are investing in predictive technologies to anticipate shifts in consumer demand, with 54% either using AI or exploring AI options in this area.To reduce inventory risk, retailers are also taking tactical steps like cutting inventory levels and diversifying suppliers to preserve their margins, but their long-term focus is shifting toward smarter, more resilient merchandise planning. Data from 7thonline shows that responsive pricing strategies (20%) and speed to market (14%) top the list of merchandise planning investment priorities, reflecting a push to become more agile amid ongoing uncertainty on both the supply and demand side of retail.Driving Loyalty with AIA related challenge for retailers in the current environment is brand loyalty, especially among younger generations who are more likely to switch brands based on price and other qualifications, like value alignment. Forrester estimates that brand loyalty will decline 25% in 2025, adding that saving money is one of the top five reasons consumers in the U.S. will try a new brand. Additionally, a recent Prosper Insights & Analytics survey, found that 39% of Americans age 18 and up are buying more store brand or generic products due to price increases.Prosper - As a Result of Price Increases Are You Doing Any of the FollowingProsper Insights & AnalyticsIn addition to saving money, customers are also s",
  "wordCount": 1044,
  "author": "Gary Drenik",
  "hash": "bead1fd89ac9b684",
  "topic": "AI_and_Strategy"
}