{
  "url": "https://www.grocerydive.com/news/hannaford-updated-ecommerce-platform-online-grocery-delivery-pickup/803487/",
  "title": "Hannaford prepares to launch updated e-commerce platform | Grocery Dive",
  "snippet": "Hannaford plans to roll out a revised website and app next week that will offer new features to online shoppers, the Ahold Delhaize-owned supermarket chain said in an email to customers on Tuesday. The updated Hannaford To Go e-commerce platform, due to launch on Oct. 28, will include an improved se",
  "domain": "grocerydive.com",
  "extractedText": "An article from Hannaford prepares to launch updated e-commerce platform The new online system will include a faster search engine and let customers pre-select substitutions while they shop, the grocer told shoppers. Published Oct. 22, 2025 Sam Silverstein Reporter Share Copy link Email LinkedIn X/Twitter Facebook Print License Add us on Google A Hannaford store in New Hartford, New York, on June 12, 2025. Getty Images Listen to the article 2 min This audio is auto-generated. Please let us know if you have feedback. Hannaford plans to roll out a revised website and app next week that will offer new features to online shoppers, the Ahold Delhaize-owned supermarket chain said in an email to customers on Tuesday. The updated Hannaford To Go e-commerce platform, due to launch on Oct. 28, will include an improved search engine that will allow customers to find items more quickly. The system will also let people pre-select substitutions while they shop as well as approve or reject the suggested alternatives before their order is delivered or ready for pickup. In addition, the platform will accept additional forms of payment, including EBT and Apple Pay, Hannaford said. However, the New England supermarket will stop accepting payments and coupons curbside when it switches to the updated platform. Hannaford’s shift to the new online grocery shopping system will make it the last of Ahold Delhaize USA’s five banners to transition to the company’s proprietary digital and e-commerce platform, known as Prism. Speaking during Ahold Delhaize’s second-quarter earnings call in August, Ahold Delhaize President and CEO Frans Muller noted that Food Lion moved to Prism during that quarter and that Hannaford would be next to start using the platform in a move that would complete the Dutch grocery company’s deployment of the technology stateside. Hannaford’s online grocery operations were disrupted for several days last November by a cyberattack that impacted Ahold Delhaize USA’s network and forced it to take some systems offline. Ahold Delhaize later reported that the digital intrusion also exposed sensitive information belonging to more than 2 million people, including current and former employees as well as their dependents and beneficiaries. Hannaford operates approximately 190 grocery stores in Maine, New Hampshire, New York, Massachusetts and Vermont. Recommended Reading Ahold Delhaize credits omnichannel for strong financial results By Catherine Douglas Moran • Aug. 6, 2025 Hannaford suffers multi-day e-commerce outage as Ahold Delhaize contends with ‘cybersecurity incident’ By Catherine Douglas Moran, Sam Silverstein • Nov. 11, 2024 Ahold Delhaize launches new native mobile app By Peyton Bigora • Oct. 6, 2023 purchase licensing rights Filed Under: Technology, E-commerce",
  "wordCount": 430,
  "author": "Sam Silverstein",
  "hash": "bfb75b14a0c42043",
  "topic": "Ecommerce_Retail_Tech"
}