{
  "url": "https://www.forbes.com/sites/jenniferleighparker/2026/01/15/sofitel-ceo-ai-will-completely-disrupt-the-way-we-craft-trips/",
  "title": "Sofitel CEO: AI Will Completely Disrupt The Way We Craft Trips",
  "snippet": "As chief executive of the rapidly-growing global luxury brand, Maud Bailly shares her strategy for adapting to an AI-driven future.",
  "domain": "forbes.com",
  "publishedDate": "2026-01-15",
  "extractedText": "LifestyleTravelSofitel CEO: AI Will Completely Disrupt The Way We Craft TripsAs chief executive of the rapidly-growing global luxury brand, Maud Bailly shares her strategy for adapting to an AI-driven future. ByJennifer Leigh Parker,Contributor.Forbes contributors publish independent expert analyses and insights. Covering the future of luxury travel. Follow AuthorJan 15, 2026, 12:31pm ESTCEO Maud Bailly inside the newly renovated Sofitel New York.Courtesy Sofitel Consensus from the C-Suite of the largest hospitality companies, including Accor, Marriott, Hyatt, Four Seasons, Rosewood — many of whom I spoke with at the International Luxury Travel Market (ILTM) conference in December — is pretty clear: AI can’t replace the need for humans in hospitality, but it does present a “huge unlock” for travel planning and personalization in a highly personal business. AI technology can help hoteliers and travel agents assemble detailed client profiles, enrich experiences, and deliver deeply customized recommendations, beyond simple booking tasks. But most hotel companies can’t demonstrate a clear return on investment from AI tools — at least not yet. Which is why I sat down with Maud Bailly, the French executive who has not only found a way to generate a return using AI, but she’s improving sustainability practices at the same time. Since 2023, she has served as CEO of Sofitel, Sofitel Legend, MGallery & Emblems, four of Accor’s luxury-and-lifestyle brands. The terrace of the \"Chrysler View Suite\" at Sofitel New YorkCourtesy SofitelWhy it matters: She’s operating under the Accor umbrella. Accor is a French multinational hospitality company and one of the world’s largest hotel groups, with a portfolio of 5,760 hotels worldwide (according to the company’s latest quarterly earnings statement), and a market capitalization of 10.8 billion euro, as of January 15. When this company makes moves, everyone pays attention. What Bailly does with Sofitel, a 60-year old French brand backed by Accor, can tell us a lot about how luxury hotels are grappling with technology at scale. Her mandate is to fully revamp what she herself has called an “aging lady that needs a lift,” while attempting to steer an ambitious expansion plan. Currently, Sofitel operates 119 hotels worldwide. Of these, approximately one third are under renovation, and there are 39 new hotels in the pipeline for completion by 2030— in such far-flung locales as India, Saudi Arabia, and Egypt. Under Bailly’s tenure, 22 owners have signed on as Sofitel-branded properties and two U.S. hotels have completed full top-to-tail renovations: Sofitel New York and Sofitel Montreal Golden Mile. Perched confidently in Sofitel New York’s rather chic penthouse, with the steel gray backdrop of midtown Manhattan behind her, Bailly presented her future plans to reshape the public’s perception of Sofitel and its global footprint. There are plenty of industry skeptics who doubt it can be done. So, what’s her AI strategy? Here’s what she had to say: I'm interested in your thoughts on AI. Is there a clear return here? I think we need to be very lucid. It's still the very early stage of AI, and we need to remain humble. On the other hand, we are already leveraging AI, but on very specific applications. For example: We are very committed to sustainability with very strong KPIs [key performance indicators], with a very strong roadmap. It's not greenwashing. We are committed to sustainable luxury. Let's work on food waste. We've been using AI tools called Winnow Solutions and Orbisk. [These are AI-powered food-waste tracking systems used by hotels and other commercial kitchens to monitor what’s being thrown out so teams can adjust purchasing, prep and menus to cut waste.]By implementing those tools within the hotels, we managed to reduce between 50%-60% the average amount of food waste every month. You are ordering less food, spending less money, and transporting less. Which means less carbon emissions. You are saving money, and you are also more respectful to the planet. I love buffets. I love this kind of generosity in hotels. But we can't keep working like this, especially in our world. So, sustainability use cases are already live and have been demonstrating a massive positive impact. In Sofitel Le Scribe Paris Opéra, a water filtration system was installed, eliminating the use of plastic water bottles.SofitelReporter’s Note: Bailly has implemented programs to eliminate single use plastics across Sofitel hotels, such as retrofitting buildings with water filtration systems that eliminate the need for plastic bottles in-room. She is also known for pushing for the full eco-certification of her hotels, the results of which are published in Accor’s 2024 Sustainability Report. MB: Of course, there is still a long way to go for AI and it's clearly just the beginning. I do believe that the major uses of AI will be back of house. [Back of house refers to housekeeping operations, engineering and main",
  "wordCount": 1468,
  "author": "Jennifer Leigh Parker",
  "hash": "c30797245e30832b",
  "topic": "AI_and_Strategy"
}