{
  "url": "https://startup-weekly.com/How-brands-use-Gen-AI-in-fashion-to-design-their-collections-Plug-and-Play/",
  "title": "How brands use Gen-AI in fashion to design their collections, Plug and Play - Startup Weekly",
  "snippet": "Generative Artificial Intelligence (Gen-AI), is a machine learning form that generates new content from user prompts, input, or triggers.",
  "domain": "startup-weekly.com",
  "extractedText": "The Worldwide Startup News Platform Home News Interviews Newsletter For Startups For Investors About Us How brands use Gen-AI in fashion to design their collections, Plug and Play Published: 03-05-2024 13:07:00 | By: Pie Kamau | hits: 4673 | Tags: Artificial IntelligenceFashionGlobalMachine LearningMay 2024Tech Generative Artificial Intelligence (Gen-AI), is a machine learning form that generates new content from user prompts, input, or triggers. Today, text and images represent the pinnacle applications of this technology. Across different domains and industries, there is a unified drive to broaden its application to fields such as animation, sound effects, music, integrating virtual characters, and leveraging AI in fashion for collection design. How can Gen-AI be applied to the fashion industry? From the 2023 AI Fashion Week to Casablanca’s AI-generated campaign, the fashion industry has been one of the most explorative with the technology. Projects are being done in collaboration with agencies like Maison Meta and Lalaland.ai and sometimes in combination with domain-specific software. According to McKinsey, generative AI could increase the apparel, fashion, and luxury industries’ profit by $275 billion in the following three to five years. One of the most common use cases tested in the brand and retail industries involves marketing automation with companies like Pimento for marketing imagery inspiration, Writer for SEO or e-commerce content optimization, and Jasper AI for copywriting. For instance, Casablanca used the technology for its S/S 2023 marketing campaign. Another tested use case has been around online shopping assistance and customer service tailored to shopping. Companies like Kering, a luxury group, and Zalando, an online fashion retailer, launched a chatbot using ChatGPT to give product recommendations. Finally, product design is also seen as one of the use cases with the most potential, given the nature of the technology to support creativity, give answers, or provide newness. McKinsey highlights that design and product manufacturing are where technology will bring the most value. This is also supported by BCG’s study, stating that using AI for creative innovation performed about 40% better than a control group that did not use it. Conversely, participants who used AI for business problem-solving performed 23% worse than the control group. Product design is a critical step in manufacturing for any physical consumer product company. The current process involves a combination of methods and tools depending on the industry and the designer’s personal and preferred creative process. According to Business of Fashion, generative AI is a strategic priority for 73% of fashion executives, and 28% have tested it in the design and product development processes. Looking at the current design process, almost every product is built, starting with an inspirational phase, then building prototypes, and then the development phase. Using AI can help designers be inspired by getting more ideas. The added value comes mainly from AI models being able to ingest a large amount of data like trends, past collections, and customer interests to provide ideas. Many brands have explored the use of this technology to build collections and products, especially in 2023. The benefits of the technology can vary depending on whether a fast-fashion or luxury brand uses it. Fast-fashion or mid-market brands can use generative AI to create more designs based on the latest trends. In contrast, luxury companies might use it more at the start of the process purely for mood board visualization using different sources of inspiration. One can say that the challenge of using the technology is that the final rendering does not reach current standards in terms of structure or design. However, these tools should be used in parallel with human creativity. Some designers mention that “hallucinations” or errors made by AI systems can also be a source of inspiration. Who are the space's key players, and how do they tackle AI in fashion? The use of gen-AI is still in its early stages, given that it has been less than two years since tools have been developed and commercialized. In product design, solutions are at an even earlier stage due to the diversity of products to adapt to - for instance, cars, jewelry, and furniture. Currently, the market is structured between existing design tools, like Cala, that integrate gen-AI as an added feature, and emerging companies purely focused on asset generation, like cre[ai]tion or Raspberry AI. Using gen-AI can also serve benefits for optimized customization. Indeed, by integrating consumers’ preferences from first-party data collection or their own inputs like images and text, brands can create a new type of consumer relationship by manufacturing personalized products. Raspberry AI is even more focused on the fashion industry, providing market search for trends detection to accompany designers right fro",
  "wordCount": 1717,
  "author": "Pie Kamau",
  "hash": "c3b33c5b617b8e26",
  "topic": "AI_and_Strategy"
}