{
  "url": "https://retailtechinnovationhub.com/home/2026/1/15/walmart-ramps-up-focus-on-ai-and-drones-this-weeks-biggest-retail-technology-stories",
  "title": "Walmart ramps up focus on AI and drones: this week's biggest retail technology stories  — Retail Technology Innovation Hub",
  "snippet": "Walmart ramps up focus on AI and drones: this week's biggest retail technology stories · 1. Walmart and Google Gemini team on AI discovery and",
  "domain": "retailtechinnovationhub.com",
  "publishedDate": "2026-01-16",
  "extractedText": "Walmart ramps up focus on AI and drones: this week's biggest retail technology stories It's Friday, the weekend is almost upon us, so let’s kick back and reflect on another eventful week for the retail tech space. Here's your briefing on the most important stories from the past few days, including Pacsun, Papa Johns, Google Cloud, JD Sports Fashion, commercetools, Zalando, Amazon, osapiens, and Otto Group.1. Walmart and Google Gemini team on AI discovery and shopping experiences pushWalmart and Google are gearing up to launch a new experience built by Walmart and accessible directly within Gemini using the Universal Commerce Protocol.Gemini will automatically include Walmart and Sam’s Club in-store and online products when it’s relevant. For example, when a customer asks for advice on camping equipment for the spring season, it will return items from the retailer’s inventory of products. And since people talk back and forth with Gemini, there are more opportunities to show relevant products and services throughout the conversation.When customers discover items in Gemini, Walmart helps them move from inspiration to purchase , all within the familiar Walmart and Sam’s environments. When customers link their accounts, the retailer will recommend complementary items based on their past online and in-store purchases, combine their order with other items they’ve put in their carts, and provide all the benefits of their Walmart+ and Sam’s Club memberships.Customers and members can get in-store and club items delivered, with hundreds of thousands of locally curated products delivered in under three hours and as fast as 30 minutes.2. Otto Group boosts supply chain operations via NVIDIA and Reply robotics partnershipOtto Group, a digital retail and services group, is partnering with NVIDIA and Reply as it looks to improve supply chain operations through robotics.The initiative will see a network wide deployment of a Robotic Coordination Layer, powered by NVIDIA Omniverse libraries, and Isaac Sim, across a multitude of Otto Group’s 120 logistics locations. This connects robot fleets in the warehouse to a digital twin which displays the real-time locations and movements of all robots. Developed by Reply, this solution uses reality capture techniques and post-processing from sensors and cameras mounted on Boston Dynamics' Spot robot as it moves through the warehouse. Once established, the digital twin enables virtual reconfiguration of warehouse areas for process optimisation and simulations to support peak management. Concurrently, the Robotic Coordination Layer integrates with robotic fleet management tools and the WMS to coordinate and communicate with various robotic fleets, all visualised and managed within the digital twin. 3. Pacsun claims market first with launch of its social commerce app PS Community HubPacsun reports the launch of its proprietary digital platform, PS Community Hub, pitched as a first to market concept. It says that, unlike traditional retail apps or loyalty programmes, this integrates social connection, creator monetisation, and co-creation opportunities with a focus on youth culture.The announcement was made as part of a discussion at NRF 2026: Retail's Big Show in New York City focused on Gen Alpha and Gen Z research, with Pacsun CEO Brieane Olson and Business of Fashion's Sheena Butler-Young.\"The creation of PS Community Hub demonstrates our purpose driven retail strategy, putting creators and our youth community at the heart of our plan to fuel sustainable growth, cultural relevance, and innovation in retail,\" says Olson. \"Our deep generational listening and Insights from the Pacsun Youth Report have been instrumental in shaping this initiative, ensuring that we address the evolving needs and aspirations of our young consumers and remain at the forefront of technology and social commerce.\"4. Wing and Walmart set to expand drone delivery to 150 new stores across the USAWing and Walmart are expanding their drone delivery service to an additional 150 Walmart stores in the US over the next year, bringing this to more than 40 million Americans. The pair will establish a network of over 270 drone delivery locations by 2027, stretching from Los Angeles to Miami. This builds on operations in the Dallas-Fort Worth metroplex and Metro Atlanta.New service areas will include metropolitan hubs such as Los Angeles, St. Louis, Cincinnati, and Miami, with others to be announced at a later date. This expands on previously slated expansion markets: Houston, Orlando, Tampa, and Charlotte, which continues later this week when Wing and Walmart start operating in Houston on 15th January.“Drone delivery plays an important role in our ability to deliver what customers want, exactly when they want it. Whether it’s a last minute ingredient for dinner or a late-night essential for a busy family, the strong adoption we’ve seen confirms that this is the future of convenience,” says Greg Cathey, Senior Vice President ",
  "wordCount": 2679,
  "author": "Staff Writer",
  "hash": "c93ab3b265fe4b4d"
}