{
  "url": "https://fortune.com/2023/12/20/elon-musk-taylor-swift-inflation-ai-business-stories-2023/",
  "title": "Elon Musk, Taylor Swift, inflation and AI: Business stories that dominated 2023 | FortuneDown Arrow Button IconDown Arrow Button IconRight Arrow Button IconRight Arrow Button IconRight Arrow Button IconFacebook iconTwitter iconLinkedIn iconInstagram iconPinterest icon",
  "snippet": "A look back at 10 top business stories in 2023.",
  "domain": "fortune.com",
  "extractedText": "The tide turned against inflation. Artificial intelligence went mainstream — for good or ill. Labor unions capitalized on their growing might to win more generous pay and benefits. Elon Musk renamed and rebranded the social media platform Twitter, removed guardrails against phony or obscene posts and ranted profanely when advertisers fled in droves. The American housing market, straining under the weight of heavy mortgage rates, took a wallop. And Taylor Swift’s concert tour scaled such stratospheric heights that she invigorated some regional economies and drew a mention in Federal Reserve proceedings. A look back at 10 top business stories in 2023: RAGING AGAINST INFLATION The Fed and most other major central banks spent most of the year deploying their interest-rate weapons against the worst bout of inflation in four decades. The trouble had erupted in 2021 and 2022 as the global economy roared out of the pandemic recession, triggering supply shortages and igniting prices. By the end of 2023, though, the Fed, the European Central Bank and the Bank of England had taken a breather. Their aggressive rate hikes had brought inflation way down from the peaks of 2022, when Russia’s invasion of Ukraine sent energy and grain prices rocketing and intensified price spikes. In the United States, the Fed’s policymakers delighted Wall Street investors by signaling in December that 2024 would likely be a year of rate cuts — three to be exact, in their expectations — and not rate hikes. The Bank of England and ECB sounded a more cautious note, suggesting that inflation, though trending down, remained above their target. “Should we lower our guard?” Christine Lagarde, the ECB president, told reporters. “We ask ourselves that question. No, we should absolutely not lower our guard.” The Council on Foreign Relations, which tracks interest rates in 54 countries, found that central banks turned aggressive toward inflation in the spring of 2022. Policies remain tight, the council found, but the overall anti-inflation stance has eased. AI GOES MAINSTREAM Artificial intelligence thrust itself into public consciousness this year. But the technology, while dazzling for its ability to retrieve information or produce readable prose, has yet to match people’s science fiction fantasies of human-like machines. Catalyzing a year of AI fanfare was ChatGPT. The chatbot gave the world a glimpse of advances in computer science, even if not everyone learned quite how it works or how to make the best use of it. Worries escalated as this new cohort of generative AI tools threatened the livelihoods of people who write, draw, strum or code for a living. AI’s ability to produce original content helped fuel strikes by Hollywood writers and actors and legal challenges from bestselling authors. By year’s end, the AI crises had shifted to ChatGPT’s own maker, OpenAI, which was nearly destroyed by corporate turmoil over its CEO, and to a meeting room in Belgium, where European Union leaders emerged after days of talks with a deal for the world’s first major AI legal safeguards. WORKERS SCORE GAINS The long-battered American labor movement flexed its muscle in 2023, taking advantage of widespread worker shortages to demand — and receive — significantly better pay and benefits. From Hollywood writers and actors to autoworkers to hotel workers, 510,000 laborers staged 393 strikes in the first 11 months of 2023, according to Cornell University’s Labor Action Tracker. Under its pugnacious new president, Shawn Fain, the United Auto Workers struck the Big Three automakers — Ford, General Motors and Stellantis, the parent of Chrysler, Jeep and Ram — and won pay raises, improved benefits and numerous other concessions. Hollywood writers and actors, as a result of their walkouts, secured higher pay and protection from the unrestricted use of artificial intelligence, among other concessions. The unions’ gains marked a resurgence for their workers after years following the Great Recession of 2007-2009 when union power further dwindled, wage gains languished and employers seemed to have their pick of job candidates. An explosive economic rebound from the COVID-19 recession of 2020 and a wave of retirements left companies scrambling to find workers and provided labor unions with renewed leverage Still, even now, unions remain a shadow of what they once were: As of last year, roughly 10% of U.S. employees belonged to labor unions, way down from 20% in 1983. And back in the 1970s, the United States experienced an average of 500 strikes a year, involving 2 million workers, said Johnnie Kallas, a labor expert at Cornell. MUSK’S X-RATED TRANSFORMATION A little more than a year ago, Elon Musk walked into Twitter’s San Francisco headquarters, fired its CEO and other top executives and began transforming the social media platform into what’s now known as X. Since then, the company has been bombarded by allegations of misinformation, endured significant advertising losses an",
  "wordCount": 2001,
  "author": "Paul Wiseman",
  "hash": "cdf181468aa09acb"
}