{
  "url": "https://www.thinkwithgoogle.com/intl/en-emea/marketing-strategies/automation/artificial-intelligence-and-fashion/",
  "title": "The AI fashion revolution: Fuelling new shopping experiences",
  "snippet": "An AI revolution is underway in the world of fashion. New tools, powered by AI, are transforming how retailers are personalising the shopping journey.",
  "domain": "thinkwithgoogle.com",
  "extractedText": "Europe, Middle East & Africa The AI revolution in fashion: Here’s why retailers and consumers are excited Vincenzo Riili, Linda Bezze / October 2023 Share Share Share Share this page Close Email Copy Link Copied Linkedin Twitter Facebook Whatsapp Xing VK Link Copied The AI revolution in fashion: Here’s why retailers and consumers are excited Vincenzo Riili, Linda Bezze October 2023 Vincenzo Riili and Linda Bezze are marketing experts in Europe, the Middle East, and Africa. In new research from Google and Vogue Business, they share the latest opportunities in AI for fashion and luxury brands, and how new technologies are changing purchasing behaviours.An AI revolution is underway in the world of fashion. New tools, powered by AI, are transforming how retailers are personalising the shopping journey to make the consumer’s life easier. AI is also helping fashion brands design new products, and cut down on waste.New research from Vogue Business reveals how AI is changing consumers’ purchasing behaviours in Europe. Consumers are eager for an AI-led shopping experience — two thirds of respondents said they are “somewhat excited” or “very excited” for designer fashion brands to introduce more AI applications in the next 1-3 years.1They are even willing to spend more with retailers who have used AI tools for product personalisation, to improve the shopping experience online, and to develop sustainable practices. Nearly three in 10 (29%) are willing to spend an extra 20% or more with a brand that uses AI applications.2Here’s how retailers can successfully embrace these tools to meet the consumer needs of today — and reap higher returns at the same time.Boosting the customer experience with AIEver since the introduction of online shopping, the fashion industry has sought to bridge the gap between the in-store experience — where shoppers are able to search through store racks and physically try on items to find the perfect fit — and online. Forty-three per cent of consumers said they would be prepared to spend at least 10% more on personalised shopping online.3AI is already present at several touchpoints on the customer journey. Fashion retailers are able to incorporate AI tools to reflect the in-store experience to the online shopper. Visual search tools like Google Lens mean consumers no longer need to rely on product descriptors, but instead search with what the item actually looks like.Once the shopper has found their perfect designer dress, augmented reality (AR) try-on tools adopted by retailers can allow the shopper to ensure the right fit and style. These tools resonate well: 49% of luxury consumers think that brands using AI offer a better experience.4 But there is great potential for even more advanced uses of AI tools.Tommaso Vaccarella is co-founder and general manager at Connected-Stories, a creative personalisation platform, driven by AI. Connected-Stories uses generative AI models to optimise the ad creative production process for brands across several industry verticals, including a number of fashion brands.He says: “The industry can use generative AI models to personalise the consumer experience throughout the entire consumer journey, not just at the first touchpoint.”Consumers of luxury brands want a VIP experience — in-store they are accustomed to personal shoppers and glamorous outlets. Now, AI is helping marketers provide the same level of personalisation for their customers online.AI at the heart of e-commerce personalisationResearch shows that using generative AI tools to create personalised deals, offers, and recommendations on products has a positive impact on fashion consumers' purchase motivations. More than three in ten (31%) consumers are willing to spend up to 20% more for a brand that does this.5From the use of generative AI to craft engaging storytelling in marketing communications, to the use of AI to generate personalised ads across platforms, retailers have enhanced opportunities to connect with consumers — and drive revenue.Italian fashion retailer Benetton used browsing and purchasing data to provide personalised product recommendations to customers with Recommendations AI. They found the average spending value of customers using the tool was 7% higher, and the time spent on the site almost tripled, compared to those who did not interact with the tool.Connected-Stories is built on Google Cloud. The platform utilises machine learning models with their clients, including a number of fashion brands, to allow for ad creatives to be automated, personalised, and delivered to users in real time.Vaccarella explains: “Based on data such as consumer shopping habits and interests, the time of day, and even geolocation and weather conditions, the right audience will see the right creative ad, which has been AI generated using brands' creative guidelines such as color, tone of voice, image styles, graphics usage, and more.“For example, you might find that a certain type of backdrop on your ad r",
  "wordCount": 1407,
  "hash": "ce8303a4fca438d5"
}