{
  "url": "https://www.warc.com/content/feed/Retailers_insert_AI_into_the_customer_experience/11153",
  "title": "Retailers insert AI into the customer experience   | WARC | The FeedWARCMore search optionsMenu buttonCloseWARC",
  "snippet": "Walmart, too, has partnered with OpenAI to enable customers and members to purchase items directly from Walmart and Sam's Club through ChatGPT.",
  "domain": "warc.com",
  "extractedText": "Home The Feed Your selections: Retailers insert AI into the customer experience | WARC | The Feed The Feed Read daily effectiveness insights and the latest marketing news, curated by WARC’s editors. Category Alcoholic drinks Automotive Business & industrial Cannabis Clothing & accessories Financial services Food Household & domestic Leisure & entertainment Media & publishing Nicotine Non-profit, public sector & education Pharma & healthcare Politics Retail Soft drinks Technology & electronics Telecoms & utilities Toiletries & cosmetics Transport & tourism Location Africa (general region) Asia (general region) Australia Austria Bangladesh Belgium Brazil Bulgaria Canada Denmark Europe (general region) Finland France Germany Ghana Global Greater China Hong Kong India Indonesia Irish Republic Italy Japan Latin America (general region) Malaysia Mexico Middle East & North Africa (general region) Myanmar Netherlands New Zealand Nigeria North America (general region) Pakistan Philippines Poland Russian Federation Saudi Arabia Serbia Singapore South Africa South Korea Spain Thailand Turkey Ukraine United Kingdom United States Vietnam Clear filters You didn’t return any results. Please clear your filters. Close 21 November 2025 Retailers insert AI into the customer experience Personalisation Generative AI Customer experience Walmart and Target are deploying AI to enhance consumer-facing experiences, experimenting with the likes of conversational curation and predictive ordering. What’s happening at Target Target is partnering with leading AI platforms to enable the retailer to “curat[e] the shopping experience directly from guests’ own conversation,” COO Michael Fiddelke told an earnings call. Ahead of the holiday season, a GenAI-powered gift finder will help shoppers find the right present. “Guests tell us what they want or even what they’re trying to solve for, and OpenAI will offer personalized recommendations,” he explained. (Examples: “I have a 5-year-old son that loves dinosaurs? What gifts are available for under $20?” or “What is a good present for my mother-in-law?”) Target is also using synthetic audiences, created by AI-driven models, to enable marketing and design teams to test, learn, and refine products, promotions, and messaging before they’re launched. What’s happening at Walmart Walmart, too, has partnered with OpenAI to enable customers and members to purchase items directly from Walmart and Sam’s Club through ChatGPT. “This starts relatively simplistically with the checkout process,” CEO Doug McMillon told an earnings call. “It will become more immersive, [with] integrated and seamlessly connected experiences that bring Walmart closer to customers in new ways.” Walmart’s digital agent Sparky is being developed to take more action on behalf of customers, such as helping people think about reordering things they may want or giving “nudges about staying in stock”. In Chile, Walmart is taking this a stage further, trialling a capability (Carrito Listo) that uses customer transactional data to create predicted shopping baskets, based on the brands they normally buy at the intervals they prefer; these can then be accepted or modified. Why AI personalization matters Dispensing advice on cheap toy dinosaurs won’t recoup the billions of dollars currently being thrown at AI, but it does normalize the technology in consumers’ everyday lives. And here retailers may have an important role to play in finding a balance between what consumers want and don’t want from AI. Walmart, for example, is using AI to build a multimodal e-commerce experience that is more personalized and relevant, that understands customer intent and anticipates their needs to save them time. And for brands, “Ads will still be present,” said McMillon, “but in a more contextual and helpful way, surfacing as recommendations or sponsored bundles that add value.” Sourced from Seeking Alpha [Image: Getty] Email this content × Send colleagues a link to this content. To send to more than one recipient, put a comma between email addresses. Sender name: Sender email: Recipient name: Recipient email: Message (optional): Send me a copy of this email as well. Cancel Email",
  "wordCount": 626,
  "hash": "cfc8259efde5c425",
  "topic": "AI_and_Strategy"
}