{
  "url": "https://www.digitalcommerce360.com/2025/10/31/walmart-debuts-new-ai-features-in-its-app-for-the-holiday-season/",
  "title": "Walmart debuts new AI features in its app for the holiday season",
  "snippet": "The new AI features extend to discovery use cases and augmented reality for Walmart customers; they're scheduled to begin going live Nov. 1.",
  "domain": "digitalcommerce360.com",
  "publishedDate": "2025-10-31T18:26:38+00:00",
  "extractedText": "Walmart is watching how shoppers use AI this holiday season, and the retail giant has five new features to serve those shoppers in its mobile app. It designed the new AI tools for a range of use cases, including omnichannel, in-store and online experiences. As the features roll out on Nov. 1, Walmart is hoping to connect customers with deals and generally improve search, navigation and wish-list use. Walmart is No. 2 in the Top 2000. The database is Digital Commerce 360’s ranking of North America’s online retailers by their annual ecommerce sales. Digital Commerce 360 projects that Walmart online sales will reach $148.59 billion in 2025. Walmart is also No. 8 in the Global Online Marketplaces. That database ranks the top such marketplaces by third-party gross merchandise value (GMV). Charts & Data Walmart online sales, fulfillment efficiency guide Q3 revenue growth Abbas Haleem | Nov 21, 2025 How Walmart is using AI for the 2025 holiday season Walmart showcased five new AI features in its Oct. 31 announcement. They include: In-Store Savings, a tool to display which items are on sale at local stores. Improved search and navigation, including the ability to see an item’s location within a physical store, with visibility for items on wish lists as well. Party planning advice from Walmart’s AI assistant, Sparky. AI-generated audio summaries for product descriptions and reviews for at least 1,000 beauty products. Generative AI-powered augmented reality to visualize products in three-dimensional contexts,. One form is through Shop the Background, in which shoppers can click on items in product images to add them to carts. The other, called Dynamic Showroom, lets consumers view different spaces and swap out furnishings to match their preferences. “The most wonderful time of the year should be joyful, and with the power of AI and technology, we’re making that possible,” said Tracy Poulliot, senior vice president of shopping experiences at Walmart U.S. “Whether customers are holiday shopping in our stores or from the comfort of home, we’re giving them the tools to check off their lists quicker and easier than ever before.” Poulliot noted that when customers use Walmart’s app while shopping in stores, they spend 25% more “on average than on trips when they don’t use the app.” Growing AI use at Walmart The new AI features follow other launches in 2025 that have seen Walmart increase the scope of generative and agentic AI use across its operations. Sparky, for instance, is just one of Walmart’s four AI “super agents” that it designed to operate in specific areas and manage other, lesser agents within Walmart’s systems. The other three super agents include a Walmart associate agent, as well as Marty, an agent to help Walmart partners, and an agent that helps Walmart’s internal software developers. Do you rank in our databases? Submit your data and we’ll see where you fit in our next ranking update. Sign up Stay on top of the latest developments in the online retail industry. Sign up for a complimentary subscription to Digital Commerce 360 Retail News. Follow us on LinkedIn, X (formerly Twitter), Facebook and YouTube. Be the first to know when Digital Commerce 360 publishes news content. Favorite",
  "wordCount": 529,
  "author": "Brian Warmoth",
  "hash": "d5cd8ef4adca21ce"
}