{
  "url": "https://textiles.ncsu.edu/news/2024/06/heres-how-the-fashion-industry-is-using-ai/",
  "title": "Here’s How the Fashion Industry Is Using AI | Wilson College of TextilesMenuCloseFacebookXLinkedInemailFacebookXLinkedInInstagramYouTube",
  "snippet": "AI Chatbots: Transforming the shopping experience. Many retailers are also using generative AI as online shopping assistants, commonly known as",
  "domain": "textiles.ncsu.edu",
  "publishedDate": "2024-06-03T17:30:06+00:00",
  "extractedText": "Research and Innovation Here’s How the Fashion Industry Is Using AI June 3, 2024 Yoo-Won Olivia Min and B. Ellie Jin 6-min. read This article was originally published by members of the Wilson College of Textiles’ Fashion Textile and Business Excellence Cooperative. Nearly every industry is poised to undergo an unprecedented transformation with the introduction of artificial intelligence (AI). AI, in simple terms, refers to technology, often in the form of computer programs, designed to replicate the human brain’s ability to perform tasks and continuously improve. Generative AI, powered by deep learning algorithms, is making a significant impact on fashion brands. This advanced technology has the capacity to comprehend patterns within data and generate entirely new examples of text, images and even video (Bain, 2023). Because of its ability to create new content, the fashion industry is integrating its technology into nearly all of its processes in some way, from design and product descriptions to product recommendations and 3D design (Mcdowell, 2023a). Table 1 provides a few real-world examples of how AI is already being used in the industry. Table 1. Applications of Generative AI in the Fashion Industry CategoryHow it worksExampleFashion Design• Transforms textual descriptions or uploaded images into illustrations• Adjusts these designs before production• Cala’s tool with DALL-E technology • Tommy Hilfiger’s AI-Assisted Design Collaboration with IBM and the Fashion Institute of Technology• Project Muze by Google and ZalandoVisual Content and Marketing Imagery• Generates advertising and marketing content using given parameters or inputs • Text, images and videos are common outputs• Stitch Fix’s AI visuals• Casablanca’s Spring/Summer 2023 campaign• Revolve’s AI-driven ad campaignCopywriting• Generates copy based on keywords and instructions provided by the user • Streamlines the process of creating product descriptions, marketing emails and other written content• Adore Me’s AI optimization• Product descriptions for Search Engine Optimization (SEO)Shopping Assistants• Utilizes natural language processing to interact with customers as chatbots• Offers product recommendations and provides information• Kering’s experimental KNXT platform• Luxury personal shopper powered by ChatGPT AI in design Generative AI has the power to revolutionize fashion design. Designers can harness AI image generators like DALL-E, Midjourney or Stable Diffusion to bring their creative visions to life. Cala, a supply chain startup, was the first group to harness AI in the design creation process for fashion brands. In January 2023 it introduced a tool that allows users to describe their design ideas in text or upload images which AI will then transform into illustrations or realistic images. Users can then fine tune these designs before turning them into physical products. This tool marks a pioneering use of the DALL-E API in the fashion industry, enabling the creation of clothing, accessories, shoes and lifestyle products based on descriptions or images (OpenAI, 2022). RelatedLearn more about AI with the FTBEC In August 2024, the Wilson College of Textiles’ Fashion and Textile Business Excellence Cooperative will host AI in the Textile and Fashion Industries: an in-person conference for industry professionals.Learn more and register Apparel brands are also leveraging this technology. Tommy Hilfiger collaborated with IBM and the Fashion Institute of Technology on a project named Reimagine Retail. This initiative aimed to give retailers a competitive advantage in the speed of forecasting emerging design trends by analyzing a vast array of data from images and fabrics to colors (Saunders, 2019). While generative AI empowers designers to explore new concepts and ideas rapidly by generating various design variations, there are limitations to the technology. Manual editing and adjustments are often necessary as AI cannot turn all concepts into finished products. Concerns regarding intellectual property may also arise as some AI-generated designs could be based on copyrighted work. Legal issues in this area are still evolving, prompting brands to involve their legal teams and establish guidelines (Bain, 2023). AI in Copywriting: Efficiency and personalization Generative AI tools are serving as valuable assistants to marketing teams, streamlining the writing process for product descriptions and marketing emails. Copywriters input keywords and instructions and AI generates copy that can be edited as needed, enabling brands to produce written content more efficiently. The lingerie brand Adore Me has been using AI tools to optimize product descriptions for Search Engine Optimization (SEO) to make them more likely to appear at the top of search engine results (Mcdowell, 2023a). Adore Me and other brands using AI this way report dozens of hours in time savings. Using AI’s potential to personalize content at a one-to-one level requires businesses to",
  "wordCount": 1362,
  "author": "Wilson College Communications",
  "hash": "d8b78417e80c0e6f"
}