{
  "url": "https://www.digitalnative.tech/p/agentic-commerce-when-ai-does-the",
  "title": "Agentic Commerce: When AI Does the Shopping for You",
  "snippet": "# Agentic Commerce: When AI Does the Shopping for You. # Agentic Commerce: When AI Does the Shopping for You. One of the earliest recorded forms of commerce was cattle trade around 10,000 B.C. Cattle had a fixed value and were exchanged for goods and services. Today I want to talk about *agentic com",
  "domain": "digitalnative.tech",
  "extractedText": "Agentic Commerce: When AI Does the Shopping for YouMalls ➡️ Websites ➡️ Apps ➡️ AgentsRex WoodburyMay 28, 20256ShareWeekly writing about how technology and people intersect. By day, I’m building Daybreak to partner with early-stage founders. By night, I’m writing Digital Native about market trends and startup opportunities.If you haven’t subscribed, join 70,000+ weekly readers by subscribing here:SubscribeHey Everyone 👋,Next week is New York Tech Week. We at Daybreak are co-hosting an event on Tuesday evening with our friends at Bling. Stop by if you like tech and tacos! It would be great to meet in person—you can RSVP here. With that, let’s talk agentic commerce…Agentic Commerce: When AI Does the Shopping for YouOne of the earliest recorded forms of commerce was cattle trade around 10,000 B.C.Cattle had a fixed value and were exchanged for goods and services. The Latin word for money, pecunia, actually comes from pecus, the Latin word for cattle. Nowadays, commerce involves less cattle and more Apple Pay (more convenient, it turns out), but commerce continues to power the economy. About once a year I like to write a piece about what’s happening in commerce; recent examples: The 10 Forces Shaping Commerce (2024)The Wild West of E-Commerce (2023) Talking Shop: The Transformation of Commerce (2022) These pieces usually talk about how commerce has evolved from cattle to credit cards, and where we’re heading next. Last year, for instance, we talked about Ozempic, overstock, creator brands, and sustainable fashion. I often include some version of this chart, too: E-commerce now comprises about 15% of retail sales. That’s because this chart best summarizes the shifts in commerce over the past 30 years. Offline to online. The big disruption was happening in where we were shopping. First we were shopping in malls; then we were shopping on websites; then we were shopping in apps. But each progression still hinged on a core principle: that you were the one doing the shopping.The next overhaul in commerce, is my mind, isn’t a change in where we shop, but in who is doing the shopping. Today I want to talk about agentic commerce. I’m hearing this term more in Pre-Seed and Seed pitches, and BCV’s Scott Friend wrote a good piece last fall arguing that agentic commerce is the natural “third wave” after e-commerce (Wave 1, ushered in with the internet) and mobile (Wave 2, ushered in with the iPhone). It’s interesting to me to question what a future version of the chart above might look like. A 2025 to 2050 version might look something like this: Let’s explore what this could look like. Delegation, Delegation, DelegationWith the rise of AI agents, people are increasingly offloading the stuff they don’t want to do. At work, this means notes and memos and spreadsheets. At home, this means utility-oriented shopping. We’ll start delegating more and more to autonomous agents that understand our preferences and our constraints. What do we mean by that? What Agentic Commerce Will Look LikeIn a few years, you might be sleeping while your AI agent is shopping for your mom’s birthday gift. Your agent finds the gift, negotiates the price, and schedules delivery. This sounds a little uncomfortable: shouldn’t we be the ones putting in the time and effort for mom’s gift? The more likely winning product will build in a bit of friction, inserting moments of human control—moments of delegation. You might wake up to three options for mom’s gift; over your morning coffee, you select one, then instruct your agent to execute the purchase and arrange delivery. If we take a step back, I would broadly separate shopping into two categories: utility shopping and emotional shopping. Utility shopping is buying the stuff we have to—milk and light bulbs and trash bags. Emotional shopping is buying the stuff we want to—handbags and candles and artwork. For future products focused on utility shopping, the right KPI might be minimizing time spent. We don’t want people spending an hour a day on our site. We want you to get in and get out! Amazon is mostly in this category: the checkout experience painstakingly removes friction so that you can order paper towels in just a few seconds. This is why Amazon put a patent on 1-click checkout. For future products focused on emotional shopping, the right KPI might be maximizing time spent. Here, we want people browsing and perusing and discovering new stuff. The best old-school example might be the shopping mall. A more recent example could be something like LTK. A company like Pinterest should have dominated this form of shopping, but never really nailed commerce. Shopping malls are a good example of more discovery-driven, serendipitous shoppingWhen I think about AI innovation in shopping, I think about utility vs. emotional. On the utility side, we’ll have agents that do the dirty work. They hunt for good deals. They re-order our toilet paper. They know mom’s birthday is coming up, and they’re ready to go with a s",
  "wordCount": 1857,
  "author": "Rex Woodbury",
  "hash": "e17f05d3e8c5e219"
}