{
  "url": "https://www.edgardunn.com/articles/agentic-commerce-declared-the-next-big-shift",
  "title": "AI Agents & Agentic Commerce: Key Insights from PLS 2025",
  "snippet": "There were several lively discussions with merchants at Payment Leaders’ Summit (PLS) in Amsterdam which illuminated the sector’s latest challenges and opportunities with Artificial Intelligence (AI) and agentic commerce. When consumers use autonomous digital assistants, or AI agents, to search for ",
  "domain": "edgardunn.com",
  "extractedText": "Merchants attending PLS in Amsterdam see AI-driven shopping as a long-term game changerThere were several lively discussions with merchants at Payment Leaders’ Summit (PLS) in Amsterdam which illuminated the sector’s latest challenges and opportunities with Artificial Intelligence (AI) and agentic commerce. The event brought together key stakeholders from retail, hospitality, and e-commerce, and opened with candid exchanges around the evolving payment preferences of consumers, growing demand for secure omnichannel solutions, and merchants’ strategies for navigating regulatory changes. These are the customary topics of many of the PLS events. However, this year, there was a consensus reached on the urgent need for closer collaboration between solution providers and merchants to drive seamless, customer-centric innovation in the rapidly changing AI landscape.It was described during the many merchant roundtables that AI in retailing refers to the use of artificial intelligence technologies, such as machine learning and automation, to optimize retail operations, payment optimisation, enhancing personalised customer experiences, and improving decision-making based on data and predictive analytics in fraud prevention. Speaking with merchants, it was discovered that some of them are already receiving requests from AI agents. Around 30% of merchants expect to receive traffic from AI agents within the next six months and 60% of merchants expect to receive traffic from AI agents within the next 12 months. Admittedly, this was not a robust or scientific survey, nevertheless it was based on conversations with over 20 merchant attendees from a wide selection of sectors – including, OTAs, airlines, hotels, and fashion and general merchandise retailers. Security vs. AI fraudWhen consumers use autonomous digital assistants, or AI agents, to search for products, compare offers, and make purchases on their behalf, it requires the merchant’s storefront, product data, APIs, and checkout flows to be optimised for AI agent-driven transactions. An important question was raised – what about strong customer authentication (SCA)? In agentic commerce, SCA is expected to be managed through a combination of tokenization, unique agent-customer interaction, and adaptive security protocols. Many of the merchants at the PLS didn’t know how AI agents use secure payment tokens or were simply unprepared for AI agents. Network tokens, generated and maintained by the international card schemes, link a specific agent to a customer, ensuring every transaction is both authenticated and authorized, with methods such as biometrics, passkeys, or one-time passwords adding further validation before purchase. It was acknowledged that fraudsters exploiting AI agents to use real customers’ payment methods or Alternative Payment Methods outside the card scheme’s secure ecosystem pose a serious threat. What is the solution? No merchant at the PLS had a solution, only the expectation that AI agents will allow another route for the fraudsters to gain access and their fraud prevention measures need to be prepared.Within Edgar, Dunn & Company’s Retail & Hospitality Practice it is expected that AI Agents may have to be registered and verified, using processes like “Know Your Customer” (KYC) for businesses – it will be effectively a KYA protocol - “Know Your Agent”. This will ensure only legitimate, traceable parties are permitted to transact. Any AI agent acting on behalf of a consumer must be authenticated and tied to a specific customer, making unauthorised agent behaviour easier to spot and block. The card scheme networks and Alternative Payment Methods are increasingly using tokenization, linking tokens not just to payment credentials but also AI agent identity, device characteristics, and real-time metadata. This makes stolen tokens or payment credentials much harder for fraudsters to use without matching agent and transaction context.Transactions from AI agents will trigger continuous identity verification (e.g., biometrics, passkeys, dynamic risk scoring) and real-time monitoring of agent behaviour, device usage, and spending patterns. Unlike static checks, these dynamic protocols are expected to catch anomalies that reveal fraudulent use even for payments outside the card rails. However, can an AI complete a biometric check? AI-driven systems now perform biometric authentication, such as facial recognition, fingerprint, iris, and voice verification, by analysing biometric data, and confirming user identity for payment authorisation. Consequently, the fraudsters are expected to use the same AI tools to emulate biometric security seen in the payment industry. This was a serious concern amongst the merchants participating in several of the PLS roundtables. Model Context Protocol (MCP) the communication standard for AIMCP (Model Context Protocol) in agentic commerce serves as a standardised integration layer or protocol that enables AI agents to securely int",
  "wordCount": 1391,
  "hash": "e5269d0cba7d487b"
}