{
  "url": "https://re-tech.io/blog/retail-tech-news/last-month-in-retail-tech-ai-takes-over-retail/",
  "title": "Last Month in Retail Tech : AI Takes Over Retail > Re:Tech",
  "snippet": "Walmart launches in-store assistants that manage your shopping experience. Last week in Walmart stores felt like a glimpse into the future:",
  "domain": "re-tech.io",
  "publishedDate": "2025-08-07T11:57:24+00:00",
  "extractedText": "Home Re:Tech Disrupt Corporates Startups Technology Blog About Contact Home Re:Tech Disrupt Corporates Startups Technology Blog About Contact Yael Kochman August 7, 2025 Last Month in Retail Tech : AI Takes Over Retail Home BlogLast Month in Retail… 2025 is the year when the line between physical and digital stores is disappearing.Technologies like artificial intelligence, augmented reality, and smart automation are changing the way we shop- faster than we imagined.Retailers who have already embraced innovation are reporting dramatic sales increases, while traditional brands are discovering that customers expect more from every interaction.The race is not just for technology, but for an experience that feels personal, precise, and immediate.The market is boiling, customers are curious, and the future? It looks like a movie. So, for our new Monthly Segment: “Last Month in Retail Tech ”We selected 7 hot and fascinating articles to update you on everything interesting, surprising, and innovative in the world of retail tech. Enjoy! Global-e acquires ReturnGo in bid to tackle e-commerce’s costliest pain point ReturnGO, the Israeli start‑up that enables online stores to manage returns and exchanges in a smart and efficient way, has been acquired by Global‑e, one of the largest and most successful e‑commerce companies to emerge from Israel.Since its founding, ReturnGO has set out to make the returns experience simple, fast, and even intelligent- for both shoppers and merchants. Led by Aviad Raz, Eyal Rosenthal, and Hila Katz, the team built an AI‑powered platform that has become an important part of the global e‑commerce ecosystem. Global‑e, which serves brands like Adidas, Marc Jacobs, and Ralph Lauren, recognized the potential and decided to welcome ReturnGO into its family.This is more than just a deal – it’s proof that Israeli technology addressing real‑world challenges can make a global impact. Congratulations to the entire ReturnGO team, the investors, and the leadership at Global‑e . This exit is a true win for the Israeli retail‑tech community! Credit: Photo- Tomer Shalom Walmart launches in-store assistants that manage your shopping experience Last week in Walmart stores felt like a glimpse into the future:Customers walking into the store were greeted by their new “assistant” , a smart robot that guided them through the aisles, suggested personalized products, and directed them to the checkout quickly.Some of these robots even remembered customers’ preferences from previous visits, offered attractive promotions, and turned shopping into an experiential journey rather than a daily chore.By the end of the week, Walmart reported that the new pilot sparked enormous curiosity, with customers sharing videos on social media about how the robots helped them discover products they didn’t even know they were looking for. In the retail world, the launch of Walmart’s robotic shopping assistants signals a shift from passive shopping to a real-time smart, personalized experience. credit: Justin Sullivan/Getty Images Amazon acquires Bee – so you can remember everything from your day Bee’s vision sounds like science fiction come true: a wristband that feels like a personal assistant that’s always with you, understands you, and sometimes even knows what to do before you ask.The company emphasizes privacy: no voice recordings are saved, only the transcriptions, and users retain full control over their data. Imagine entering a world where your personal assistant lives on your wrist.This week, Amazon acquired Bee, an innovative startup that developed a smart $50 AI wristband with a $19 monthly subscription.This device doesn’t just sit there ,it listens to your conversations throughout the day, transcribes them in real time, and provides smart summaries, task lists, and instant reminders. Amazon sees this as the next step in a world where your personal assistant doesn’t live in your pocket or on your desk , it lives with you, on your wrist, and is ready to act at any moment. Octup Raises $12M to Bring AI‑Powered Order and Efficiency to the World of 3PL Logistics Behind every online purchase you make a shirt, a gadget, or a pair of shoes – there’s a massive logistics chain. Your package doesn’t just “jump” to your doorstep: it passes through warehouses, management systems, shipping providers, and often multiple third‑party logistics companies (3PLs).The problem is that this world still relies heavily on fragmented systems and spreadsheets, leading to delays, mistakes, and unnecessary costs.This is where Octup comes in.The Israeli startup built a smart platform that connects all this information- from warehouse to delivery and manages it in real time with AI.The result : fewer errors, faster deliveries, and brands that can offer a much better customer experience. Lowe’s brings AI into its stores – almost “reading your mind” Imagine walking into a Lowe’s store and feeling like it’s alive and aware of you.Over the last week, the ",
  "wordCount": 1526,
  "author": "   Yael KochmanCEO at Re:TechYael Kochman is the CEO at Re:Tech, a retail technology innovation hub helping brands and retailers worldwide to foster innovation at scale. She is also the GM of Syte by Nayax, a discovery and personalization platform foe retail. ",
  "hash": "ebb086cabb95772c"
}