{
  "url": "https://link.springer.com/article/10.1007/s00146-025-02781-1",
  "title": "Strategic use of generative AI in fashion collections: from creation to promotion | AI & SOCIETY | Springer Nature Link",
  "snippet": "These innovations streamline e-commerce and reduce returns, connecting creative design with technological precision and sustainability goals.",
  "domain": "link.springer.com",
  "publishedDate": "2026-01-16",
  "extractedText": "Home AI & SOCIETY Article Strategic use of generative AI in fashion collections: from creation to promotion Review Published: 16 January 2026 (2026) Cite this article Save article View saved research AI & SOCIETY Aims and scope Submit manuscript Thaissa Schneider1, Cristiani Maximiliano1, Laura Pedri Pereira1, Doris Treptow2 & …Samuel Levi Araújo Alves1 Show authors AbstractThis study investigates the strategic application of generative artificial intelligence (GenAI) tools in fashion collection development, examining how AI can enhance creative processes while maintaining design authenticity. The research addresses the gap between technical AI capabilities and their practical implementation in fashion design methodologies. Using Treptow’s (Inventando moda: planejamento de colecao, 5th edn. D. Treptow, São Paulo, 2013) four-stage fashion collection development framework (Planning, Design, Development, and Promotion/Commercialization), this experimental study employed structured prompt engineering with Claude 3.5 Sonnet, ChatGPT-4o mini, and DALL·E to simulate luxury beachwear collection development. Multiple AI illustrative personas were created to represent different professional roles, generating outputs for trend research, design alternatives, visual development, prototype approval, and marketing strategies. A qualitative analysis examined the effectiveness and limitations of AI integration across each development phase. Results demonstrate that well-crafted prompts can effectively guide AI tools to produce relevant design concepts, trend analyses, and marketing strategies that align with traditional fashion development processes. However, significant limitations emerged in visual consistency and collection cohesion, particularly in comprehensive design visualization. The study reveals that AI functions most effectively as a creative amplifier rather than a replacement, requiring substantial human oversight for maintaining design integrity and brand authenticity. The findings have implications for fashion education, suggesting the need for AI literacy integration in design curricula. Fashion professionals can leverage structured prompt engineering to accelerate ideation, trend research, and marketing development while maintaining creative control. This research contributes the first systematic framework for applying GenAI across the complete fashion collection development cycle, providing empirical evidence of AI’s capabilities and constraints in creative fashion processes. This is a preview of subscription content, log in via an institution to check access. Access this article Log in via an institution Subscribe and save Springer+ from €37.37 /Month Starting from 10 chapters or articles per month Access and download chapters and articles from more than 300k books and 2,500 journals Cancel anytime View plans Buy Now Buy article PDF 39,95 € Price includes VAT (Denmark) Instant access to the full article PDF. Institutional subscriptions Similar content being viewed by others Fashion Artistry Unleashed by Artificial Intelligence (AI) Ingenuity: The Alchemy of Design Chapter © 2024 Case Study: Evaluating the Usefulness of Various AI Tools in Fashion Design Chapter © 2025 The Research and Design of an AIGC Empowered Fashion Design Product Chapter © 2024 Data availability No datasets were generated or analysed during the current study. AbbreviationsAI: Artificial intelligence CAD: Computer-aided design GAN: Generative adversarial network GenAI: Generative AI PET: Polyethylene terephthalate RFID: Radio frequency identification UV: Ultraviolet ReferencesAhmed F, Shubeck K, Hu X (2023) ChatGPT in the generalized intelligent framework for tutoring. In: Sinatra AM (ed) Proceedings of the 11th Annual Generalized Intelligent Framework for Tutoring (GIFT) Users Symposium (GIFTSym11). US Army Combat Capabilities Development Command—Soldier CenterAkpan IJ, Kobara YM, Owolabi J, Akpan AA, Offodile OF (2025) Conversational and generative artificial intelligence and human–chatbot interaction in education and research. Int Trans Oper Res 32(4):1251–1281. https://doi.org/10.1111/itor.13195Article Google Scholar Albishri AA, Almisbahi RM (2024) The role of Artificial Intelligence in fashion design. Adv Soc Sci Res J 11(8):410–427. https://doi.org/10.14738/assrj.118.17514Article Google Scholar Awad E et al (2022) Computational ethics. Trends Cogn Sci 26(5):388–405. https://doi.org/10.1016/j.tics.2022.02.009Article Google Scholar Bain M (2024) After months of designing with AI, Norma Kamali isn’t looking back. Business of Fashion, Technology. https://www.businessoffashion.com/articles/technology/after-months-of-designing-with-ai-norma-kamali-isnt-looking-back/Baxter M (2011) Projeto de produto: guia prático para o design de novos produtos. Blucher, São Paulo Google Scholar Choi W, Jang S, Kim HY et al (2023) Developing an AI-based automated fashion design system: reflecting the work process of fashion designers. Fashion Text 10",
  "wordCount": 1431,
  "hash": "ecc3345b73ce9ffd"
}