{
  "url": "https://www.reddit.com/r/ecommerce/comments/1o5v0f4/ecommerce_industry_news_recap_week_of_oct_13th/",
  "title": "Reddit - The heart of the internet",
  "snippet": "The tools, which include Audience Agent, Journey Agent, and Data Insights Agent, analyze customer data to identify key decision-makers, automate",
  "domain": "reddit.com",
  "extractedText": "Go to ecommerce r/ecommerce • adventurepaul E-commerce Industry News Recap 🔥 Week of Oct 13th, 2025 Hi r/ecommerce - I'm Paul and I follow the e-commerce industry closely for my Shopifreaks E-commerce Newsletter. Every week for the past 4 years I've posted a summary recap of the week's top stories on this subreddit, which I cover in depth with sources in the full edition. Let's dive in to this week's top e-commerce news... STAT OF THE WEEK: OpenAI's new Sora app was downloaded over one million times in less than five days, even faster than ChatGPT hit the milestone despite only being available in North America and by invitation only. The app is now #1 in Photo & Video on the Apple App store, but unfortunately it's only got a 2.8 star rating out of 3,500 reviews, with many users complaining about its guardrails being too restrictive. On Thursday, China issued new export restrictions on rare earth elements and minerals, adding five new elements and extra scrutiny for semiconductor users and dozens of pieces of refining technology to its control list. On Friday, Trump said he will impose an additional 100% tariff on imports from China, as well as impose export controls on “any and all critical software” starting Nov 1st, in retaliation of China's new export restrictions. Following the news on Friday, the S&P 500 dropped 2.7%, the Dow Jones Industrial Average 1.8% and the Nasdaq Composite dropped 3.6%. It also sparked a massive $18.28B cryptocurrency sell-off late Friday, which is the largest liquidation event in crypto history. On Sunday, China defended its new rare earth export controls, which began on Oct 9th, explaining that the measures are “designed to better safeguard world peace and regional stability\" and called Trump's plan to impose another 100% tariff a \"classic case of double standards.\" Beijing later said that it doesn't want a tariff war, but it's ready for one. Etsy is overhauling its Insider buyer membership program, replacing its ambitious free shipping benefits with a 5% Etsy credit on purchases starting November 4th. The credits, which cap at $2,000 earned, do not expire as long as you continue paying the annual membership fee. Etsy will cover up to $6 in shipping costs on the least expensive U.S. domestic shipping option for orders over $15, with the buyer paying the difference. (Previously, Etsy covered up to $20 worth of shipping for all Insider orders.) Etsy's Chief Growth Officer said that the first version of Etsy Insiders \"didn't provide scalable economics.\" Who could've predicted that? PayPal launched Ads Manager, a new way for small businesses to earn revenue from their websites through display advertising. They are marketing it very strangely, claiming PayPal Ads Manager allows small businesses \"to become their own retail media networks and generate new revenue streams\" -- but in actuality PayPal is the one launching a retail media network .Small businesses are simply being given a new opportunity to display ads on their website from PayPal — instead of Amazon, Google, Taboola, Mediavine, etc. Despite the odd positinoing, I think it's reat that they're doing this because I support competition in the retail media ad space, and with PayPal's extensive transaction graph, its retail media network has the ability to spend advertiser dollars effectively with highly targeted advertisements, assuming they can get enough businesses on board as publishers to create a network effect. Last week at OpenAI's annual developer conference, DevDay, the company unveiled new products, partnerships, and platform upgrades aimed at transforming ChatGPT from a single product into a full operating system for AI applications. Highlights include the release of GPT-5 Pro and the introduction of ChatGPT Apps, which let developers build interactive experiences directly inside ChatGPT conversations, such as booking travel, managing spreadsheets, or shopping online. A new ChatGPT App Store will allow developers to distribute and monetize their creations. The launch follows its previous attempts to let developers build interactive applications through its GPT Store, however, this new launch puts apps directly in ChatGPT’s responses and lets users call up third-party tools in their everyday conversations. For example, users can now say “Zillow, find me 5 bed 4 bath houses in Waynesville NC for under $1M” to call up the Zillow app. Last week, three major BNPL providers entered the race to make their installment payments a native part of the agentic shopping experience. Affirm and Klarna announced that they are both supporting Google’s Agent Payments Protocol (AP2), an open-source, payment-agnostic framework designed to enable agent-led payments across platforms. The collaboration allows AI-powered agents to offer pay-over-time options within automated transactions. Splitit introduced its Agentic Commerce Partner Program, an invite-only pilot aimed at embedding installment payments directly into AI shopping agents. ",
  "wordCount": 4715,
  "hash": "f392c80e0d7dffba",
  "topic": "AI_and_Strategy"
}