{
  "url": "https://hypebeast.com/2026/1/saks-global-bankruptcy-multi-million-dollar-debt-chanel-kering-news",
  "title": "Saks Global Bankruptcy Reveals Multi-Million Dollar Debts to Luxury Icons, Chanel, Kering and More | Hypebeast",
  "extractedAt": "2026-01-18T17:43:58.889Z",
  "wordCount": 436,
  "text": "1 of 2 Smith Collection/Gado/Getty Images 2 of 2 Smith Collection/Gado/Getty Images Entertainment Jan 15, 2026 789 Views 0 CommentsComments Save Summary Saks Global’s bankruptcy filing reveals over $700 million USD in debt owed to its largest unsecured creditors, with iconic luxury houses like Chanel ($136 million USD) and Kering ($60 million USD) topping the list The financial instability is particularly devastating for smaller, independent designers, many of whom rely on the retailer for nearly half of their total business and are currently facing millions in unpaid vendor claims Despite the massive liabilities, major brands are expected to continue working with the company under its new $1.75 billion USD financing plan, as Saks remains a critical, high-volume distribution channel for the American luxury market The financial fallout of Saks Global’s Chapter 11 filing has laid bare a staggering “who’s who” of debt within the fashion industry. Court documents from the Texas bankruptcy proceedings reveal that the retail giant—parent company to Saks Fifth Avenue, Neiman Marcus and Bergdorf Goodman — owes its top 30 unsecured creditors more than $700 million USD , with total liabilities estimated between $1 billion USD and $10 billion USD. At the top of the list is Chanel, which is owed a massive $136 million USD. Other luxury powerhouses facing significant exposure include Kering (Gucci, Balenciaga) at $60 million USD, Capri Holdings (Michael Kors, Jimmy Choo) at $33.3 million USD, and LVMH (Louis Vuitton, Dior) at $26 million USD. The list extends beyond apparel to include Christian Louboutin ($21.5 million USD) and The Estée Lauder Companies ($16 million USD). For many brands, the central concern is the recovery of these funds. In bankruptcy proceedings, unsecured creditors typically sit at the end of the repayment line. While major conglomerates can often weather such losses, industry experts warn of “extreme hardship” for smaller, independent designers who may rely on Saks Global for up to 50% of their total business. Despite the debt, many brands are expected to continue shipping goods to maintain their market presence, buoyed by Saks’ recent $1.75 billion USD in new financing intended to stabilize operations and ensure future vendor payments. Read Full Article Related Stories >Richemont Defies Market Headwinds with Record-Breaking $7.4 Billion USD Quarter >SOSHIOTSUKI Makes Pitti Debut & Saks Global Files Bankruptcy in This Week's Top Fashion News >Hans Zimmer to Score HBO's 'Harry Potter' Series We got you covered. Don’t miss out on the latest news by signing up for our newsletters. Subscribe By subscribing, you agree to our Terms of Use and Privacy Policy. Text By Joyce Li Source Reuters Share this article In this Article ChanelBurberrySaks",
  "status": "success"
}