{
  "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/in-a-cooling-job-market-ai-pros-still-hold-the-cards/articleshow/126624727.cms",
  "title": "In a cooling job market, AI pros still hold the cards - The Economic Times",
  "extractedAt": "2026-01-18T17:43:58.817Z",
  "wordCount": 823,
  "text": "SynopsisAI professionals are getting not just multiple offers but also counter-offers from existing employers and big incentives. New job offers and counteroffers currently come with 25-70% pay hikes for AI professionals, executives at search firms and recruitment services firms said. This trend is only going to get stronger in 2026, they told ET.Listen to this article in summarized format ListenFrom ESOPs to paid research leaves to sabbaticals, cos leaving no stone unturnedSitting on multiple job offers may be a thing of the past for most technology professionals, but not so for artificial intelligence talent.AI professionals are getting not just multiple offers but also counter-offers from existing employers and big incentives. New job offers and counteroffers currently come with 25-70% pay hikes for AI professionals, executives at search firms and recruitment services firms said. This trend is only going to get stronger in 2026, they told ET.Apart from direct monetary benefits, companies are offering stock options along with fast vesting, paid research leaves, sabbaticals, project-choice or mentorship privileges, relocation allowance and family support to entice experienced AI talent that is in short supply. Some candidates are also offered founder-style packages that often include outcome-linked bonuses among other perks.\"We are seeing a very strong demand for mid- and senior-level AI professionals, especially in areas such as GenAI, data science and AI engineering,\" CIEL HR chief executive Aditya Mishra said. \"Competition is intense and candidates are often holding multiple offers.\"A senior engineer in GenAI with six years of experience was offered a package of around Rs 40 lakh, at a 33% hike. He declined, as he had received a 61% hike from a rival tech company, Mishra said, underscoring the demand.ETtech Many candidates are not just looking at higher pay, but also flexibility options.Another executive at a recruitment services company running a mandate for an IT services firm said a few months ago it offered a 35% hike to a senior data scientist with 11 years of experience. \"But he chose to drop out of the process when he got another role with a 50% hike, along with the flexibility of working from home, compared to a strict five-day office policy in the earlier offer,\" the executive said on the condition of anonymity.The typical range for counteroffers is 25-55% for senior AI talent, said Ratna Gupta, senior partner at executive search firm ABC Consultants. \"But for critical hires or leadership mandates, they can even exceed 70%.\"In some high-profile cases, CEOs of midsize to large tech firms are personally engaging in recruiting top AI talent, said an executive at a search firm.In the broader tech industry, offer reneging, which was very frequent immediately after the pandemic, started cooling from mid-to-late 2024, as hiring slowed and budgets became tighter, Gupta said.But AI talent is a different story. Instances of candidates rejecting offers are more prevalent and rising, too.According to Gupta of ABC, there is a war out there for AI talent, and companies are ready to go out of the way to hire the right people. \"Factors beyond salary, like remote work, equity and project ownership, are often decisive. If an offer does not check these boxes, candidates don't hesitate to walk away,\" she said.This demand is coming from not only big technology firms, but also from midsize to small IT firms, startups and even conglomerates.\"Startups and midsize companies are offering aggressive 'founder-style' packages for senior AI talent,\" said an expert.\"AI is an outlier (when compared to traditional tech roles) with over 60% hikes,\" said Pranshu Upadhyay, head of India technology practice at recruitment firm Michael Page.According to him, many AI professionals are not only sitting on multiple offers but also have aggressive counteroffers from their current companies.\"With the same level of experience, say 10-plus years, there could be a huge difference in pay packages of someone with traditional tech skills (like Rs 50 lakh per annum) vs someone with AI skills (over Rs 1.3 crore),\" Upadhyay said. Add as a Reliable and Trusted News Source Add Now!Read more news onAI professionalsjob marketdata scienceCIEL HRtech industry hiringGenAIABC Consultantspay hikes for AI professionals(Catch all the Technology News News, and Latest News Updates on The Economic Times.)...moreAdd CommentElevate your knowledge and leadership skills at a cost cheaper than your daily tea.Market is gung-ho about digital, but why are MF schemes failingWhat Paytm, Ola and FirstCry stumbles say about founder hubris of conglomerate playDisclosing AI revenue: Finding a best practice between Accenture’s U-turn and TCS debutA glitch, a quick fortune: How a small-town trader got the better of a D-Street giantFIIs move beyond AI to emerging markets, but why India remains on sidelinesStock Radar: Coal India stock breaks out from Ascending Triangle range to hit fresh 52-week high in January 2026; time to buy?Power stocks: Domestic story gets global tailwind? 8 power stocks from different segments with upside potential of up to 32%Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 36%Subscribe Now",
  "status": "success"
}