{
  "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/chatgpts-free-ride-is-ending-heres-what-openai-plans-for-advertising-on-the-chatbot/articleshow/126615812.cms",
  "title": "ChatGPT's free ride is ending: Here's what OpenAI plans for advertising on the chatbot - The Economic Times",
  "extractedAt": "2026-01-18T17:43:58.817Z",
  "wordCount": 354,
  "text": "SynopsisOpenAI says it will soon start showing advertisements to ChatGPT users who aren't paying for a premium version of the chatbot. The artificial intelligence company said Friday it hasn't yet rolled out ads but will start testing them in the coming weeks.APFILE - The OpenAI logo is displayed on a mobile phone in front of a computer screen with output from ChatGPT, March 21, 2023, in Boston. (AP Photo/Michael Dwyer, File)OpenAI says it will soon start showing advertisements to ChatGPT users who aren't paying for a premium version of the chatbot.The artificial intelligence company said Friday it hasn't yet rolled out ads but will start testing them in the coming weeks.It's the latest effort by the San Francisco-based company to make money from ChatGPT's more than 800 million users, most of whom get it for free. Though valued at $500 billion, the startup loses more money than it makes and has been looking for ways to turn a profit.OpenAI said the digital ads will appear at the bottom of ChatGPT's answers \"when there's a relevant sponsored product or service based on your current conversation.\" The ads \"will be clearly labeled and separated from the organic answer,\" the company said. Add as a Reliable and Trusted News Source Add Now!Read more news onOpenAI advertisingChatGPT adsfree ChatGPTChatGPT premium versiondigital ads on ChatGPTOpenAI profitChatGPT user basesponsored products ChatGPTOpenAIChatGPT update(Catch all the Technology News News, and Latest News Updates on The Economic Times.)...moreAdd CommentElevate your knowledge and leadership skills at a cost cheaper than your daily tea.Why Warren Buffett won't invest in SIPsHow a mom & pop Madurai jeweller built INR12.5k cr empireWhy high economic growth rate doesn’t translate into high stock returnsAs AI takes centre stage, a behind-the-scenes tech is quietly powering the boomTax shock looms, but ITC’s bigger worry is losing market share to Godfrey PhillipsWeekly Top Picks: These stocks scored 10 on 10 on Stock Reports PlusThese large- and mid-cap stocks can give more than 25% return in 1 year, according to analystsTwo Trades for Today: A top steel tube maker for a 4.65% gain, a large-cap private bank stock for a 6.3% upmoveSubscribe Now",
  "status": "success"
}