{
  "url": "https://economictimes.indiatimes.com/tech/artificial-intelligence/ai-adoption-outpaces-training-71-professionals-expect-role-changes-report/articleshow/126640163.cms",
  "title": "AI adoption outpaces training; 71% professionals expect role changes: Report - The Economic Times",
  "extractedAt": "2026-01-18T17:43:58.757Z",
  "wordCount": 595,
  "text": "SynopsisArtificial Intelligence is rapidly changing workplaces. Many professionals expect their jobs to evolve significantly in the coming years due to AI. However, a large number feel their companies are not providing adequate training on AI tools. This lack of guidance leads to uncertainty about AI's role.Artificial Intelligence (AI) adoption at workplaces is outpacing corporate training programmes, with 71 per cent of professionals believing their roles will change over the next few years as new tools and workflows become mainstream, according to a report.There is a sharp gap between AI adoption and training, as employees brace for rapidly evolving job responsibilities, the report by Genius HRTech said.The Genius HRTech and Digipoll report is based on an online survey conducted among 1,704 professionals across sectors in November 2025.One of the clearest gaps identified by the report is training, with a substantial 61 per cent of respondents saying their organisation has not provided adequate guidance on effective AI usage, while only 37 per cent reported receiving proper training.This lack of structured support appears to influence how employees perceive AI adoption within their functions, as 55 per cent believe AI adoption is driven by necessity, whereas 37 per cent feel it is trend-driven rather than need-based, the report said.It also found a deeper shift in workforce expectations, with 71 per cent of respondents believing that their role or responsibilities will significantly change in the next 2-3 years due to AI integration, reflecting both anticipation and uncertainty.According to the report, 67 per cent of respondents have already started using AI tools to simplify or automate their daily work, showing how quickly the technology is being adopted across roles.This shift isn't completely smooth, as 69 per cent of respondents said that AI has made their work processes simpler, but 25 per cent felt it has added complexity, suggesting that even though AI cuts down on repetitive tasks, it can also create new challenges for some employees, the report showed.Trust remains a significant barrier, with only 49 per cent of professionals saying that they trust AI-generated insights without manual cross-verification, 36 per cent do not trust them, and 15 per cent argued that trust varies depending on the task.\"AI is no longer a distant concept, but it's now shaping daily workflows across industries. While professionals value the efficiency it brings, they also expect companies to equip them with the right training and clarity. The future workplace will thrive only when human intelligence and AI complement each other, not compete,\" Genius HRTech chairman and managing director RP Yadav said. Add as a Reliable and Trusted News Source Add Now!Read more news onGenius HRTechAI adoptionworkplace AI integrationcorporate trainingAI role changeswork process automationAI tools usageprofessional expectationsAI trust issuesemployee training(Catch all the Technology News News, and Latest News Updates on The Economic Times.)...moreAdd CommentElevate your knowledge and leadership skills at a cost cheaper than your daily tea.Market is gung-ho about digital, but why are MF schemes failingWhat Paytm, Ola and FirstCry stumbles say about founder hubris of conglomerate playDisclosing AI revenue: Finding a best practice between Accenture’s U-turn and TCS debutA glitch, a quick fortune: How a small-town trader got the better of a D-Street giantFIIs move beyond AI to emerging markets, but why India remains on sidelinesStock Radar: Coal India stock breaks out from Ascending Triangle range to hit fresh 52-week high in January 2026; time to buy?Power stocks: Domestic story gets global tailwind? 8 power stocks from different segments with upside potential of up to 32%Stock picks of the week: 5 stocks with consistent score improvement and upside potential of up to 36%Subscribe Now",
  "status": "success"
}