{
  "url": "https://instoremag.com/how-to-sell-colored-gemstones-retailers-tell-the-story/",
  "title": "How to Sell Colored Gemstones: 33 Retailers Share How They Do It",
  "extractedAt": "2026-01-18T17:43:58.924Z",
  "wordCount": 2128,
  "text": "New Arrivals How to Sell Colored Gemstones: 33 Retailers Share How They Do It It’s part gemology, part folklore, and part theater. Here’s how the pros do it. Published 25 seconds ago on January 17, 2026 By INSTORE Staff Instore February 2026 Issue For many retailers, the key to selling colored gemstones is telling a compelling story. IMAGE: GENERATED BY GOOGLE NANO BANANA Share Tweet SELLING COLORED GEMSTONES requires a different approach than diamonds. The key, according to many of our Brain Squad jewelers, is storytelling — whether it’s the folklore behind amethyst, the origin of a Montana sapphire or why an emerald’s inclusions are called a “jardin.” Here’s how retailers across the country are making color sell. “I could never sell a white diamond with a straight face. I never saw the value, but a color gem will make me feel punched in the throat with its beauty, and make me cry. When you feel like that about a product it is so easy to sell. Montana sapphire in teal blue-green and oval cut was the single most requested gem this past year. I even had one client who thought ‘Montana’ meant teal color sapphire, not actually Montana Montana!” — Jo G., Oconomowoc, WI The Secret to Selling Colored Gemstones? Tell a Great Story “First of all, everyone responds to the birthstone angle! In addition, read George Kunz: The Lore of Gemstones; it’s full of interesting stories about propitious gems and I have many other books on gems’ attributes that are handy in our waiting area, people devour them! Also, I tell stories, about famous gems, like La Peregrina, or about where they are mined, or how emeralds are colored by two elements, chrome and vanadium, that don’t like each other, so they fight, giving the lovely gem many fractures. But, I go on to say, with emeralds, this becomes a feature: ‘Your emerald has a lovely jardin, Madame!’ Jardin is French for garden, meaning: your emerald is full of stuff! Humor also sells, as it relaxes tension about buying something you may not know. I always honor gems as the treasures of the earth. We tell customers: a gem mine is not like a coal mine; it can be just a small seam in the ground. That is why it is so difficult to match them. When we find a match, we celebrate! It is like a wedding! I also tell them about phenomenal stones. We end up selling a lot of them, particularly because we pair them with appropriate color of metal, like blue-green opals: 18k brushed green gold sets them off uniquely! We show how a moonstone looks with and without a dark background, and let them choose. Having agency helps!” — Eve A., Evanston, IL “I always talk about the color! This is a great time to use an evocative vocabulary whether it’s the mysterious hue of a rare gray spinel that gives up flashes of blue and lavender, or the rich velvety nature of a fine blue sapphire, talk about the color, and then other attributes like its versatility (blues) to standout perfection of unusual shade choice. Talk about why you like the color. Then, I often mention locality. Listen. Answer questions — allow the stones to speak.” — Ellie T., Chicago, IL “Know the stone’s lore and have fun with it. Like how wearing amethyst prevents drunkenness. See Sally over there? She puts on an amethyst ring every day when she goes to lunch.” — Kirk G., Gonzales, TX “A story, you need a story, to sell them. Be it of legend or lore, the beauty in the color, the rarity and place of origin. Natural diamonds are rare and special but natural color is more uniquely individual. Each wearer, each client will respond differently. Be prepared!” — Mark & Monika C., Rockford, IL “Everyone sells the big three: emeralds, rubies and sapphires. If you want to set yourself apart from your competition, choose more unique gems. Tourmalines, spinels and zircons give you more variety in color and price.” — Dianna H., Lafayette, LA “There are two types of colored stone buyers, primarily women: those who like color but are conservative and will buy small to medium size pieces often in sets. Then there are women who love color and dress less conservatively who want to make a special higher-end colored stone piece the center of attention. It is good to target market both of these demographics.” — Dorothy V., Tallahassee, FL Advertisement “The first step is to know the provenance of the stones as well as if they are heated or treated. Second is equally important — to know if hardness and density of the stone will match the lifestyle of the customer. Once all the factors are considered, it is the emotional response that makes the final decision.” — Betsy B., San Francisco, CA “Colored gemstone jewelry is for the bold woman who loves to stand out! It’s for the woman who doesn’t want to be matchy-matchy in her style but lets the color speak for itself.” — Angela C., Atascadero, CA “Stand out! Have something unique. I sell earrings and necklaces that I make with gemstone beads. Unusual and uncommon stones sell well. Semiprecious, organic looking styles. Tourmaline in all colors. Vibrant colors and always blue.” — Monica L., Fond du Lac, WI “Show your clients boxes of coloured gemstones. Let them play with the stones. There is more to life than colourless gemstones.” — Mark R., Ottawa, ON, Canada “Make sure you have some basic gemological education. I see so many online comments from jewelers who clearly have not had the opportunity/desire to learn about colored gemstones which is a disservice to their clients.” — Georgie G., Palo Alto, CA “Get your customer interested in looking at colors that she likes and wears in her clothing. You don’t have to wear your birthstone.” — Nancy & Pierre P., Swansea, MA “Every colored stone has a story: origin, physical attributes, wearability, cutter, supply vs. demand, etc. Convey your knowledge, tell the story.” — William L., Asheville, NC “Avoid long-winded technical descriptions, but use enough detail that might be pertinent to the client (i.e., hardness or where they are mined).” — Lee K., Montgomery, OH “Selling color helps if you know some folklore or back stories about the gemstone.” — Sue P., Escanaba, MI “You need to know origin and history of the variety and any personal cool things about the stone (it was cut by a left-handed cyclops).” — Tim S., Mobile, AL “I find that adding the color gem healing qualities as well as birthstone explanation helps the sale.” — Drue S., Albany, NY “It requires a very knowledgeable salesperson along with a large presence of color.” — Joe T., Lubbock, TX “Promote Tucson, showcase the color options, teach staff history and selling points.” — Brenda N., El Segundo, CA “Find out what your customer’s budget is and then sell to that budget. Let your customers know that lab-created gemstones have been around for decades and offer vibrant color options.” — Cheryl K., Lincoln, NE “Selling color by having really good color stones to begin with and then talk and listen to the customer to sell.” — Steve H., Lake Havasu City, AZ Advertisement “You got to have a story of some kind on them. People don’t understand them at all.” — Marc M., Midland, TX “Wear color: show best color, display color, get excited with colorful displays.” — Eileen E., Decatur, IN “Create a story to sell each colored gemstone.” — Kelly V., Geneva, IL “Know your different stones best that you can. Know your birthstones for each month.” — Autumn K., Tucson, AZ “Follow the months — gem of the month, your birthstone.” — Ragnar B., Vancouver, BC, Canada “Beautiful, vivid color gemstones attract attention and interest.” — Annette K., Stillwater, OK “Lab-created ruby, emerald and sapphire are starting to sell in rings with lab-created diamond side stones.” — Christine M., Boyertown, PA “Value, value. No need to discuss natural vs. lab.” — Stew B., Natick, MA “Let your customers know that the stones that you have in stock are going to be a lot more expensive with the next orders due to tariffs, etc.” — Joe C., Bristol, RI “Have a nice selection in your case.” — Natasha H., Bend, OR “Need large inventory on colored gemstones.” — Barry F., Bardonia, NY What’s the Brain Squad? If you’re the owner or top manager of a U.S. jewelry store, you’re invited to join the INSTORE Brain Squad. By taking one five-minute quiz a month, you can get a free t-shirt, be featured prominently in this magazine, and make your voice heard on key issues affecting the jewelry industry. Good deal, right? Sign up here. Advertisement Related Topics: colored gemstonescolored stonesFeatured INSTORE Staff Since launching in 2002, INSTORE has won 89 international journalism awards for its publication and website. Contact INSTORE's editors at [email protected]. click to Comment(Comment) Don't Miss 14 Gold Jewelry Designs From Retro Glam to Forever Chic Advertisement SPONSORED VIDEO Honoring a Legacy: How Smith & Son Jewelers Exceeded Every Goal With Wilkerson When Andrew Smith decided to close the Springfield, Massachusetts location of Smith & Son Jewelers, the decision came down to family. His father was retiring after 72 years in the business, and Andrew wanted to spend more time with his children and soon-to-arrive grandchildren. For this fourth-generation jeweler whose great-grandfather founded the company in 1918, closing the 107-year-old Springfield location required the right partner. Smith chose Wilkerson, and the experience exceeded expectations from start to finish. \"Everything they told me was 100% true,\" Smith says. \"The ease and use of all their tools was wonderful.\" The consultants' knowledge and expertise proved invaluable. Smith and his father set their own financial goal, but Wilkerson proposed three more ambitious targets. \"We thought we would never make it,\" Smith explains. \"We were dead wrong. We hit our first goal, second goal and third goal. It was amazing.\" Smith's recommendation is emphatic: \"I would never be able to do what they did by myself.\" You may like The Secret to Selling Colored Gemstones? Tell a Great Story And the Winner of Our December Gem Quiz Was … This Vivid Green Gem Comes From One of the Coldest Places on Earth Promoted Headlines Stop Losing Appointment Requests in Your Inbox: Meet Clientbook Appointments Honoring a Legacy: How Smith & Son Jewelers Exceeded Every Goal with Wilkerson Wilkerson Midas Chain Launches Teaser for Their New Bridal Line Advertisement Latest Trending Videos New Arrivals26 seconds ago How to Sell Colored Gemstones: 33 Retailers Share How They Do It Headlines1 day ago Petra Diamonds Unearths Huge 42-Carat Blue Diamond at Cullinan David Squires1 day ago The World Doesn’t Care About Your Drone Shot Celebrity Jewelry1 day ago Judge the Jewels: Danielle Brooks Serves Sapphire-Studded Splendor in Chopard at Critics Choice Awards Photo Gallery1 day ago Atlanta Jewelry Show: March 13–15, 2026 Cover Stories4 weeks ago Holiday Whoppers: Jewelers Share the Stories of Their Most Memorable Holiday Sales Cover Stories2 weeks ago 19 Tips to Build a Driven, Happy Team That Works to Win Buzz Session2 weeks ago 44 Jewelers Share Their 2026 Predictions: The Safe, the Wild and the Unclassifiable Cover Stories3 weeks ago 24 Tips for Motivating Your Team Best Stores2 weeks ago 21 Things You Can Stop Doing Right Now Sponsored Content3 days ago Honoring a Legacy: How Smith & Son Jewelers Exceeded Every Goal with Wilkerson Editor's Note2 weeks ago The Hidden Trap of ‘The Way Things Are Done’ in Your Jewelry Store Tips and How-To2 weeks ago ‘Kill’ Your Project Before You Even Start It (VIDEO) Sponsored Webinars1 month ago Podium Presents, Planning 2026: Doing More with Less to Win Sponsored Webinars2 months ago Podium Presents, Finish the Season Strong: Holiday Marketing That Moves the Needle Advertisement Advertisement SUBSCRIBEBULLETINS INSTORE helps you become a better jeweler with the biggest daily news headlines and useful tips. (Mailed 5x per week.) Latest Comments Most Popular Benchmarks1 week ago How 16 Creative Jewelry Retailers Make the Most of Blank Walls [Photo Gallery] Celebrity Jewelry1 week ago Here’s What Emily (and Friends) Are Wearing in Season 5 Headlines3 days ago INSTORE’s 10 Best Tips of 2025 Photo Gallery4 days ago The Best Jewels Of The 2026 Golden Globes Sponsored Content3 days ago Honoring a Legacy: How Smith & Son Jewelers Exceeded Every Goal with Wilkerson Press Releases1 week ago Jewelers of America Announces Ana Khouri as the Recipient of the 2026 GEM Award for High Jewelry Excellence Obituaries1 week ago Ben Nighthorse Campbell, Native American Senator and Illustrious Jeweler, Dies at 92 Buzz Session7 days ago Who Makes the Jewelry Business Cooler? The Big List of Retailer Responses",
  "status": "success"
}