{
  "url": "https://hypebeast.com/2026/1/50-cent-g-unit-studios-124-million-usd-investment-shreveport-louisiana-announcement",
  "title": "50 Cent Finalizes $124 Million USD Deal With Louisiana | Hypebeast",
  "extractedAt": "2026-01-18T17:43:58.857Z",
  "wordCount": 565,
  "text": "1 of 2 G-Unit Studios 2 of 2 G-Unit Studios Entertainment Jan 14, 2026 2.1K Views 0 CommentsComments Save Summary Curtis “50 Cent” Jackson and his G-Unit Studios have finalized a landmark $124 million USD agreement with the state of Louisiana to transform downtown Shreveport into a premier national destination for film, music, and digital media. The multi-phase redevelopment includes the modernization of the Millennium Studios campus, the renovation of the Stageworks facility for live events, and the groundbreaking construction of a “G-Dome” immersive venue and public green space Supported by $50 million USD in performance-based state funding, the project is projected to generate a staggering $18.8 billion USD economic impact over the next 20 years, supporting more than 6,000 jobs and revitalizing the regional economy The blueprint for a Southern entertainment powerhouse is officially set. Curtis “50 Cent” Jackson and his G-Unit Studios have cemented a transformative $124 million USD investment and redevelopment plan aimed at turning Shreveport, Louisiana, into a premier production hub. This finalized deal, announced by the Louisiana Economic Development office, marks a major milestone in Jackson’s mission to build a self-sustaining creative ecosystem far outside the traditional Hollywood gates. The capital injection is earmarked for a massive overhaul of the city’s existing infrastructure. With plans to build three entertainment venues, Jackson will breathe new life into the Stageworks venue and modernize the expansive production campus once held by Millennium Studios. Perhaps most exciting is the planned construction of a “dome-style immersive venue” paired with a lush public green space, designed to draw both tourists and top-tier talent to the heart of the city. To facilitate this ambitious vision, the state of Louisiana has committed $50 million USD in performance-based funding, ensuring the infrastructure meets the demands of 21st-century filmmaking and live performance. Governor Jeff Landry emphasized that this partnership is a testament to the state’s burgeoning business climate, stating, “Our wins span every corner of the state and every industry.” Governor Jeff Landry said of the deal, “Over the past two years, my administration has worked to build the most competitive business environment in the country. This announcement is another clear sign that our momentum is real. And that our wins span every corner of the state and every industry.” For Jackson, the project transcends simple real estate, claiming it is about providing the industry with a reason to plant roots in Northwest Louisiana. 50 Cent explained in a statement, “This project is the realization of the long-term commitment I have made to the City of Shreveport and the State of Louisiana. “By reinvesting in downtown Shreveport and upgrading existing assets to create state-of-the-art entertainment and production facilities, we are creating jobs, inspiring hope, attracting new productions, and giving the entire entertainment industry a reason to build their futures right here.” As he famously put it, the ultimate goal is to ensure that “All Roads Lead to Shreveport,” establishing a legacy of job creation, artistic innovation, and regional revitalization. Take a look at the venues’ mock-ups above. Read Full Article Related Stories >Saks Global Bankruptcy Reveals Multi-Million Dollar Debts to Luxury Icons, Chanel, Kering and More We got you covered. Don’t miss out on the latest news by signing up for our newsletters. Subscribe By subscribing, you agree to our Terms of Use and Privacy Policy. Text By Joyce Li Source The Los Angeles Times Share this article 50 CentG-Unit",
  "status": "success"
}