{
  "url": "https://hypebeast.com/2026/1/richemont-record-q3-205-7-billion-usd-sales-cartier-hong-kong-market-drivers-news",
  "title": "Richemont Defies Market Headwinds with Record-Breaking $7.4 Billion USD Quarter | Hypebeast",
  "extractedAt": "2026-01-18T17:43:58.857Z",
  "wordCount": 578,
  "text": "Kevin Carter/Getty Images Fashion Jan 16, 2026 347 Views 0 CommentsComments Save Summary Richemont achieved a record-shattering $7.43 billion USD in Q3 sales, driven by an 11 percent revenue surge that significantly outpaced analyst expectations during the 2025 holiday season The conglomerate saw robust growth in the U.S. and Middle East, while the Hong Kong market emerged as a critical driver of demand, helping the jewelry division reach a 14% increase despite high gold prices and Swiss trade tariffs Brand heat was further fueled by high-profile celebrity ambassadors, including Timothée Chalamet and Jacob Elordi, whose red-carpet appearances during the 2026 awards circuit continue to position Cartier as a dominant cultural icon While much of the luxury sector faces a cooling climate, Richemont has surged into 2026 on the back of a historic holiday performance. The Swiss conglomerate, anchored by the powerhouse Cartier, reported a record-shattering $7.43 billion USD in sales for the third quarter — an 11% increase that far outpaced analyst projections of 7.5%. This robust growth was fueled by a global holiday shopping spree, proving that high-end jewelry remains a resilient priority for affluent consumers. The U.S. market served as a primary engine for this success, posting a 14 percent gain, while Japan and the Middle East saw even more dramatic jumps of 17 and 20%, respectively. Jewelry sales led the charge with a 14% spike, but the most surprising victory came from the specialist watch division. Despite the pressure of sky-high gold prices and significant U.S. tariffs on Swiss exports, watch brands like Vacheron Constantin and Piaget managed a 7% boost, showcasing the enduring allure of “hard luxury.” In addition to the double-digit growth seen in the West, Hong Kong emerged as a vital pillar of Richemont’s record-breaking quarter. While many luxury groups have struggled to regain footing in Greater China, the Hong Kong market acted as a primary engine for the conglomerate’s Q3 surge, signaling a robust return of high-spending tourism and local demand for “hard luxury.” According to the brand report, the region saw a significant uptick in demand that directly contributed to the group’s $7.43 billion USD total. This resurgence is particularly meaningful as it helped offset broader industry anxieties regarding a “luxury slowdown” in Asia. In Hong Kong, the preference shifted heavily toward Richemont’s jewelry houses, such as Cartier and Van Cleef & Arpels, which remain the gold standard for investment-grade pieces in the region. Richemont’s cultural dominance has been further solidified by a strategic blitz of A-list ambassadors. During the recent 2026 Golden Globes, the red carpet served as a live showroom — Jacob Elordi stunned in a diamond-set platinum Privé Tank Normale, while Timothée Chalamet debuted a custom Panthère de Cartier pendant. With award season in full swing and the brand fresh off a high-profile “Santos” moment involving Taylor Swift’s recent engagement, Richemont is leveraging celebrity star power to maintain its momentum against a backdrop of fluctuating currency and material costs. Read Full Article Related Stories >SOSHIOTSUKI Makes Pitti Debut & Saks Global Files Bankruptcy in This Week's Top Fashion News >Saks Global Bankruptcy Reveals Multi-Million Dollar Debts to Luxury Icons, Chanel, Kering and More >SHINYAKOZUKA FW26 Was Inspired by \"One Single Glove\" & the Paintings of Matisse We got you covered. Don’t miss out on the latest news by signing up for our newsletters. Subscribe By subscribing, you agree to our Terms of Use and Privacy Policy. Text By Joyce Li Share this article In this Article CartierRichemont",
  "status": "success"
}