{
  "url": "https://instoremag.com/folium-unveils-new-website-marking-a-new-chapter-for-the-studio-founded-by-master-goldsmith-myles-ryan/",
  "title": "Folium Unveils New Website, Marking a New Chapter for the Studio Founded by Master Goldsmith Myles Ryan",
  "extractedAt": "2026-01-18T17:43:58.889Z",
  "wordCount": 1007,
  "text": "Press Releases Folium Unveils New Website, Marking a New Chapter for the Studio Founded by Master Goldsmith Myles Ryan The digital launch introduces four signature collections: Florilegia, Quadrafolium, Serpentis and Nectere, each rooted in natural architecture and hand-engraved craft. Published 21 seconds ago on January 15, 2026 By Press Releases Share Tweet (PRESS RELEASE) SAN FRANCISCO, CA — Folium announces the launch of its new website, www.foliumjewels.com, offering an immersive introduction to the brand’s philosophy, founder, and body of jewels. The website represents a formal articulation of Folium’s identity, with its jewelry being an enduring expression of meaning. Designed to echo the intimacy of the jewels themselves, the website places craftsmanship and storytelling at its center. Visitors are invited to move slowly through the collections and references that shape them. In an era of rapid consumption, Folium’s digital presence is intentionally contemplative, mirroring the precision behind each jewel. At the heart of Folium is founder and CEO Myles Ryan, an award-winning designer, master goldsmith, and GIA-certified gemologist based in Northern California. Myles’ work is defined by hand engraving, restraint, and a reverence for metalsmithing traditions as living practices. His path to the bench began early, introduced to metalsmithing through mentorship that fostered an intuitive relationship with metal and form. Training included studies in Eurythmy and repoussé in Switzerland, followed by formal gemological studies at the Gemological Institute of America (GIA). A formative period sourcing rare stones and refining technical precision at an atelier further shaped his approach, one grounded in discipline and intuition. “Folium is what happens when you mix decades of obsession, tens of thousands of hours perfecting the craft, and a bit of fighting spirit,” says Myles Ryan. On his inspiration for the brand, “I have a very deep connection to freedom and what it means to thrive as a human being. Folium captures the essence of this feeling. It is the first sprout of growth in the spring and the summer’s full bloom.” The launch introduces Folium’s four core collections, each unified by engraving and symbolism, yet distinct in narrative and form. Florilegia takes its name from historic botanical manuscripts, collections of preserved flowers and illustrations that documented nature before photography. In this collection, petals and botanical architecture are translated into engraved patterns that wrap continuously around bands and surfaces. Quadrafolium draws from the four-petaled motif found throughout medieval architecture and sacred geometry. Long regarded as a symbol of harmony and balance, the quadrafolium becomes a luminous compass. Serpentis explores one of humanity’s most complex symbols, the serpent. Referencing ceremonial rattlesnake motifs of the American Southwest, the collection transforms scale patterns into rhythmic, hand-engraved diamond lattices. Nectere, named for the Latin word meaning “to weave,” is a meditation on connection. Organic, branching forms twist like stems shaped by wind, cradling diamonds that appear like dew along a vine. Together, the four collections articulate a vision of jewelry as structure and symbol. Each piece emerges as an heirloom shaped by hand with intention. The website brings this vision into focus with expanded collection narratives, detailed product pages, and visual storytelling that foregrounds engraving and materiality. It serves as both a resource for collectors and a point of entry for editors, retailers, and curators seeking work with high craftsmanship. As Folium grows, it remains committed to small-scale production, hand engraving and thoughtful design. The website launch marks an important step in sharing that commitment. The new site is now live at www.foliumjewels.com. Advertisement To contact Myles Ryan directly, contact [email protected]. For inquiries regarding this press release, contact Pietra Communications at 212-913-9761 or [email protected]. Related Topics: collectioncraftsmanshipFoliumjewelryjewelry industrywebsite click to Comment(Comment) Don't Miss Atlanta Jewelry Show Announces Registration is Open and Launch of Newly Redesigned Website Advertisement SPONSORED VIDEO Honoring a Legacy: How Smith & Son Jewelers Exceeded Every Goal With Wilkerson When Andrew Smith decided to close the Springfield, Massachusetts location of Smith & Son Jewelers, the decision came down to family. His father was retiring after 72 years in the business, and Andrew wanted to spend more time with his children and soon-to-arrive grandchildren. For this fourth-generation jeweler whose great-grandfather founded the company in 1918, closing the 107-year-old Springfield location required the right partner. Smith chose Wilkerson, and the experience exceeded expectations from start to finish. \"Everything they told me was 100% true,\" Smith says. \"The ease and use of all their tools was wonderful.\" The consultants' knowledge and expertise proved invaluable. Smith and his father set their own financial goal, but Wilkerson proposed three more ambitious targets. \"We thought we would never make it,\" Smith explains. \"We were dead wrong. We hit our first goal, second goal and third goal. It was amazing.\" Smith's recommendation is emphatic: \"I would never be able to do what they did by myself.\" You may like Atlanta Jewelry Show Announces Registration is Open and Launch of Newly Redesigned Website Stuller Unveils Signature Red as Its 2026 Color of the Year LeachGarner Welcomes Linda Coutu as Director of Sales Promoted Headlines Stop Losing Appointment Requests in Your Inbox: Meet Clientbook Appointments Honoring a Legacy: How Smith & Son Jewelers Exceeded Every Goal with Wilkerson Wilkerson Midas Chain Launches Teaser for Their New Bridal Line Advertisement Advertisement SUBSCRIBEBULLETINS INSTORE helps you become a better jeweler with the biggest daily news headlines and useful tips. (Mailed 5x per week.) Advertisement Most Popular Benchmarks6 days ago How 16 Creative Jewelry Retailers Make the Most of Blank Walls [Photo Gallery] Celebrity Jewelry7 days ago Here’s What Emily (and Friends) Are Wearing in Season 5 Headlines1 week ago Holiday Retail 2025: Record Dollars, Softer Demand — and What It Means for 2026 Photo Gallery3 days ago The Best Jewels Of The 2026 Golden Globes Headlines2 days ago INSTORE’s 10 Best Tips of 2025 Sponsored Content2 days ago Honoring a Legacy: How Smith & Son Jewelers Exceeded Every Goal with Wilkerson Press Releases6 days ago Jewelers of America Announces Ana Khouri as the Recipient of the 2026 GEM Award for High Jewelry Excellence Headlines1 week ago Sacramento Jeweler Ponders Closing After Robbery (Video)",
  "status": "success"
}